; ModuleID = 'c3porn'
source_filename = "c3porn"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%Color = type { i8, i8, i8, i8 }
%any = type { ptr, i64 }
%Paddle = type { i32, i32, i32, i32, i32, %Color }
%"char[][]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"char[]" = type { ptr, i64 }

$.dyn_search = comdat any

$"$ct.c3porn.Paddle" = comdat any

$"$ct.int" = comdat any

$"$sel.acquire" = comdat any

$"$ct.anyfault" = comdat any

$"$ct.long" = comdat any

@"$ct.c3porn.Paddle" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 24, i64 0, i64 6, [0 x i64] zeroinitializer }, comdat, align 8
@c3porn.VALUE = local_unnamed_addr constant i32 256, align 4, !dbg !0
@c3porn.WINDOW_WIDTH = local_unnamed_addr constant i32 800, align 4, !dbg !4
@c3porn.WINDOW_HEIGHT = local_unnamed_addr constant i32 600, align 4, !dbg !7
@c3porn.COLS = local_unnamed_addr constant i32 30, align 4, !dbg !9
@c3porn.ROWS = local_unnamed_addr constant i32 30, align 4, !dbg !11
@c3porn.BLOCK_WIDTH = local_unnamed_addr constant i32 26, align 4, !dbg !13
@c3porn.BLOCK_HEIGHT = local_unnamed_addr constant i32 20, align 4, !dbg !15
@c3porn.DEFAULT_BLOCK_COLOR = local_unnamed_addr constant %Color { i8 -1, i8 -1, i8 -1, i8 -1 }, align 1, !dbg !17
@.str = private unnamed_addr constant [26 x i8] c"Placing block to %d, %d \0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "VALUE", linkageName: "c3porn.VALUE", scope: !2, file: !2, line: 17, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "main.c3", directory: "/home/ashly/code/c3porn/src")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "WINDOW_WIDTH", linkageName: "c3porn.WINDOW_WIDTH", scope: !2, file: !2, line: 18, type: !6, isLocal: false, isDefinition: true, align: 4)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !2, file: !2, line: 21, baseType: !3, align: 4)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "WINDOW_HEIGHT", linkageName: "c3porn.WINDOW_HEIGHT", scope: !2, file: !2, line: 19, type: !6, isLocal: false, isDefinition: true, align: 4)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "COLS", linkageName: "c3porn.COLS", scope: !2, file: !2, line: 20, type: !3, isLocal: false, isDefinition: true, align: 4)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "ROWS", linkageName: "c3porn.ROWS", scope: !2, file: !2, line: 21, type: !3, isLocal: false, isDefinition: true, align: 4)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "BLOCK_WIDTH", linkageName: "c3porn.BLOCK_WIDTH", scope: !2, file: !2, line: 22, type: !3, isLocal: false, isDefinition: true, align: 4)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "BLOCK_HEIGHT", linkageName: "c3porn.BLOCK_HEIGHT", scope: !2, file: !2, line: 23, type: !3, isLocal: false, isDefinition: true, align: 4)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "DEFAULT_BLOCK_COLOR", linkageName: "c3porn.DEFAULT_BLOCK_COLOR", scope: !2, file: !2, line: 24, type: !19, isLocal: false, isDefinition: true, align: 1)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", scope: !20, file: !2, line: 2, size: 32, align: 8, elements: !28, identifier: "colors.Color")
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Paddle", scope: !2, file: !2, line: 27, size: 192, align: 32, elements: !21, identifier: "c3porn.Paddle")
!21 = !{!22, !23, !24, !25, !26, !27}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !20, file: !2, line: 28, baseType: !3, size: 32, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !20, file: !2, line: 29, baseType: !3, size: 32, align: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !20, file: !2, line: 30, baseType: !3, size: 32, align: 32, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !20, file: !2, line: 31, baseType: !3, size: 32, align: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "velocity", scope: !20, file: !2, line: 32, baseType: !3, size: 32, align: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !20, file: !2, line: 33, baseType: !19, size: 32, align: 8, offset: 160)
!28 = !{!29, !31, !32, !33}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !19, file: !2, line: 4, baseType: !30, size: 8, align: 8)
!30 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !19, file: !2, line: 5, baseType: !30, size: 8, align: 8, offset: 8)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !19, file: !2, line: 6, baseType: !30, size: 8, align: 8, offset: 16)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !19, file: !2, line: 7, baseType: !30, size: 8, align: 8, offset: 24)
!34 = !{i32 4, !"PIE Level", i32 2}
!35 = !{i32 4, !"PIC Level", i32 2}
!36 = !{i32 2, !"Dwarf Version", i32 4}
!37 = !{i32 2, !"Debug Info Version", i32 3}
!38 = !{i32 2, !"frame-pointer", i32 2}
!39 = !{i32 1, !"uwtable", i32 2}
!40 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !41, splitDebugInlining: false)
!41 = !{!0, !4, !7, !9, !11, !13, !15, !17}
!42 = distinct !DISubprogram(name: "draw_paddle", linkageName: "c3porn.Paddle.draw_paddle", scope: !2, file: !2, line: 35, type: !43, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !45)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !20}
!45 = !{}
!46 = !DILocalVariable(name: "self", arg: 1, scope: !42, file: !2, line: 35, type: !20)
!47 = !DILocation(line: 35, column: 35, scope: !42)
!48 = !DILocalVariable(name: "width", scope: !42, file: !2, line: 36, type: !3, align: 4)
!49 = !DILocation(line: 36, column: 6, scope: !42)
!50 = !DILocation(line: 36, column: 28, scope: !42)
!51 = !DILocation(line: 36, column: 14, scope: !42)
!52 = !DILocalVariable(name: "height", scope: !42, file: !2, line: 37, type: !3, align: 4)
!53 = !DILocation(line: 37, column: 6, scope: !42)
!54 = !DILocation(line: 37, column: 30, scope: !42)
!55 = !DILocation(line: 37, column: 15, scope: !42)
!56 = !DILocation(line: 39, column: 25, scope: !42)
!57 = !DILocation(line: 39, column: 48, scope: !42)
!58 = !DILocation(line: 39, column: 2, scope: !42)
!59 = distinct !DISubprogram(name: "start_move_right", linkageName: "c3porn.Paddle.start_move_right", scope: !2, file: !2, line: 41, type: !43, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !45)
!60 = !DILocalVariable(name: "self", arg: 1, scope: !59, file: !2, line: 41, type: !20)
!61 = !DILocation(line: 41, column: 40, scope: !59)
!62 = !DILocation(line: 42, column: 2, scope: !59)
!63 = !DILocation(line: 42, column: 18, scope: !59)
!64 = distinct !DISubprogram(name: "start_move_left", linkageName: "c3porn.Paddle.start_move_left", scope: !2, file: !2, line: 44, type: !43, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !45)
!65 = !DILocalVariable(name: "self", arg: 1, scope: !64, file: !2, line: 44, type: !20)
!66 = !DILocation(line: 44, column: 39, scope: !64)
!67 = !DILocation(line: 45, column: 2, scope: !64)
!68 = !DILocation(line: 45, column: 18, scope: !64)
!69 = distinct !DISubprogram(name: "move", linkageName: "c3porn.Paddle.move", scope: !2, file: !2, line: 47, type: !43, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !45)
!70 = !DILocalVariable(name: "self", arg: 1, scope: !69, file: !2, line: 47, type: !20)
!71 = !DILocation(line: 47, column: 28, scope: !69)
!72 = !DILocation(line: 48, column: 2, scope: !69)
!73 = !DILocation(line: 48, column: 12, scope: !69)
!74 = distinct !DISubprogram(name: "stop", linkageName: "c3porn.Paddle.stop", scope: !2, file: !2, line: 50, type: !43, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !45)
!75 = !DILocalVariable(name: "self", arg: 1, scope: !74, file: !2, line: 50, type: !20)
!76 = !DILocation(line: 50, column: 28, scope: !74)
!77 = !DILocation(line: 51, column: 2, scope: !74)
!78 = !DILocation(line: 51, column: 18, scope: !74)
!79 = distinct !DISubprogram(name: "draw_block", linkageName: "c3porn.draw_block", scope: !2, file: !2, line: 54, type: !80, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !45)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !3, !3, !19}
!82 = !DILocalVariable(name: "row", arg: 1, scope: !79, file: !2, line: 54, type: !3)
!83 = !DILocation(line: 54, column: 24, scope: !79)
!84 = !DILocalVariable(name: "col", arg: 2, scope: !79, file: !2, line: 54, type: !3)
!85 = !DILocation(line: 54, column: 33, scope: !79)
!86 = !DILocalVariable(name: "color", arg: 3, scope: !79, file: !2, line: 54, type: !19)
!87 = !DILocation(line: 54, column: 52, scope: !79)
!88 = !DILocalVariable(name: "x", scope: !79, file: !2, line: 55, type: !3, align: 4)
!89 = !DILocation(line: 55, column: 6, scope: !79)
!90 = !DILocation(line: 55, column: 26, scope: !79)
!91 = !DILocation(line: 55, column: 10, scope: !79)
!92 = !DILocalVariable(name: "y", scope: !79, file: !2, line: 56, type: !3, align: 4)
!93 = !DILocation(line: 56, column: 6, scope: !79)
!94 = !DILocation(line: 56, column: 27, scope: !79)
!95 = !DILocation(line: 56, column: 10, scope: !79)
!96 = !DILocation(line: 57, column: 43, scope: !79)
!97 = !DILocation(line: 57, column: 45, scope: !79)
!98 = !DILocation(line: 57, column: 6, scope: !79)
!99 = !DILocation(line: 58, column: 50, scope: !79)
!100 = !DILocation(line: 58, column: 2, scope: !79)
!101 = distinct !DISubprogram(name: "draw_paddle", linkageName: "c3porn.draw_paddle", scope: !2, file: !2, line: 60, type: !102, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !40)
!102 = !DISubroutineType(types: !103)
!103 = !{null}
!104 = distinct !DISubprogram(name: "draw_ball", linkageName: "c3porn.draw_ball", scope: !2, file: !2, line: 63, type: !102, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !40)
!105 = distinct !DISubprogram(name: "main", linkageName: "c3porn.main", scope: !2, file: !2, line: 67, type: !106, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !45)
!106 = !DISubroutineType(types: !107)
!107 = !{!3, !108}
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !109, identifier: "String[]")
!109 = !{!110, !120}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !108, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !112, size: 64, align: 64, dwarfAddressSpace: 0)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !113)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !114, identifier: "char[]")
!114 = !{!115, !117}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !113, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !113, baseType: !118, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !119)
!119 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !108, baseType: !118, size: 64, align: 64, offset: 64)
!121 = !DILocalVariable(name: "args", arg: 1, scope: !105, file: !2, line: 67, type: !108)
!122 = !DILocation(line: 67, column: 22, scope: !105)
!123 = !DILocation(line: 69, column: 6, scope: !105)
!124 = !DILocalVariable(name: "fps", scope: !105, file: !2, line: 70, type: !6, align: 4)
!125 = !DILocation(line: 70, column: 7, scope: !105)
!126 = !DILocation(line: 70, column: 13, scope: !105)
!127 = !DILocation(line: 71, column: 2, scope: !105)
!128 = !DILocation(line: 73, column: 17, scope: !105)
!129 = !DILocation(line: 73, column: 2, scope: !105)
!130 = !DILocation(line: 75, column: 2, scope: !105)
!131 = !DILocation(line: 75, column: 9, scope: !132)
!132 = distinct !DILexicalBlock(scope: !105, file: !2, line: 75, column: 2)
!133 = !DILocation(line: 76, column: 3, scope: !134)
!134 = distinct !DILexicalBlock(scope: !132, file: !2, line: 75, column: 31)
!135 = !DILocation(line: 78, column: 28, scope: !134)
!136 = !DILocation(line: 78, column: 3, scope: !134)
!137 = !DILocation(line: 80, column: 30, scope: !134)
!138 = !DILocation(line: 80, column: 3, scope: !134)
!139 = !DILocation(line: 82, column: 3, scope: !134)
!140 = !DILocation(line: 84, column: 6, scope: !105)
!141 = !DILocation(line: 85, column: 2, scope: !105)
!142 = !DILocation(line: 87, column: 9, scope: !105)
!143 = distinct !DISubprogram(name: "_$main", linkageName: "main", scope: !2, file: !2, line: 67, type: !144, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !45)
!144 = !DISubroutineType(types: !145)
!145 = !{!3, !3, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char**", baseType: !116, size: 64, align: 64, dwarfAddressSpace: 0)
!147 = !DILocalVariable(name: ".anon", arg: 1, scope: !143, file: !2, line: 67, type: !3)
!148 = !DILocation(line: 67, column: 8, scope: !143)
!149 = !DILocalVariable(name: ".anon", arg: 2, scope: !143, file: !2, line: 67, type: !146)
!150 = !DILocalVariable(name: "list", scope: !151, file: !2, line: 45, type: !108, align: 8)
!151 = distinct !DISubprogram(name: "@main_to_int_main_args", linkageName: "@main_to_int_main_args", scope: !152, file: !152, line: 43, scopeLine: 43, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !45)
!152 = !DIFile(filename: "main_stub.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core/private")
!153 = !DILocation(line: 45, column: 11, scope: !151, inlinedAt: !148)
!154 = !DILocalVariable(name: "list", scope: !155, file: !2, line: 24, type: !108, align: 8)
!155 = distinct !DISubprogram(name: "args_to_strings", linkageName: "args_to_strings", scope: !152, file: !152, line: 22, scopeLine: 22, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !45)
!156 = !DILocation(line: 24, column: 11, scope: !155, inlinedAt: !157)
!157 = !DILocation(line: 45, column: 18, scope: !151, inlinedAt: !148)
!158 = !DILocation(line: 24, column: 43, scope: !155, inlinedAt: !157)
!159 = !DILocation(line: 286, column: 55, scope: !160, inlinedAt: !162)
!160 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !161, file: !161, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40)
!161 = !DIFile(filename: "mem_allocator.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!162 = !DILocation(line: 269, column: 9, scope: !163, inlinedAt: !164)
!163 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !161, file: !161, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40)
!164 = !DILocation(line: 708, column: 20, scope: !165, inlinedAt: !167)
!165 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !166, file: !166, line: 706, scopeLine: 706, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40)
