; ModuleID = 'std::time::datetime'
source_filename = "std::time::datetime"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%TzDateTime = type { %DateTime, i32 }
%DateTime = type { i32, i8, i8, i8, i8, i8, i8, i32, i16, i64 }
%Tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, ptr }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.time.DateTime.to_local = comdat any

$std.time.DateTime.with_gmt_offset = comdat any

$std.time.TzDateTime.with_gmt_offset = comdat any

$std.time.DateTime.to_gmt_offset = comdat any

$std.time.TzDateTime.to_gmt_offset = comdat any

$std.time.DateTime.set_date = comdat any

$std.time.DateTime.set_time = comdat any

$std.time.DateTime.add_seconds = comdat any

$std.time.DateTime.add_minutes = comdat any

$std.time.DateTime.add_hours = comdat any

$std.time.DateTime.add_days = comdat any

$std.time.DateTime.add_weeks = comdat any

$std.time.DateTime.add_years = comdat any

$std.time.DateTime.add_months = comdat any

$std.time.TzDateTime.add_seconds = comdat any

$std.time.TzDateTime.add_minutes = comdat any

$std.time.TzDateTime.add_hours = comdat any

$std.time.TzDateTime.add_days = comdat any

$std.time.TzDateTime.add_weeks = comdat any

$std.time.TzDateTime.add_years = comdat any

$std.time.TzDateTime.add_months = comdat any

$std.time.DateTime.to_time = comdat any


!0 = !{i32 4, !"PIE Level", i32 2}
!1 = !{i32 4, !"PIC Level", i32 2}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = !{i32 2, !"Debug Info Version", i32 3}
!4 = !{i32 2, !"frame-pointer", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "datetime.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/time")
!8 = !{!9, !21}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Month", scope: !10, file: !7, line: 60, baseType: !15, size: 8, align: 8, elements: !36)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "DateTime", scope: !7, file: !7, line: 29, size: 256, align: 64, elements: !11, identifier: "std.time.DateTime")
!11 = !{!12, !14, !16, !17, !18, !19, !20, !30, !31, !33}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "usec", scope: !10, file: !7, line: 31, baseType: !13, size: 32, align: 32)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !10, file: !7, line: 32, baseType: !15, size: 8, align: 8, offset: 32)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !10, file: !7, line: 33, baseType: !15, size: 8, align: 8, offset: 40)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !10, file: !7, line: 34, baseType: !15, size: 8, align: 8, offset: 48)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !10, file: !7, line: 35, baseType: !15, size: 8, align: 8, offset: 56)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !10, file: !7, line: 36, baseType: !9, size: 8, align: 8, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "weekday", scope: !10, file: !7, line: 37, baseType: !21, size: 8, align: 8, offset: 72)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Weekday", scope: !10, file: !7, line: 49, baseType: !15, size: 8, align: 8, elements: !22)
!22 = !{!23, !24, !25, !26, !27, !28, !29}
!23 = !DIEnumerator(name: "MONDAY", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "TUESDAY", value: 1, isUnsigned: true)
!25 = !DIEnumerator(name: "WEDNESDAY", value: 2, isUnsigned: true)
!26 = !DIEnumerator(name: "THURSDAY", value: 3, isUnsigned: true)
!27 = !DIEnumerator(name: "FRIDAY", value: 4, isUnsigned: true)
!28 = !DIEnumerator(name: "SATURDAY", value: 5, isUnsigned: true)
!29 = !DIEnumerator(name: "SUNDAY", value: 6, isUnsigned: true)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !10, file: !7, line: 38, baseType: !13, size: 32, align: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "year_day", scope: !10, file: !7, line: 39, baseType: !32, size: 16, align: 16, offset: 128)
!32 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !10, file: !7, line: 40, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time", scope: !7, file: !7, line: 4, baseType: !35, align: 8)
!35 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!37 = !DIEnumerator(name: "JANUARY", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "FEBRUARY", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "MARCH", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "APRIL", value: 3, isUnsigned: true)
!41 = !DIEnumerator(name: "MAY", value: 4, isUnsigned: true)
!42 = !DIEnumerator(name: "JUNE", value: 5, isUnsigned: true)
!43 = !DIEnumerator(name: "JULY", value: 6, isUnsigned: true)
!44 = !DIEnumerator(name: "AUGUST", value: 7, isUnsigned: true)
!45 = !DIEnumerator(name: "SEPTEMBER", value: 8, isUnsigned: true)
!46 = !DIEnumerator(name: "OCTOBER", value: 9, isUnsigned: true)
!47 = !DIEnumerator(name: "NOVEMBER", value: 10, isUnsigned: true)
!48 = !DIEnumerator(name: "DECEMBER", value: 11, isUnsigned: true)
!49 = distinct !DISubprogram(name: "to_local", linkageName: "std.time.DateTime.to_local", scope: !7, file: !7, line: 36, type: !50, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !57)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !56}
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "TzDateTime", scope: !7, file: !7, line: 43, size: 320, align: 64, elements: !53, identifier: "std.time.TzDateTime")
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "date_time", scope: !52, file: !7, line: 45, baseType: !10, size: 256, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "gmt_offset", scope: !52, file: !7, line: 46, baseType: !13, size: 32, align: 32, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DateTime*", baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
!57 = !{}
!58 = !DILocation(line: 37, column: 1, scope: !49)
!59 = !DILocalVariable(name: "self", arg: 1, scope: !49, file: !7, line: 36, type: !56)
!60 = !DILocation(line: 36, column: 33, scope: !49)
!61 = !DILocalVariable(name: "tm", scope: !49, file: !7, line: 38, type: !62, align: 8)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tm", scope: !7, file: !7, line: 400, size: 448, align: 64, elements: !63, identifier: "libc.Tm")
!63 = !{!64, !66, !67, !68, !69, !70, !71, !72, !73, !74, !76}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !62, file: !7, line: 402, baseType: !65, size: 32, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !7, file: !7, line: 21, baseType: !13, align: 4)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !62, file: !7, line: 403, baseType: !65, size: 32, align: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !62, file: !7, line: 404, baseType: !65, size: 32, align: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !62, file: !7, line: 405, baseType: !65, size: 32, align: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !62, file: !7, line: 406, baseType: !65, size: 32, align: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !62, file: !7, line: 407, baseType: !65, size: 32, align: 32, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !62, file: !7, line: 408, baseType: !65, size: 32, align: 32, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !62, file: !7, line: 409, baseType: !65, size: 32, align: 32, offset: 224)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !62, file: !7, line: 410, baseType: !65, size: 32, align: 32, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !62, file: !7, line: 411, baseType: !75, size: 64, align: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimeOffset", scope: !7, file: !7, line: 428, baseType: !35, align: 8)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !62, file: !7, line: 412, baseType: !77, size: 64, align: 64, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!78 = !DILocation(line: 38, column: 5, scope: !49)
!79 = !DILocalVariable(name: "time_t", scope: !49, file: !7, line: 39, type: !80, align: 8)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time_t", scope: !7, file: !7, line: 63, baseType: !35, align: 8)
!81 = !DILocation(line: 39, column: 9, scope: !49)
!82 = !DILocation(line: 39, column: 26, scope: !49)
!83 = !DILocation(line: 39, column: 19, scope: !49)
!84 = !DILocation(line: 40, column: 8, scope: !49)
!85 = !DILocalVariable(name: "dt", scope: !49, file: !7, line: 41, type: !52, align: 8)
!86 = !DILocation(line: 41, column: 13, scope: !49)
!87 = !DILocation(line: 42, column: 24, scope: !49)
!88 = !DILocation(line: 42, column: 13, scope: !49)
!89 = !DILocation(line: 43, column: 2, scope: !49)
!90 = !DILocation(line: 43, column: 17, scope: !49)
!91 = !DILocation(line: 44, column: 2, scope: !49)
!92 = !DILocation(line: 44, column: 17, scope: !49)
!93 = !DILocation(line: 45, column: 2, scope: !49)
!94 = !DILocation(line: 45, column: 18, scope: !49)
!95 = !DILocation(line: 46, column: 2, scope: !49)
!96 = !DILocation(line: 46, column: 17, scope: !49)
!97 = !DILocation(line: 47, column: 2, scope: !49)
!98 = !DILocation(line: 47, column: 20, scope: !49)
!99 = !DILocation(line: 47, column: 14, scope: !49)
!100 = !DILocation(line: 48, column: 2, scope: !49)
!101 = !DILocation(line: 48, column: 12, scope: !49)
!102 = !DILocation(line: 49, column: 2, scope: !49)
!103 = !DILocation(line: 49, column: 16, scope: !49)
!104 = !DILocation(line: 49, column: 29, scope: !49)
!105 = !DILocation(line: 49, column: 55, scope: !49)
!106 = !DILocation(line: 49, column: 47, scope: !49)
!107 = !DILocation(line: 50, column: 2, scope: !49)
!108 = !DILocation(line: 50, column: 24, scope: !49)
!109 = !DILocation(line: 51, column: 2, scope: !49)
!110 = !DILocation(line: 51, column: 12, scope: !49)
!111 = !DILocation(line: 53, column: 3, scope: !49)
!112 = !DILocation(line: 53, column: 24, scope: !49)
!113 = !DILocation(line: 60, column: 9, scope: !49)
!114 = distinct !DISubprogram(name: "with_gmt_offset", linkageName: "std.time.DateTime.with_gmt_offset", scope: !7, file: !7, line: 69, type: !115, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !57)
!115 = !DISubroutineType(types: !116)
!116 = !{!52, !10, !13}
!117 = !DILocalVariable(name: "self", arg: 1, scope: !114, file: !7, line: 69, type: !10)
!118 = !DILocation(line: 69, column: 40, scope: !114)
!119 = !DILocalVariable(name: "gmt_offset", arg: 2, scope: !114, file: !7, line: 69, type: !13)
!120 = !DILocation(line: 69, column: 50, scope: !114)
!121 = !DILocation(line: 67, column: 11, scope: !122)
!122 = distinct !DILexicalBlock(scope: !114, file: !7, line: 70, column: 1)
!123 = !DILocation(line: 67, column: 39, scope: !122)
!124 = !DILocalVariable(name: "dt", scope: !114, file: !7, line: 71, type: !52, align: 8)
!125 = !DILocation(line: 71, column: 13, scope: !114)
!126 = !DILocation(line: 71, column: 20, scope: !114)
!127 = !DILocation(line: 71, column: 26, scope: !114)
!128 = !DILocation(line: 72, column: 9, scope: !114)
!129 = distinct !DISubprogram(name: "with_gmt_offset", linkageName: "std.time.TzDateTime.with_gmt_offset", scope: !7, file: !7, line: 81, type: !130, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !57)
!130 = !DISubroutineType(types: !131)
!131 = !{!52, !52, !13}
!132 = !DILocalVariable(name: "self", arg: 1, scope: !129, file: !7, line: 81, type: !52)
!133 = !DILocation(line: 81, column: 42, scope: !129)
!134 = !DILocalVariable(name: "gmt_offset", arg: 2, scope: !129, file: !7, line: 81, type: !13)
!135 = !DILocation(line: 81, column: 52, scope: !129)
!136 = !DILocation(line: 79, column: 11, scope: !137)
