; ModuleID = 'std::os::linux'
source_filename = "std::os::linux"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%Backtrace = type { i64, %"char[]", %"char[]", %"char[]", i32, %any, i8 }
%any = type { ptr, i64 }
%File = type { ptr }
%Elf64_Ehdr = type { [16 x i8], i16, i16, i32, i64, i64, i64, i32, i16, i16, i16, i16, i16, i16 }
%Elf64_Phdr = type { i32, i32, i64, i64, i64, i64, i64, i64 }
%Elf32_Ehdr = type { [16 x i8], i16, i16, i32, i32, i32, i32, i32, i16, i16, i16, i16, i16, i16 }
%Elf32_Phdr = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%"char[][]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Linux_Dl_info = type { ptr, ptr, ptr, ptr }
%"void*[]" = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }

$std.os.linux.backtrace_line_parse = comdat any

$std.os.linux.symbolize_backtrace = comdat any

$"$ct.std.os.linux.Elf32_Ehdr" = comdat any

$"$ct.std.os.linux.Elf32_Phdr" = comdat any

$"$ct.std.os.linux.Elf64_Ehdr" = comdat any

$"$ct.std.os.linux.Elf64_Phdr" = comdat any

$"$ct.std.os.linux.Linux_Dl_info" = comdat any

$std.os.linux.PT_PHDR = comdat any

$std.os.linux.EI_NIDENT = comdat any

$"std.io.IoError$ALREADY_EXISTS" = comdat any

$"std.io.IoError$BUSY" = comdat any

$"std.io.IoError$CANNOT_READ_DIR" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PT_PHDR", linkageName: "std.os.linux.PT_PHDR", scope: !2, file: !2, line: 6, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "linux.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/os/linux")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "EI_NIDENT", linkageName: "std.os.linux.EI_NIDENT", scope: !2, file: !2, line: 7, type: !3, isLocal: false, isDefinition: true, align: 4)
!6 = !{i32 4, !"PIE Level", i32 2}
!7 = !{i32 4, !"PIC Level", i32 2}
!8 = !{i32 2, !"Dwarf Version", i32 4}
!9 = !{i32 2, !"Debug Info Version", i32 3}
!10 = !{i32 2, !"frame-pointer", i32 2}
!11 = !{i32 1, !"uwtable", i32 2}
!12 = distinct !DICompileUnit(language: DW_LANG_C11, file: !13, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !14, splitDebugInlining: false)
!13 = !DIFile(filename: "heap.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/os/linux")
!14 = !{!0, !4}
!15 = distinct !DISubprogram(name: "elf_module_image_base", linkageName: "std.os.linux.elf_module_image_base", scope: !2, file: !2, line: 92, type: !16, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, retainedNodes: !30)
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !20, !23}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !19)
!19 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !22)
!22 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !25, identifier: "char[]")
!25 = !{!26, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !24, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !24, baseType: !21, size: 64, align: 64, offset: 64)
!30 = !{}
!31 = !DILocalVariable(name: "path", arg: 1, scope: !15, file: !2, line: 92, type: !23)
!32 = !DILocation(line: 92, column: 40, scope: !15)
!33 = !DILocalVariable(name: "file", scope: !15, file: !2, line: 94, type: !34, align: 8)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !2, file: !2, line: 4, size: 64, align: 64, elements: !35, identifier: "std.io.File")
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !34, file: !2, line: 6, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !2, file: !2, line: 360, baseType: !38, align: 8)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!39 = !DILocation(line: 94, column: 7, scope: !15)
!40 = !DILocation(line: 94, column: 20, scope: !15)
!41 = !DILocalVariable(name: "buffer", scope: !15, file: !2, line: 96, type: !42, align: 1)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 32, align: 8, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 4, lowerBound: 0)
!45 = !DILocation(line: 96, column: 10, scope: !15)
!46 = !DILocation(line: 97, column: 23, scope: !15)
!47 = !DILocation(line: 74, column: 6, scope: !48, inlinedAt: !50)
!48 = distinct !DISubprogram(name: "read_all", linkageName: "read_all", scope: !49, file: !49, line: 72, scopeLine: 72, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, retainedNodes: !30)
!49 = !DIFile(filename: "stream.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/io")
!50 = !DILocation(line: 97, column: 6, scope: !15)
!51 = !DILocation(line: 74, column: 30, scope: !48, inlinedAt: !50)
!52 = !DILocalVariable(name: "n", scope: !48, file: !2, line: 75, type: !21, align: 8)
!53 = !DILocation(line: 75, column: 6, scope: !48, inlinedAt: !50)
!54 = !DILocation(line: 75, column: 10, scope: !48, inlinedAt: !50)
!55 = !DILocation(line: 76, column: 6, scope: !48, inlinedAt: !50)
!56 = !DILocation(line: 76, column: 11, scope: !48, inlinedAt: !50)
!57 = !DILocation(line: 76, column: 30, scope: !48, inlinedAt: !50)
!58 = !DILocation(line: 77, column: 9, scope: !48, inlinedAt: !50)
!59 = !DILocation(line: 95, column: 9, scope: !60)
!60 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!61 = !DILocation(line: 98, column: 16, scope: !15)
!62 = !DILocation(line: 98, column: 6, scope: !15)
!63 = !DILocation(line: 95, column: 9, scope: !64)
!64 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!65 = !DILocalVariable(name: "is_64", scope: !15, file: !2, line: 99, type: !66, align: 1)
!66 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!67 = !DILocation(line: 99, column: 7, scope: !15)
!68 = !DILocation(line: 99, column: 15, scope: !15)
!69 = !DILocation(line: 95, column: 9, scope: !70)
!70 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!71 = !DILocalVariable(name: "is_little_endian", scope: !15, file: !2, line: 100, type: !66, align: 1)
!72 = !DILocation(line: 100, column: 7, scope: !15)
!73 = !DILocation(line: 100, column: 26, scope: !15)
!74 = !DILocation(line: 95, column: 9, scope: !75)
!75 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!76 = !DILocation(line: 102, column: 7, scope: !15)
!77 = !DILocation(line: 95, column: 9, scope: !78)
!78 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!79 = !DILocation(line: 103, column: 2, scope: !15)
!80 = !DILocation(line: 95, column: 9, scope: !81)
!81 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!82 = !DILocation(line: 104, column: 6, scope: !15)
!83 = !DILocalVariable(name: "file_header", scope: !84, file: !2, line: 106, type: !85, align: 8)
!84 = distinct !DILexicalBlock(scope: !15, file: !2, line: 105, column: 2)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "Elf64_Ehdr", scope: !2, file: !2, line: 52, size: 512, align: 64, elements: !86, identifier: "std.os.linux.Elf64_Ehdr")
!86 = !{!87, !91, !94, !95, !98, !100, !102, !103, !104, !105, !106, !107, !108, !109}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "e_ident", scope: !85, file: !2, line: 54, baseType: !88, size: 128, align: 8)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 128, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 16, lowerBound: 0)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "e_type", scope: !85, file: !2, line: 55, baseType: !92, size: 16, align: 16, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Half", scope: !2, file: !2, line: 44, baseType: !93, align: 2)
!93 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "e_machine", scope: !85, file: !2, line: 56, baseType: !92, size: 16, align: 16, offset: 144)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "e_version", scope: !85, file: !2, line: 57, baseType: !96, size: 32, align: 32, offset: 160)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Word", scope: !2, file: !2, line: 46, baseType: !97, align: 4)
!97 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "e_entry", scope: !85, file: !2, line: 58, baseType: !99, size: 64, align: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Addr", scope: !2, file: !2, line: 43, baseType: !22, align: 8)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "e_phoff", scope: !85, file: !2, line: 59, baseType: !101, size: 64, align: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Off", scope: !2, file: !2, line: 45, baseType: !22, align: 8)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "e_shoff", scope: !85, file: !2, line: 60, baseType: !101, size: 64, align: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "e_flags", scope: !85, file: !2, line: 61, baseType: !96, size: 32, align: 32, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "e_ehsize", scope: !85, file: !2, line: 62, baseType: !92, size: 16, align: 16, offset: 416)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "e_phentsize", scope: !85, file: !2, line: 63, baseType: !92, size: 16, align: 16, offset: 432)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "e_phnum", scope: !85, file: !2, line: 64, baseType: !92, size: 16, align: 16, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "e_shentsize", scope: !85, file: !2, line: 65, baseType: !92, size: 16, align: 16, offset: 464)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "e_shnum", scope: !85, file: !2, line: 66, baseType: !92, size: 16, align: 16, offset: 480)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "e_shstrndx", scope: !85, file: !2, line: 67, baseType: !92, size: 16, align: 16, offset: 496)
!110 = !DILocation(line: 106, column: 14, scope: !84)
!111 = !DILocation(line: 107, column: 24, scope: !84)
!112 = !DILocation(line: 56, column: 28, scope: !113, inlinedAt: !114)
!113 = distinct !DISubprogram(name: "read_any", linkageName: "read_any", scope: !49, file: !49, line: 54, scopeLine: 54, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12)
!114 = !DILocation(line: 107, column: 7, scope: !84)
!115 = !DILocation(line: 56, column: 40, scope: !113, inlinedAt: !114)
!116 = !DILocation(line: 74, column: 6, scope: !117, inlinedAt: !118)
!117 = distinct !DISubprogram(name: "read_all", linkageName: "read_all", scope: !49, file: !49, line: 72, scopeLine: 72, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, retainedNodes: !30)
!118 = !DILocation(line: 56, column: 9, scope: !113, inlinedAt: !114)
!119 = !DILocation(line: 74, column: 30, scope: !117, inlinedAt: !118)
!120 = !DILocalVariable(name: "n", scope: !117, file: !2, line: 75, type: !21, align: 8)
!121 = !DILocation(line: 75, column: 6, scope: !117, inlinedAt: !118)
!122 = !DILocation(line: 75, column: 10, scope: !117, inlinedAt: !118)
!123 = !DILocation(line: 76, column: 6, scope: !117, inlinedAt: !118)
!124 = !DILocation(line: 76, column: 11, scope: !117, inlinedAt: !118)
!125 = !DILocation(line: 76, column: 30, scope: !117, inlinedAt: !118)
!126 = !DILocation(line: 77, column: 9, scope: !117, inlinedAt: !118)
!127 = !DILocation(line: 95, column: 9, scope: !128)
!128 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!129 = !DILocation(line: 108, column: 7, scope: !84)
!130 = !DILocation(line: 95, column: 9, scope: !131)
!131 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!132 = !DILocalVariable(name: "i", scope: !133, file: !2, line: 109, type: !134, align: 8)
!133 = distinct !DILexicalBlock(scope: !84, file: !2, line: 109, column: 3)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !19)
!135 = !DILocation(line: 109, column: 12, scope: !133)
!136 = !DILocation(line: 109, column: 16, scope: !133)
!137 = !DILocation(line: 109, column: 19, scope: !133)
!138 = !DILocation(line: 109, column: 23, scope: !133)
!139 = !DILocalVariable(name: "header", scope: !140, file: !2, line: 111, type: !141, align: 8)
!140 = distinct !DILexicalBlock(scope: !133, file: !2, line: 110, column: 3)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "Elf64_Phdr", scope: !2, file: !2, line: 70, size: 448, align: 64, elements: !142, identifier: "std.os.linux.Elf64_Phdr")
!142 = !{!143, !144, !145, !146, !147, !148, !150, !151}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "p_type", scope: !141, file: !2, line: 72, baseType: !96, size: 32, align: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "p_flags", scope: !141, file: !2, line: 73, baseType: !96, size: 32, align: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "p_offset", scope: !141, file: !2, line: 74, baseType: !101, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "p_vaddr", scope: !141, file: !2, line: 75, baseType: !99, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "p_paddr", scope: !141, file: !2, line: 76, baseType: !99, size: 64, align: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "p_filesz", scope: !141, file: !2, line: 77, baseType: !149, size: 64, align: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Xword", scope: !2, file: !2, line: 50, baseType: !22, align: 8)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "p_memsz", scope: !141, file: !2, line: 78, baseType: !149, size: 64, align: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "p_align", scope: !141, file: !2, line: 79, baseType: !149, size: 64, align: 64, offset: 384)
!152 = !DILocation(line: 111, column: 15, scope: !140)
!153 = !DILocation(line: 112, column: 19, scope: !140)
!154 = !DILocation(line: 112, column: 46, scope: !140)
!155 = !DILocation(line: 112, column: 72, scope: !140)
!156 = !DILocation(line: 112, column: 42, scope: !140)
!157 = !DILocation(line: 112, column: 15, scope: !140)
!158 = !DILocation(line: 112, column: 4, scope: !140)
!159 = !DILocation(line: 95, column: 9, scope: !160)
!160 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!161 = !DILocation(line: 113, column: 25, scope: !140)
!162 = !DILocation(line: 56, column: 28, scope: !163, inlinedAt: !164)
!163 = distinct !DISubprogram(name: "read_any", linkageName: "read_any", scope: !49, file: !49, line: 54, scopeLine: 54, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12)
!164 = !DILocation(line: 113, column: 8, scope: !140)
!165 = !DILocation(line: 56, column: 40, scope: !163, inlinedAt: !164)
!166 = !DILocation(line: 74, column: 6, scope: !167, inlinedAt: !168)
!167 = distinct !DISubprogram(name: "read_all", linkageName: "read_all", scope: !49, file: !49, line: 72, scopeLine: 72, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, retainedNodes: !30)
!168 = !DILocation(line: 56, column: 9, scope: !163, inlinedAt: !164)
!169 = !DILocation(line: 74, column: 30, scope: !167, inlinedAt: !168)
!170 = !DILocalVariable(name: "n", scope: !167, file: !2, line: 75, type: !21, align: 8)
!171 = !DILocation(line: 75, column: 6, scope: !167, inlinedAt: !168)
!172 = !DILocation(line: 75, column: 10, scope: !167, inlinedAt: !168)
!173 = !DILocation(line: 76, column: 6, scope: !167, inlinedAt: !168)
!174 = !DILocation(line: 76, column: 11, scope: !167, inlinedAt: !168)
!175 = !DILocation(line: 76, column: 30, scope: !167, inlinedAt: !168)
!176 = !DILocation(line: 77, column: 9, scope: !167, inlinedAt: !168)
!177 = !DILocation(line: 95, column: 9, scope: !178)
!178 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!179 = !DILocation(line: 114, column: 8, scope: !140)
!180 = !DILocation(line: 114, column: 41, scope: !140)
!181 = !DILocation(line: 114, column: 58, scope: !140)
!182 = !DILocation(line: 95, column: 9, scope: !183)
!183 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!184 = !DILocation(line: 109, column: 44, scope: !133)
!185 = !DILocation(line: 95, column: 9, scope: !186)
!186 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!187 = !DILocalVariable(name: "file_header", scope: !15, file: !2, line: 118, type: !188, align: 4)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "Elf32_Ehdr", scope: !2, file: !2, line: 13, size: 416, align: 32, elements: !189, identifier: "std.os.linux.Elf32_Ehdr")
!189 = !{!190, !191, !193, !194, !196, !198, !200, !201, !202, !203, !204, !205, !206, !207}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "e_ident", scope: !188, file: !2, line: 15, baseType: !88, size: 128, align: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "e_type", scope: !188, file: !2, line: 16, baseType: !192, size: 16, align: 16, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf32_Half", scope: !2, file: !2, line: 8, baseType: !93, align: 2)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "e_machine", scope: !188, file: !2, line: 17, baseType: !192, size: 16, align: 16, offset: 144)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "e_version", scope: !188, file: !2, line: 18, baseType: !195, size: 32, align: 32, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf32_Word", scope: !2, file: !2, line: 9, baseType: !97, align: 4)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "e_entry", scope: !188, file: !2, line: 19, baseType: !197, size: 32, align: 32, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf32_Addr", scope: !2, file: !2, line: 10, baseType: !97, align: 4)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "e_phoff", scope: !188, file: !2, line: 20, baseType: !199, size: 32, align: 32, offset: 224)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf32_Off", scope: !2, file: !2, line: 11, baseType: !97, align: 4)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "e_shoff", scope: !188, file: !2, line: 21, baseType: !199, size: 32, align: 32, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "e_flags", scope: !188, file: !2, line: 22, baseType: !195, size: 32, align: 32, offset: 288)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "e_ehsize", scope: !188, file: !2, line: 23, baseType: !192, size: 16, align: 16, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "e_phentsize", scope: !188, file: !2, line: 24, baseType: !192, size: 16, align: 16, offset: 336)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "e_phnum", scope: !188, file: !2, line: 25, baseType: !192, size: 16, align: 16, offset: 352)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "e_shentsize", scope: !188, file: !2, line: 26, baseType: !192, size: 16, align: 16, offset: 368)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "e_shnum", scope: !188, file: !2, line: 27, baseType: !192, size: 16, align: 16, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "e_shstrndx", scope: !188, file: !2, line: 28, baseType: !192, size: 16, align: 16, offset: 400)
!208 = !DILocation(line: 118, column: 13, scope: !15)
!209 = !DILocation(line: 119, column: 23, scope: !15)
!210 = !DILocation(line: 56, column: 28, scope: !211, inlinedAt: !212)
!211 = distinct !DISubprogram(name: "read_any", linkageName: "read_any", scope: !49, file: !49, line: 54, scopeLine: 54, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12)
!212 = !DILocation(line: 119, column: 6, scope: !15)
!213 = !DILocation(line: 56, column: 40, scope: !211, inlinedAt: !212)
!214 = !DILocation(line: 74, column: 6, scope: !215, inlinedAt: !216)
!215 = distinct !DISubprogram(name: "read_all", linkageName: "read_all", scope: !49, file: !49, line: 72, scopeLine: 72, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, retainedNodes: !30)
!216 = !DILocation(line: 56, column: 9, scope: !211, inlinedAt: !212)
!217 = !DILocation(line: 74, column: 30, scope: !215, inlinedAt: !216)
!218 = !DILocalVariable(name: "n", scope: !215, file: !2, line: 75, type: !21, align: 8)
!219 = !DILocation(line: 75, column: 6, scope: !215, inlinedAt: !216)
!220 = !DILocation(line: 75, column: 10, scope: !215, inlinedAt: !216)
!221 = !DILocation(line: 76, column: 6, scope: !215, inlinedAt: !216)
!222 = !DILocation(line: 76, column: 11, scope: !215, inlinedAt: !216)
!223 = !DILocation(line: 76, column: 30, scope: !215, inlinedAt: !216)
!224 = !DILocation(line: 77, column: 9, scope: !215, inlinedAt: !216)
!225 = !DILocation(line: 95, column: 9, scope: !226)
!226 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!227 = !DILocation(line: 120, column: 6, scope: !15)
!228 = !DILocation(line: 95, column: 9, scope: !229)
!229 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!230 = !DILocalVariable(name: "i", scope: !231, file: !2, line: 121, type: !134, align: 8)
!231 = distinct !DILexicalBlock(scope: !15, file: !2, line: 121, column: 2)
!232 = !DILocation(line: 121, column: 11, scope: !231)
!233 = !DILocation(line: 121, column: 15, scope: !231)
!234 = !DILocation(line: 121, column: 18, scope: !231)
!235 = !DILocation(line: 121, column: 22, scope: !231)
!236 = !DILocalVariable(name: "header", scope: !237, file: !2, line: 123, type: !238, align: 4)
!237 = distinct !DILexicalBlock(scope: !231, file: !2, line: 122, column: 2)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Elf32_Phdr", scope: !2, file: !2, line: 31, size: 256, align: 32, elements: !239, identifier: "std.os.linux.Elf32_Phdr")
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "p_type", scope: !238, file: !2, line: 33, baseType: !195, size: 32, align: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "p_offset", scope: !238, file: !2, line: 34, baseType: !199, size: 32, align: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "p_vaddr", scope: !238, file: !2, line: 35, baseType: !197, size: 32, align: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "p_paddr", scope: !238, file: !2, line: 36, baseType: !197, size: 32, align: 32, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "p_filesz", scope: !238, file: !2, line: 37, baseType: !195, size: 32, align: 32, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "p_memsz", scope: !238, file: !2, line: 38, baseType: !195, size: 32, align: 32, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "p_flags", scope: !238, file: !2, line: 39, baseType: !195, size: 32, align: 32, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "p_align", scope: !238, file: !2, line: 40, baseType: !195, size: 32, align: 32, offset: 224)
!248 = !DILocation(line: 123, column: 14, scope: !237)
!249 = !DILocation(line: 124, column: 13, scope: !237)
!250 = !DILocation(line: 124, column: 40, scope: !237)
!251 = !DILocation(line: 124, column: 66, scope: !237)
!252 = !DILocation(line: 124, column: 36, scope: !237)
!253 = !DILocation(line: 124, column: 3, scope: !237)
!254 = !DILocation(line: 95, column: 9, scope: !255)
!255 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!256 = !DILocation(line: 125, column: 24, scope: !237)
!257 = !DILocation(line: 56, column: 28, scope: !258, inlinedAt: !259)
!258 = distinct !DISubprogram(name: "read_any", linkageName: "read_any", scope: !49, file: !49, line: 54, scopeLine: 54, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12)
!259 = !DILocation(line: 125, column: 7, scope: !237)
!260 = !DILocation(line: 56, column: 40, scope: !258, inlinedAt: !259)
!261 = !DILocation(line: 74, column: 6, scope: !262, inlinedAt: !263)
!262 = distinct !DISubprogram(name: "read_all", linkageName: "read_all", scope: !49, file: !49, line: 72, scopeLine: 72, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, retainedNodes: !30)
!263 = !DILocation(line: 56, column: 9, scope: !258, inlinedAt: !259)
!264 = !DILocation(line: 74, column: 30, scope: !262, inlinedAt: !263)
!265 = !DILocalVariable(name: "n", scope: !262, file: !2, line: 75, type: !21, align: 8)
!266 = !DILocation(line: 75, column: 6, scope: !262, inlinedAt: !263)
!267 = !DILocation(line: 75, column: 10, scope: !262, inlinedAt: !263)
!268 = !DILocation(line: 76, column: 6, scope: !262, inlinedAt: !263)
!269 = !DILocation(line: 76, column: 11, scope: !262, inlinedAt: !263)
!270 = !DILocation(line: 76, column: 30, scope: !262, inlinedAt: !263)
!271 = !DILocation(line: 77, column: 9, scope: !262, inlinedAt: !263)
!272 = !DILocation(line: 95, column: 9, scope: !273)
!273 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!274 = !DILocation(line: 126, column: 7, scope: !237)
!275 = !DILocation(line: 126, column: 47, scope: !237)
!276 = !DILocation(line: 126, column: 64, scope: !237)
!277 = !DILocation(line: 126, column: 41, scope: !237)
!278 = !DILocation(line: 95, column: 9, scope: !279)
!279 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!280 = !DILocation(line: 121, column: 43, scope: !231)
!281 = !DILocation(line: 95, column: 9, scope: !282)
!282 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!283 = distinct !DISubprogram(name: "backtrace_add_from_exec", linkageName: "std.os.linux.backtrace_add_from_exec", scope: !2, file: !2, line: 131, type: !284, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, retainedNodes: !30)
!284 = !DISubroutineType(types: !285)
!285 = !{!18, !38, !286, !38, !292}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "List*", baseType: !287, size: 64, align: 64, dwarfAddressSpace: 0)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 14, size: 320, align: 64, elements: !288, identifier: "std_collections_list$std.os.backtrace.Backtrace$.List")
!288 = !{!289, !290, !291, !297}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !287, file: !2, line: 16, baseType: !21, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !287, file: !2, line: 17, baseType: !21, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !287, file: !2, line: 18, baseType: !292, size: 128, align: 64, offset: 128)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !293, identifier: "Allocator")
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !292, baseType: !38, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !292, baseType: !296, size: 64, align: 64, offset: 64)
!296 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !287, file: !2, line: 19, baseType: !298, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !299, size: 64, align: 64, dwarfAddressSpace: 0)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 94, baseType: !300, align: 8)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 15, size: 704, align: 64, elements: !301, identifier: "std.os.backtrace.Backtrace")
!301 = !{!302, !304, !305, !306, !307, !308, !309}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !300, file: !2, line: 17, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !22)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !300, file: !2, line: 18, baseType: !23, size: 128, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !300, file: !2, line: 19, baseType: !23, size: 128, align: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !300, file: !2, line: 20, baseType: !23, size: 128, align: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !300, file: !2, line: 21, baseType: !97, size: 32, align: 32, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !300, file: !2, line: 22, baseType: !292, size: 128, align: 64, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !300, file: !2, line: 23, baseType: !66, size: 8, align: 8, offset: 640)
!310 = !DILocalVariable(name: "list", arg: 1, scope: !283, file: !2, line: 131, type: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BacktraceList*", baseType: !312, size: 64, align: 64, dwarfAddressSpace: 0)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "BacktraceList", scope: !2, file: !2, line: 94, baseType: !287, align: 8)
!313 = !DILocation(line: 131, column: 49, scope: !283)
!314 = !DILocalVariable(name: "addr", arg: 2, scope: !283, file: !2, line: 131, type: !38)
!315 = !DILocation(line: 131, column: 61, scope: !283)
!316 = !DILocalVariable(name: "allocator", arg: 3, scope: !283, file: !2, line: 131, type: !292)
!317 = !DILocation(line: 131, column: 77, scope: !283)
!318 = !DILocalVariable(name: "buf", scope: !283, file: !2, line: 133, type: !24, align: 8)
!319 = !DILocation(line: 133, column: 9, scope: !283)
!320 = !DILocation(line: 722, column: 41, scope: !321, inlinedAt: !323)
!321 = distinct !DISubprogram(name: "temp_alloc_array", linkageName: "temp_alloc_array", scope: !322, file: !322, line: 720, scopeLine: 720, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12)
!322 = !DIFile(filename: "mem.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!323 = !DILocation(line: 133, column: 20, scope: !283)
!324 = !DILocation(line: 722, column: 26, scope: !321, inlinedAt: !323)
!325 = !DILocation(line: 722, column: 11, scope: !321, inlinedAt: !323)
!326 = !DILocation(line: 722, column: 68, scope: !321, inlinedAt: !323)
!327 = !DILocalVariable(name: "exec_path", scope: !283, file: !2, line: 135, type: !23, align: 8)
!328 = !DILocation(line: 135, column: 9, scope: !283)
!329 = !DILocation(line: 135, column: 61, scope: !283)
!330 = !DILocation(line: 135, column: 73, scope: !283)
!331 = !DILocation(line: 135, column: 118, scope: !283)
!332 = !DILocation(line: 135, column: 87, scope: !283)
!333 = !DILocation(line: 135, column: 30, scope: !283)
!334 = !DILocalVariable(name: "obj_name", scope: !283, file: !2, line: 136, type: !23, align: 8)
!335 = !DILocation(line: 136, column: 9, scope: !283)
!336 = !DILocation(line: 136, column: 35, scope: !283)
!337 = !DILocation(line: 136, column: 20, scope: !283)
!338 = !DILocalVariable(name: "addr2line", scope: !283, file: !2, line: 137, type: !23, align: 8)
!339 = !DILocation(line: 137, column: 9, scope: !283)
!340 = !DILocation(line: 137, column: 61, scope: !283)
!341 = !DILocation(line: 137, column: 74, scope: !283)
!342 = !DILocation(line: 137, column: 80, scope: !283)
!343 = !DILocation(line: 137, column: 86, scope: !283)
!344 = !DILocation(line: 137, column: 92, scope: !283)
!345 = !DILocation(line: 137, column: 98, scope: !283)
!346 = !DILocation(line: 137, column: 104, scope: !283)
!347 = !DILocation(line: 137, column: 139, scope: !283)
!348 = !DILocation(line: 137, column: 123, scope: !283)
!349 = !DILocation(line: 137, column: 30, scope: !283)
!350 = !DILocation(line: 138, column: 73, scope: !283)
!351 = !DILocation(line: 138, column: 9, scope: !283)
!352 = distinct !DISubprogram(name: "backtrace_add_from_dlinfo", linkageName: "std.os.linux.backtrace_add_from_dlinfo", scope: !2, file: !2, line: 141, type: !353, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, retainedNodes: !30)
!353 = !DISubroutineType(types: !354)
!354 = !{!18, !38, !286, !38, !355, !292}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Linux_Dl_info*", baseType: !356, size: 64, align: 64, dwarfAddressSpace: 0)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "Linux_Dl_info", scope: !2, file: !2, line: 84, size: 256, align: 64, elements: !357, identifier: "std.os.linux.Linux_Dl_info")
!357 = !{!358, !360, !361, !362}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "dli_fname", scope: !356, file: !2, line: 86, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !2, file: !2, line: 6, baseType: !27, align: 8)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dli_fbase", scope: !356, file: !2, line: 87, baseType: !38, size: 64, align: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "dli_sname", scope: !356, file: !2, line: 88, baseType: !359, size: 64, align: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "dli_saddr", scope: !356, file: !2, line: 89, baseType: !38, size: 64, align: 64, offset: 192)
!363 = !DILocalVariable(name: "list", arg: 1, scope: !352, file: !2, line: 141, type: !311)
!364 = !DILocation(line: 141, column: 51, scope: !352)
!365 = !DILocalVariable(name: "addr", arg: 2, scope: !352, file: !2, line: 141, type: !38)
!366 = !DILocation(line: 141, column: 63, scope: !352)
!367 = !DILocalVariable(name: "info", arg: 3, scope: !352, file: !2, line: 141, type: !355)
!368 = !DILocation(line: 141, column: 84, scope: !352)
!369 = !DILocalVariable(name: "allocator", arg: 4, scope: !352, file: !2, line: 141, type: !292)
!370 = !DILocation(line: 141, column: 100, scope: !352)
!371 = !DILocalVariable(name: "buf", scope: !352, file: !2, line: 143, type: !24, align: 8)
!372 = !DILocation(line: 143, column: 9, scope: !352)
!373 = !DILocation(line: 722, column: 41, scope: !374, inlinedAt: !375)
!374 = distinct !DISubprogram(name: "temp_alloc_array", linkageName: "temp_alloc_array", scope: !322, file: !322, line: 720, scopeLine: 720, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12)
!375 = !DILocation(line: 143, column: 20, scope: !352)
!376 = !DILocation(line: 722, column: 26, scope: !374, inlinedAt: !375)
!377 = !DILocation(line: 722, column: 11, scope: !374, inlinedAt: !375)
!378 = !DILocation(line: 722, column: 68, scope: !374, inlinedAt: !375)
!379 = !DILocalVariable(name: "obj_addr", scope: !352, file: !2, line: 145, type: !38, align: 8)
!380 = !DILocation(line: 145, column: 10, scope: !352)
!381 = !DILocation(line: 145, column: 22, scope: !352)
!382 = !DILocation(line: 145, column: 35, scope: !352)
!383 = !DILocation(line: 145, column: 80, scope: !352)
!384 = !DILocation(line: 145, column: 58, scope: !352)
!385 = !DILocalVariable(name: "obj_path", scope: !352, file: !2, line: 146, type: !359, align: 8)
!386 = !DILocation(line: 146, column: 10, scope: !352)
!387 = !DILocation(line: 146, column: 22, scope: !352)
!388 = !DILocalVariable(name: "sname", scope: !352, file: !2, line: 147, type: !23, align: 8)
!389 = !DILocation(line: 147, column: 10, scope: !352)
!390 = !DILocation(line: 147, column: 22, scope: !352)
!391 = !DILocation(line: 147, column: 39, scope: !352)
!392 = !DILocation(line: 147, column: 67, scope: !352)
!393 = !DILocalVariable(name: "addr2line", scope: !352, file: !2, line: 148, type: !23, align: 8)
!394 = !DILocation(line: 148, column: 10, scope: !352)
!395 = !DILocation(line: 148, column: 62, scope: !352)
!396 = !DILocation(line: 148, column: 75, scope: !352)
!397 = !DILocation(line: 148, column: 81, scope: !352)
!398 = !DILocation(line: 148, column: 87, scope: !352)
!399 = !DILocation(line: 148, column: 93, scope: !352)
!400 = !DILocation(line: 148, column: 99, scope: !352)
!401 = !DILocation(line: 148, column: 105, scope: !352)
!402 = !DILocation(line: 148, column: 150, scope: !352)
!403 = !DILocation(line: 148, column: 161, scope: !352)
!404 = !DILocation(line: 148, column: 134, scope: !352)
!405 = !DILocation(line: 148, column: 31, scope: !352)
!406 = !DILocation(line: 149, column: 56, scope: !352)
!407 = !DILocation(line: 149, column: 90, scope: !352)
!408 = !DILocation(line: 149, column: 9, scope: !352)
!409 = distinct !DISubprogram(name: "backtrace_line_parse", linkageName: "std.os.linux.backtrace_line_parse", scope: !2, file: !2, line: 152, type: !410, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !12, retainedNodes: !30)
!410 = !DISubroutineType(types: !411)
!411 = !{!18, !412, !23, !23, !23, !66, !292}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Backtrace*", baseType: !300, size: 64, align: 64, dwarfAddressSpace: 0)
!413 = !DILocalVariable(name: "string", arg: 1, scope: !409, file: !2, line: 152, type: !23)
!414 = !DILocation(line: 152, column: 43, scope: !409)
!415 = !DILocalVariable(name: "obj_name", arg: 2, scope: !409, file: !2, line: 152, type: !23)
!416 = !DILocation(line: 152, column: 58, scope: !409)
!417 = !DILocalVariable(name: "func_name", arg: 3, scope: !409, file: !2, line: 152, type: !23)
!418 = !DILocation(line: 152, column: 75, scope: !409)
!419 = !DILocalVariable(name: "is_inlined", arg: 4, scope: !409, file: !2, line: 152, type: !66)
!420 = !DILocation(line: 152, column: 91, scope: !409)
!421 = !DILocalVariable(name: "allocator", arg: 5, scope: !409, file: !2, line: 152, type: !292)
!422 = !DILocation(line: 152, column: 113, scope: !409)
!423 = !DILocalVariable(name: "parts", scope: !409, file: !2, line: 154, type: !424, align: 8)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !425, identifier: "String[]")
!425 = !{!426, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !424, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !424, baseType: !21, size: 64, align: 64, offset: 64)
!429 = !DILocation(line: 154, column: 11, scope: !409)
!430 = !DILocation(line: 147, column: 48, scope: !431, inlinedAt: !433)
!431 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !432, file: !432, line: 147, scopeLine: 147, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12)
!432 = !DIFile(filename: "string.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!433 = !DILocation(line: 154, column: 19, scope: !409)
!434 = !DILocation(line: 277, column: 55, scope: !435, inlinedAt: !433)
!435 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !432, file: !432, line: 277, scopeLine: 277, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12)
!436 = !DILocation(line: 155, column: 6, scope: !409)
!437 = !DILocation(line: 155, column: 29, scope: !409)
!438 = !DILocalVariable(name: "line", scope: !409, file: !2, line: 157, type: !97, align: 4)
!439 = !DILocation(line: 157, column: 7, scope: !409)
!440 = !DILocation(line: 157, column: 16, scope: !409)
!441 = !DILocalVariable(name: "source", scope: !409, file: !2, line: 158, type: !23, align: 8)
!442 = !DILocation(line: 158, column: 9, scope: !409)
!443 = !DILocation(line: 158, column: 18, scope: !409)
!444 = !DILocation(line: 159, column: 7, scope: !409)
!445 = !DILocation(line: 159, column: 13, scope: !409)
!446 = !DILocation(line: 159, column: 25, scope: !409)
!447 = !DILocation(line: 159, column: 33, scope: !409)
!448 = !DILocation(line: 159, column: 39, scope: !409)
!449 = !DILocation(line: 159, column: 51, scope: !409)
!450 = !DILocalVariable(name: "index", scope: !451, file: !2, line: 161, type: !21, align: 8)
!451 = distinct !DILexicalBlock(scope: !409, file: !2, line: 160, column: 2)
!452 = !DILocation(line: 161, column: 7, scope: !451)
!453 = !DILocation(line: 161, column: 15, scope: !451)
!454 = !DILocation(line: 161, column: 21, scope: !451)
!455 = !DILocation(line: 162, column: 12, scope: !451)
!456 = !DILocation(line: 162, column: 18, scope: !451)
!457 = !DILocation(line: 162, column: 21, scope: !451)
!458 = !DILocation(line: 162, column: 22, scope: !451)
!459 = !DILocation(line: 163, column: 12, scope: !451)
!460 = !DILocation(line: 163, column: 18, scope: !451)
!461 = !DILocation(line: 163, column: 21, scope: !451)
!462 = !DILocation(line: 166, column: 18, scope: !409)
!463 = !DILocation(line: 166, column: 24, scope: !409)
!464 = !DILocation(line: 166, column: 32, scope: !409)
!465 = !DILocation(line: 167, column: 32, scope: !409)
!466 = !DILocation(line: 167, column: 18, scope: !409)
!467 = !DILocation(line: 168, column: 30, scope: !409)
!468 = !DILocation(line: 168, column: 18, scope: !409)
!469 = !DILocation(line: 169, column: 18, scope: !409)
!470 = !DILocation(line: 170, column: 18, scope: !409)
!471 = !DILocation(line: 171, column: 18, scope: !409)
!472 = distinct !DISubprogram(name: "backtrace_add_addr2line", linkageName: "std.os.linux.backtrace_add_addr2line", scope: !2, file: !2, line: 174, type: !473, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, retainedNodes: !30)
!473 = !DISubroutineType(types: !474)
!474 = !{!18, !38, !286, !38, !23, !23, !23, !292}
!475 = !DILocalVariable(name: "list", arg: 1, scope: !472, file: !2, line: 174, type: !311)
!476 = !DILocation(line: 174, column: 49, scope: !472)
!477 = !DILocalVariable(name: "addr", arg: 2, scope: !472, file: !2, line: 174, type: !38)
!478 = !DILocation(line: 174, column: 61, scope: !472)
!479 = !DILocalVariable(name: "addr2line", arg: 3, scope: !472, file: !2, line: 174, type: !23)
!480 = !DILocation(line: 174, column: 74, scope: !472)
!481 = !DILocalVariable(name: "obj_name", arg: 4, scope: !472, file: !2, line: 174, type: !23)
!482 = !DILocation(line: 174, column: 92, scope: !472)
!483 = !DILocalVariable(name: "func_name", arg: 5, scope: !472, file: !2, line: 174, type: !23)
!484 = !DILocation(line: 174, column: 109, scope: !472)
!485 = !DILocalVariable(name: "allocator", arg: 6, scope: !472, file: !2, line: 174, type: !292)
!486 = !DILocation(line: 174, column: 130, scope: !472)
!487 = !DILocalVariable(name: "inline_parts", scope: !472, file: !2, line: 176, type: !424, align: 8)
!488 = !DILocation(line: 176, column: 11, scope: !472)
!489 = !DILocation(line: 277, column: 55, scope: !490, inlinedAt: !491)
!490 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !432, file: !432, line: 277, scopeLine: 277, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12)
!491 = !DILocation(line: 176, column: 26, scope: !472)
!492 = !DILocalVariable(name: "last", scope: !472, file: !2, line: 177, type: !21, align: 8)
!493 = !DILocation(line: 177, column: 6, scope: !472)
!494 = !DILocation(line: 177, column: 13, scope: !472)
!495 = !DILocalVariable(name: ".temp", scope: !496, file: !2, line: 178, type: !21, align: 8)
!496 = distinct !DILexicalBlock(scope: !472, file: !2, line: 178, column: 2)
!497 = !DILocation(line: 178, column: 21, scope: !496)
!498 = !DILocation(line: 178, column: 11, scope: !496)
!499 = !DILocalVariable(name: "i", scope: !500, file: !2, line: 178, type: !21, align: 8)
!500 = distinct !DILexicalBlock(scope: !496, file: !2, line: 179, column: 2)
!501 = !DILocation(line: 178, column: 11, scope: !500)
!502 = !DILocalVariable(name: "part", scope: !500, file: !2, line: 178, type: !23, align: 8)
!503 = !DILocation(line: 178, column: 14, scope: !500)
!504 = !DILocation(line: 178, column: 21, scope: !500)
!505 = !DILocalVariable(name: "is_inline", scope: !506, file: !2, line: 180, type: !66, align: 1)
!506 = distinct !DILexicalBlock(scope: !500, file: !2, line: 179, column: 2)
!507 = !DILocation(line: 180, column: 8, scope: !506)
!508 = !DILocation(line: 180, column: 20, scope: !506)
!509 = !DILocation(line: 180, column: 25, scope: !506)
!510 = !DILocalVariable(name: "trace", scope: !506, file: !2, line: 181, type: !300, align: 8)
!511 = !DILocation(line: 181, column: 14, scope: !506)
!512 = !DILocation(line: 181, column: 22, scope: !506)
!513 = !DILocation(line: 182, column: 13, scope: !506)
!514 = !DILocation(line: 185, column: 35, scope: !515)
!515 = distinct !DILexicalBlock(scope: !506, file: !2, line: 183, column: 3)
!516 = !DILocation(line: 185, column: 20, scope: !515)
!517 = !DILocation(line: 186, column: 34, scope: !515)
!518 = !DILocation(line: 186, column: 20, scope: !515)
!519 = !DILocation(line: 187, column: 21, scope: !515)
!520 = !DILocation(line: 188, column: 28, scope: !515)
!521 = !DILocation(line: 188, column: 20, scope: !515)
!522 = !DILocation(line: 189, column: 20, scope: !515)
!523 = !DILocation(line: 190, column: 20, scope: !515)
!524 = !DILocation(line: 191, column: 20, scope: !515)
!525 = !DILocation(line: 184, column: 4, scope: !515)
!526 = !DILocation(line: 193, column: 4, scope: !515)
!527 = !DILocation(line: 195, column: 13, scope: !506)
!528 = !DILocation(line: 195, column: 3, scope: !506)
!529 = distinct !DISubprogram(name: "backtrace_add_element", linkageName: "std.os.linux.backtrace_add_element", scope: !2, file: !2, line: 199, type: !284, scopeLine: 199, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, retainedNodes: !30)
!530 = !DILocalVariable(name: "list", arg: 1, scope: !529, file: !2, line: 199, type: !311)
!531 = !DILocation(line: 199, column: 47, scope: !529)
!532 = !DILocalVariable(name: "addr", arg: 2, scope: !529, file: !2, line: 199, type: !38)
!533 = !DILocation(line: 199, column: 59, scope: !529)
!534 = !DILocalVariable(name: "allocator", arg: 3, scope: !529, file: !2, line: 199, type: !292)
!535 = !DILocation(line: 199, column: 75, scope: !529)
!536 = !DILocation(line: 201, column: 7, scope: !529)
!537 = !DILocation(line: 203, column: 24, scope: !538)
!538 = distinct !DILexicalBlock(scope: !529, file: !2, line: 202, column: 2)
!539 = !DILocation(line: 203, column: 3, scope: !538)
!540 = !DILocalVariable(name: "current", scope: !541, file: !2, line: 536, type: !542, align: 8)
!541 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !322, file: !322, line: 534, scopeLine: 534, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, retainedNodes: !30)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !543, size: 64, align: 64, dwarfAddressSpace: 0)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !544, identifier: "std.core.mem.allocator.TempAllocator")
!544 = !{!545, !546, !559, !560, !561}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !543, file: !2, line: 12, baseType: !292, size: 128, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !543, file: !2, line: 13, baseType: !547, size: 64, align: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !548, size: 64, align: 64, dwarfAddressSpace: 0)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !549, identifier: "std.core.mem.allocator.TempAllocatorPage")
!549 = !{!550, !551, !552, !553, !554, !555}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !548, file: !2, line: 24, baseType: !547, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !548, file: !2, line: 25, baseType: !38, size: 64, align: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !548, file: !2, line: 26, baseType: !21, size: 64, align: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !548, file: !2, line: 27, baseType: !21, size: 64, align: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !548, file: !2, line: 28, baseType: !21, size: 64, align: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !548, file: !2, line: 29, baseType: !556, align: 8, offset: 320)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, align: 8, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 0, lowerBound: 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !543, file: !2, line: 14, baseType: !21, size: 64, align: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !543, file: !2, line: 15, baseType: !21, size: 64, align: 64, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !543, file: !2, line: 16, baseType: !556, align: 8, offset: 320)
!562 = !DILocation(line: 536, column: 17, scope: !541, inlinedAt: !563)
!563 = !DILocation(line: 207, column: 2, scope: !529)
!564 = !DILocation(line: 396, column: 7, scope: !565, inlinedAt: !567)
!565 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !566, file: !566, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12)
!566 = !DIFile(filename: "mem_allocator.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!567 = !DILocation(line: 536, column: 38, scope: !541, inlinedAt: !563)
!568 = !DILocation(line: 398, column: 3, scope: !569, inlinedAt: !567)
!569 = distinct !DILexicalBlock(scope: !565, file: !566, line: 397, column: 2)
!570 = !DILocation(line: 400, column: 9, scope: !565, inlinedAt: !567)
!571 = !DILocalVariable(name: "original", scope: !541, file: !2, line: 539, type: !542, align: 8)
!572 = !DILocation(line: 539, column: 18, scope: !541, inlinedAt: !563)
!573 = !DILocation(line: 539, column: 29, scope: !541, inlinedAt: !563)
!574 = !DILocation(line: 540, column: 7, scope: !541, inlinedAt: !563)
!575 = !DILocation(line: 540, column: 19, scope: !541, inlinedAt: !563)
!576 = !DILocation(line: 540, column: 59, scope: !541, inlinedAt: !563)
!577 = !DILocalVariable(name: "mark", scope: !541, file: !2, line: 542, type: !21, align: 8)
!578 = !DILocation(line: 542, column: 6, scope: !541, inlinedAt: !563)
!579 = !DILocation(line: 542, column: 13, scope: !541, inlinedAt: !563)
!580 = !DILocalVariable(name: "info", scope: !581, file: !2, line: 208, type: !356, align: 8)
!581 = distinct !DILexicalBlock(scope: !529, file: !2, line: 207, column: 19)
!582 = !DILocation(line: 208, column: 17, scope: !581)
!583 = !DILocation(line: 209, column: 21, scope: !581)
!584 = !DILocation(line: 209, column: 7, scope: !581)
!585 = !DILocation(line: 211, column: 47, scope: !586)
!586 = distinct !DILexicalBlock(scope: !581, file: !2, line: 210, column: 3)
!587 = !DILocation(line: 211, column: 11, scope: !586)
!588 = !DILocation(line: 545, column: 17, scope: !589, inlinedAt: !563)
!589 = distinct !DILexicalBlock(scope: !541, file: !322, line: 544, column: 2)
!590 = !DILocation(line: 545, column: 3, scope: !589, inlinedAt: !563)
!591 = !DILocation(line: 547, column: 39, scope: !589, inlinedAt: !563)
!592 = !DILocation(line: 549, column: 2, scope: !589, inlinedAt: !563)
!593 = !DILocation(line: 545, column: 17, scope: !594, inlinedAt: !563)
!594 = distinct !DILexicalBlock(scope: !541, file: !322, line: 544, column: 2)
!595 = !DILocation(line: 545, column: 3, scope: !594, inlinedAt: !563)
!596 = !DILocation(line: 547, column: 39, scope: !594, inlinedAt: !563)
!597 = !DILocation(line: 549, column: 2, scope: !594, inlinedAt: !563)
!598 = !DILocation(line: 213, column: 55, scope: !581)
!599 = !DILocation(line: 213, column: 10, scope: !581)
!600 = !DILocation(line: 545, column: 17, scope: !601, inlinedAt: !563)
!601 = distinct !DILexicalBlock(scope: !541, file: !322, line: 544, column: 2)
!602 = !DILocation(line: 545, column: 3, scope: !601, inlinedAt: !563)
!603 = !DILocation(line: 547, column: 39, scope: !601, inlinedAt: !563)
!604 = !DILocation(line: 549, column: 2, scope: !601, inlinedAt: !563)
!605 = !DILocation(line: 545, column: 17, scope: !606, inlinedAt: !563)
!606 = distinct !DILexicalBlock(scope: !541, file: !322, line: 544, column: 2)
!607 = !DILocation(line: 545, column: 3, scope: !606, inlinedAt: !563)
!608 = !DILocation(line: 547, column: 39, scope: !606, inlinedAt: !563)
!609 = !DILocation(line: 549, column: 2, scope: !606, inlinedAt: !563)
!610 = distinct !DISubprogram(name: "symbolize_backtrace", linkageName: "std.os.linux.symbolize_backtrace", scope: !2, file: !2, line: 217, type: !611, scopeLine: 217, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !12, retainedNodes: !30)
!611 = !DISubroutineType(types: !612)
!612 = !{!18, !311, !613, !292}
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !614, identifier: "void*[]")
!614 = !{!615, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !613, baseType: !616, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !38, size: 64, align: 64, dwarfAddressSpace: 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !613, baseType: !21, size: 64, align: 64, offset: 64)
!618 = !DILocalVariable(name: "backtrace", arg: 1, scope: !610, file: !2, line: 217, type: !613)
!619 = !DILocation(line: 217, column: 47, scope: !610)
!620 = !DILocalVariable(name: "allocator", arg: 2, scope: !610, file: !2, line: 217, type: !292)
!621 = !DILocation(line: 217, column: 68, scope: !610)
!622 = !DILocalVariable(name: "list", scope: !610, file: !2, line: 219, type: !312, align: 8)
!623 = !DILocation(line: 219, column: 16, scope: !610)
!624 = !DILocation(line: 220, column: 16, scope: !610)
!625 = !DILocation(line: 220, column: 31, scope: !610)
!626 = !DILocation(line: 220, column: 2, scope: !610)
!627 = !DILocalVariable(name: "current", scope: !628, file: !2, line: 536, type: !542, align: 8)
!628 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !322, file: !322, line: 534, scopeLine: 534, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, retainedNodes: !30)
!629 = !DILocation(line: 536, column: 17, scope: !628, inlinedAt: !630)
!630 = !DILocation(line: 229, column: 2, scope: !610)
!631 = !DILocation(line: 396, column: 7, scope: !632, inlinedAt: !633)
!632 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !566, file: !566, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12)
!633 = !DILocation(line: 536, column: 38, scope: !628, inlinedAt: !630)
!634 = !DILocation(line: 398, column: 3, scope: !635, inlinedAt: !633)
!635 = distinct !DILexicalBlock(scope: !632, file: !566, line: 397, column: 2)
!636 = !DILocation(line: 400, column: 9, scope: !632, inlinedAt: !633)
!637 = !DILocalVariable(name: "original", scope: !628, file: !2, line: 539, type: !542, align: 8)
!638 = !DILocation(line: 539, column: 18, scope: !628, inlinedAt: !630)
!639 = !DILocation(line: 539, column: 29, scope: !628, inlinedAt: !630)
!640 = !DILocation(line: 540, column: 7, scope: !628, inlinedAt: !630)
!641 = !DILocation(line: 540, column: 19, scope: !628, inlinedAt: !630)
!642 = !DILocation(line: 540, column: 59, scope: !628, inlinedAt: !630)
!643 = !DILocalVariable(name: "mark", scope: !628, file: !2, line: 542, type: !21, align: 8)
!644 = !DILocation(line: 542, column: 6, scope: !628, inlinedAt: !630)
!645 = !DILocation(line: 542, column: 13, scope: !628, inlinedAt: !630)
!646 = !DILocalVariable(name: ".temp", scope: !647, file: !2, line: 231, type: !21, align: 8)
!647 = distinct !DILexicalBlock(scope: !648, file: !2, line: 231, column: 3)
!648 = distinct !DILexicalBlock(scope: !610, file: !2, line: 230, column: 2)
!649 = !DILocation(line: 231, column: 19, scope: !647)
!650 = !DILocalVariable(name: "addr", scope: !651, file: !2, line: 231, type: !38, align: 8)
!651 = distinct !DILexicalBlock(scope: !647, file: !2, line: 232, column: 3)
!652 = !DILocation(line: 231, column: 12, scope: !651)
!653 = !DILocation(line: 231, column: 19, scope: !651)
!654 = !DILocation(line: 233, column: 39, scope: !655)
!655 = distinct !DILexicalBlock(scope: !651, file: !2, line: 232, column: 3)
!656 = !DILocation(line: 233, column: 4, scope: !655)
!657 = !DILocation(line: 545, column: 17, scope: !658, inlinedAt: !630)
!658 = distinct !DILexicalBlock(scope: !628, file: !322, line: 544, column: 2)
!659 = !DILocation(line: 545, column: 3, scope: !658, inlinedAt: !630)
!660 = !DILocation(line: 547, column: 39, scope: !658, inlinedAt: !630)
!661 = !DILocalVariable(name: ".temp", scope: !662, file: !2, line: 223, type: !21, align: 8)
!662 = distinct !DILexicalBlock(scope: !663, file: !2, line: 223, column: 3)
!663 = distinct !DILexicalBlock(scope: !610, file: !2, line: 222, column: 2)
!664 = !DILocation(line: 223, column: 20, scope: !662)
!665 = !DILocalVariable(name: "trace", scope: !666, file: !2, line: 223, type: !299, align: 8)
!666 = distinct !DILexicalBlock(scope: !662, file: !2, line: 224, column: 3)
!667 = !DILocation(line: 223, column: 12, scope: !666)
