; ModuleID = 'std::math::vector'
source_filename = "std::math::vector"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%Matrix4x4 = type { %.anon }
%.anon = type { %.anon.0 }
%.anon.0 = type { float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float }
%Matrix4x4.1 = type { %.anon.2 }
%.anon.2 = type { %.anon.3 }
%.anon.3 = type { double, double, double, double, double, double, double, double, double, double, double, double, double, double, double, double }
%Quaternion.4 = type { <4 x float> }
%Quaternion = type { <4 x double> }

$"std.math.vector.float[<2>].towards" = comdat any

$"std.math.vector.float[<3>].towards" = comdat any

$"std.math.vector.float[<4>].towards" = comdat any

$"std.math.vector.double[<2>].towards" = comdat any

$"std.math.vector.double[<3>].towards" = comdat any

$"std.math.vector.double[<4>].towards" = comdat any

$"std.math.vector.float[<3>].cross" = comdat any

$"std.math.vector.double[<3>].cross" = comdat any

$"std.math.vector.float[<3>].perpendicular" = comdat any

$"std.math.vector.double[<3>].perpendicular" = comdat any

$"std.math.vector.float[<3>].barycenter" = comdat any

$"std.math.vector.double[<3>].barycenter" = comdat any

$"std.math.vector.float[<3>].transform" = comdat any

$"std.math.vector.double[<3>].transform" = comdat any

$"std.math.vector.float[<3>].angle" = comdat any


!566 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 671, scopeLine: 671, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!567 = !DILocation(line: 671, column: 82, scope: !566, inlinedAt: !561)
!568 = !DILocalVariable(name: "d11", scope: !537, file: !7, line: 230, type: !158, align: 8)
!569 = !DILocation(line: 230, column: 6, scope: !537, inlinedAt: !539)
!570 = !DILocation(line: 686, column: 64, scope: !571, inlinedAt: !572)
!571 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 686, scopeLine: 686, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!572 = !DILocation(line: 230, column: 12, scope: !537, inlinedAt: !539)
!573 = !DILocation(line: 686, column: 68, scope: !571, inlinedAt: !572)
!574 = !DILocation(line: 671, column: 85, scope: !575, inlinedAt: !570)
!575 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 671, scopeLine: 671, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!576 = !DILocation(line: 671, column: 82, scope: !575, inlinedAt: !570)
!577 = !DILocalVariable(name: "d20", scope: !537, file: !7, line: 231, type: !158, align: 8)
!578 = !DILocation(line: 231, column: 6, scope: !537, inlinedAt: !539)
!579 = !DILocation(line: 686, column: 64, scope: !580, inlinedAt: !581)
!580 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 686, scopeLine: 686, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!581 = !DILocation(line: 231, column: 12, scope: !537, inlinedAt: !539)
!582 = !DILocation(line: 686, column: 68, scope: !580, inlinedAt: !581)
!583 = !DILocation(line: 671, column: 85, scope: !584, inlinedAt: !579)
!584 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 671, scopeLine: 671, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!585 = !DILocation(line: 671, column: 82, scope: !584, inlinedAt: !579)
!586 = !DILocalVariable(name: "d21", scope: !537, file: !7, line: 232, type: !158, align: 8)
!587 = !DILocation(line: 232, column: 6, scope: !537, inlinedAt: !539)
!588 = !DILocation(line: 686, column: 64, scope: !589, inlinedAt: !590)
!589 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 686, scopeLine: 686, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!590 = !DILocation(line: 232, column: 12, scope: !537, inlinedAt: !539)
!591 = !DILocation(line: 686, column: 68, scope: !589, inlinedAt: !590)
!592 = !DILocation(line: 671, column: 85, scope: !593, inlinedAt: !588)
!593 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 671, scopeLine: 671, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!594 = !DILocation(line: 671, column: 82, scope: !593, inlinedAt: !588)
!595 = !DILocalVariable(name: "denom", scope: !537, file: !7, line: 233, type: !158, align: 8)
!596 = !DILocation(line: 233, column: 6, scope: !537, inlinedAt: !539)
!597 = !DILocation(line: 233, column: 14, scope: !537, inlinedAt: !539)
!598 = !DILocation(line: 233, column: 20, scope: !537, inlinedAt: !539)
!599 = !DILocation(line: 233, column: 26, scope: !537, inlinedAt: !539)
!600 = !DILocation(line: 233, column: 32, scope: !537, inlinedAt: !539)
!601 = !DILocalVariable(name: "y", scope: !537, file: !7, line: 234, type: !158, align: 8)
!602 = !DILocation(line: 234, column: 6, scope: !537, inlinedAt: !539)
!603 = !DILocation(line: 234, column: 11, scope: !537, inlinedAt: !539)
!604 = !DILocation(line: 234, column: 17, scope: !537, inlinedAt: !539)
!605 = !DILocation(line: 234, column: 23, scope: !537, inlinedAt: !539)
!606 = !DILocation(line: 234, column: 29, scope: !537, inlinedAt: !539)
!607 = !DILocation(line: 234, column: 36, scope: !537, inlinedAt: !539)
!608 = !DILocalVariable(name: "z", scope: !537, file: !7, line: 235, type: !158, align: 8)
!609 = !DILocation(line: 235, column: 6, scope: !537, inlinedAt: !539)
!610 = !DILocation(line: 235, column: 11, scope: !537, inlinedAt: !539)
!611 = !DILocation(line: 235, column: 17, scope: !537, inlinedAt: !539)
!612 = !DILocation(line: 235, column: 23, scope: !537, inlinedAt: !539)
!613 = !DILocation(line: 235, column: 29, scope: !537, inlinedAt: !539)
!614 = !DILocation(line: 235, column: 36, scope: !537, inlinedAt: !539)
!615 = !DILocation(line: 236, column: 26, scope: !537, inlinedAt: !539)
!616 = !DILocation(line: 236, column: 22, scope: !537, inlinedAt: !539)
!617 = !DILocation(line: 236, column: 30, scope: !537, inlinedAt: !539)
!618 = !DILocation(line: 236, column: 9, scope: !537, inlinedAt: !539)
!619 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.float[<3>].transform", scope: !7, file: !7, line: 57, type: !620, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!620 = !DISubroutineType(types: !621)
!621 = !{!62, !63, !622}
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4", scope: !7, file: !7, line: 31, size: 512, align: 32, elements: !623, identifier: "std_math_matrix$float$.Matrix4x4")
!623 = !{!624}
!624 = !DIDerivedType(tag: DW_TAG_member, scope: !622, file: !7, line: 33, baseType: !625, size: 512, align: 32)
!625 = !DICompositeType(tag: DW_TAG_union_type, scope: !622, file: !7, line: 33, size: 512, align: 32, elements: !626)
!626 = !{!627, !647}
!627 = !DIDerivedType(tag: DW_TAG_member, scope: !625, file: !7, line: 35, baseType: !628, size: 512, align: 32)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !625, file: !7, line: 35, size: 512, align: 32, elements: !629)
!629 = !{!630, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !628, file: !7, line: 37, baseType: !631, size: 32, align: 32)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 103, baseType: !13, align: 4)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !628, file: !7, line: 37, baseType: !631, size: 32, align: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !628, file: !7, line: 37, baseType: !631, size: 32, align: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !628, file: !7, line: 37, baseType: !631, size: 32, align: 32, offset: 96)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !628, file: !7, line: 38, baseType: !631, size: 32, align: 32, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !628, file: !7, line: 38, baseType: !631, size: 32, align: 32, offset: 160)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !628, file: !7, line: 38, baseType: !631, size: 32, align: 32, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !628, file: !7, line: 38, baseType: !631, size: 32, align: 32, offset: 224)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !628, file: !7, line: 39, baseType: !631, size: 32, align: 32, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !628, file: !7, line: 39, baseType: !631, size: 32, align: 32, offset: 288)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !628, file: !7, line: 39, baseType: !631, size: 32, align: 32, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !628, file: !7, line: 39, baseType: !631, size: 32, align: 32, offset: 352)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !628, file: !7, line: 40, baseType: !631, size: 32, align: 32, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !628, file: !7, line: 40, baseType: !631, size: 32, align: 32, offset: 416)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !628, file: !7, line: 40, baseType: !631, size: 32, align: 32, offset: 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !628, file: !7, line: 40, baseType: !631, size: 32, align: 32, offset: 480)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !625, file: !7, line: 42, baseType: !648, size: 512, align: 32)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 512, align: 32, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 16, lowerBound: 0)
!651 = !DILocalVariable(name: "self", arg: 1, scope: !619, file: !7, line: 57, type: !62)
!652 = !DILocation(line: 57, column: 26, scope: !619)
!653 = !DILocalVariable(name: "mat", arg: 2, scope: !619, file: !7, line: 57, type: !654)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4f", scope: !7, file: !7, line: 107, baseType: !622, align: 4)
!655 = !DILocation(line: 57, column: 41, scope: !619)
!656 = !DILocation(line: 149, column: 3, scope: !657, inlinedAt: !658)
!657 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !7, file: !7, line: 146, scopeLine: 146, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!658 = !DILocation(line: 57, column: 49, scope: !619)
!659 = !DILocation(line: 149, column: 13, scope: !657, inlinedAt: !658)
!660 = !DILocation(line: 149, column: 15, scope: !657, inlinedAt: !658)
!661 = !DILocation(line: 149, column: 20, scope: !657, inlinedAt: !658)
!662 = !DILocation(line: 149, column: 30, scope: !657, inlinedAt: !658)
!663 = !DILocation(line: 149, column: 32, scope: !657, inlinedAt: !658)
!664 = !DILocation(line: 149, column: 37, scope: !657, inlinedAt: !658)
!665 = !DILocation(line: 149, column: 47, scope: !657, inlinedAt: !658)
!666 = !DILocation(line: 149, column: 49, scope: !657, inlinedAt: !658)
!667 = !DILocation(line: 149, column: 54, scope: !657, inlinedAt: !658)
!668 = !DILocation(line: 148, column: 9, scope: !657, inlinedAt: !658)
!669 = !DILocation(line: 150, column: 3, scope: !657, inlinedAt: !658)
!670 = !DILocation(line: 150, column: 13, scope: !657, inlinedAt: !658)
!671 = !DILocation(line: 150, column: 15, scope: !657, inlinedAt: !658)
!672 = !DILocation(line: 150, column: 20, scope: !657, inlinedAt: !658)
!673 = !DILocation(line: 150, column: 30, scope: !657, inlinedAt: !658)
!674 = !DILocation(line: 150, column: 32, scope: !657, inlinedAt: !658)
!675 = !DILocation(line: 150, column: 37, scope: !657, inlinedAt: !658)
!676 = !DILocation(line: 150, column: 47, scope: !657, inlinedAt: !658)
!677 = !DILocation(line: 150, column: 49, scope: !657, inlinedAt: !658)
!678 = !DILocation(line: 150, column: 54, scope: !657, inlinedAt: !658)
!679 = !DILocation(line: 151, column: 3, scope: !657, inlinedAt: !658)
!680 = !DILocation(line: 151, column: 13, scope: !657, inlinedAt: !658)
!681 = !DILocation(line: 151, column: 15, scope: !657, inlinedAt: !658)
!682 = !DILocation(line: 151, column: 20, scope: !657, inlinedAt: !658)
!683 = !DILocation(line: 151, column: 30, scope: !657, inlinedAt: !658)
!684 = !DILocation(line: 151, column: 32, scope: !657, inlinedAt: !658)
!685 = !DILocation(line: 151, column: 37, scope: !657, inlinedAt: !658)
!686 = !DILocation(line: 151, column: 47, scope: !657, inlinedAt: !658)
!687 = !DILocation(line: 151, column: 49, scope: !657, inlinedAt: !658)
!688 = !DILocation(line: 151, column: 54, scope: !657, inlinedAt: !658)
!689 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.double[<3>].transform", scope: !7, file: !7, line: 58, type: !690, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!690 = !DISubroutineType(types: !691)
!691 = !{!202, !203, !692}
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4", scope: !7, file: !7, line: 31, size: 1024, align: 64, elements: !693, identifier: "std_math_matrix$double$.Matrix4x4")
!693 = !{!694}
!694 = !DIDerivedType(tag: DW_TAG_member, scope: !692, file: !7, line: 33, baseType: !695, size: 1024, align: 64)
!695 = !DICompositeType(tag: DW_TAG_union_type, scope: !692, file: !7, line: 33, size: 1024, align: 64, elements: !696)
!696 = !{!697, !717}
!697 = !DIDerivedType(tag: DW_TAG_member, scope: !695, file: !7, line: 35, baseType: !698, size: 1024, align: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !695, file: !7, line: 35, size: 1024, align: 64, elements: !699)
!699 = !{!700, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !698, file: !7, line: 37, baseType: !701, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 104, baseType: !158, align: 8)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !698, file: !7, line: 37, baseType: !701, size: 64, align: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !698, file: !7, line: 37, baseType: !701, size: 64, align: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !698, file: !7, line: 37, baseType: !701, size: 64, align: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !698, file: !7, line: 38, baseType: !701, size: 64, align: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !698, file: !7, line: 38, baseType: !701, size: 64, align: 64, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !698, file: !7, line: 38, baseType: !701, size: 64, align: 64, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !698, file: !7, line: 38, baseType: !701, size: 64, align: 64, offset: 448)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !698, file: !7, line: 39, baseType: !701, size: 64, align: 64, offset: 512)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !698, file: !7, line: 39, baseType: !701, size: 64, align: 64, offset: 576)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !698, file: !7, line: 39, baseType: !701, size: 64, align: 64, offset: 640)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !698, file: !7, line: 39, baseType: !701, size: 64, align: 64, offset: 704)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !698, file: !7, line: 40, baseType: !701, size: 64, align: 64, offset: 768)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !698, file: !7, line: 40, baseType: !701, size: 64, align: 64, offset: 832)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !698, file: !7, line: 40, baseType: !701, size: 64, align: 64, offset: 896)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !698, file: !7, line: 40, baseType: !701, size: 64, align: 64, offset: 960)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !695, file: !7, line: 42, baseType: !718, size: 1024, align: 64)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 1024, align: 64, elements: !649)
!719 = !DILocalVariable(name: "self", arg: 1, scope: !689, file: !7, line: 58, type: !202)
!720 = !DILocation(line: 58, column: 24, scope: !689)
!721 = !DILocalVariable(name: "mat", arg: 2, scope: !689, file: !7, line: 58, type: !722)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4", scope: !7, file: !7, line: 108, baseType: !692, align: 8)
!723 = !DILocation(line: 58, column: 38, scope: !689)
!724 = !DILocation(line: 149, column: 3, scope: !725, inlinedAt: !726)
!725 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !7, file: !7, line: 146, scopeLine: 146, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!726 = !DILocation(line: 58, column: 46, scope: !689)
!727 = !DILocation(line: 149, column: 13, scope: !725, inlinedAt: !726)
!728 = !DILocation(line: 149, column: 15, scope: !725, inlinedAt: !726)
!729 = !DILocation(line: 149, column: 20, scope: !725, inlinedAt: !726)
!730 = !DILocation(line: 149, column: 30, scope: !725, inlinedAt: !726)
!731 = !DILocation(line: 149, column: 32, scope: !725, inlinedAt: !726)
!732 = !DILocation(line: 149, column: 37, scope: !725, inlinedAt: !726)
!733 = !DILocation(line: 149, column: 47, scope: !725, inlinedAt: !726)
!734 = !DILocation(line: 149, column: 49, scope: !725, inlinedAt: !726)
!735 = !DILocation(line: 149, column: 54, scope: !725, inlinedAt: !726)
!736 = !DILocation(line: 148, column: 9, scope: !725, inlinedAt: !726)
!737 = !DILocation(line: 150, column: 3, scope: !725, inlinedAt: !726)
!738 = !DILocation(line: 150, column: 13, scope: !725, inlinedAt: !726)
!739 = !DILocation(line: 150, column: 15, scope: !725, inlinedAt: !726)
!740 = !DILocation(line: 150, column: 20, scope: !725, inlinedAt: !726)
!741 = !DILocation(line: 150, column: 30, scope: !725, inlinedAt: !726)
!742 = !DILocation(line: 150, column: 32, scope: !725, inlinedAt: !726)
!743 = !DILocation(line: 150, column: 37, scope: !725, inlinedAt: !726)
!744 = !DILocation(line: 150, column: 47, scope: !725, inlinedAt: !726)
!745 = !DILocation(line: 150, column: 49, scope: !725, inlinedAt: !726)
!746 = !DILocation(line: 150, column: 54, scope: !725, inlinedAt: !726)
!747 = !DILocation(line: 151, column: 3, scope: !725, inlinedAt: !726)
!748 = !DILocation(line: 151, column: 13, scope: !725, inlinedAt: !726)
!749 = !DILocation(line: 151, column: 15, scope: !725, inlinedAt: !726)
!750 = !DILocation(line: 151, column: 20, scope: !725, inlinedAt: !726)
!751 = !DILocation(line: 151, column: 30, scope: !725, inlinedAt: !726)
!752 = !DILocation(line: 151, column: 32, scope: !725, inlinedAt: !726)
!753 = !DILocation(line: 151, column: 37, scope: !725, inlinedAt: !726)
!754 = !DILocation(line: 151, column: 47, scope: !725, inlinedAt: !726)
!755 = !DILocation(line: 151, column: 49, scope: !725, inlinedAt: !726)
!756 = !DILocation(line: 151, column: 54, scope: !725, inlinedAt: !726)
!757 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.float[<3>].angle", scope: !7, file: !7, line: 60, type: !758, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!758 = !DISubroutineType(types: !759)
!759 = !{!13, !63, !63}
!760 = !DILocalVariable(name: "self", arg: 1, scope: !757, file: !7, line: 60, type: !62)
!761 = !DILocation(line: 60, column: 22, scope: !757)
!762 = !DILocalVariable(name: "v2", arg: 2, scope: !757, file: !7, line: 60, type: !62)
!763 = !DILocation(line: 60, column: 34, scope: !757)
!764 = !DILocalVariable(name: "len", scope: !765, file: !7, line: 158, type: !13, align: 4)
!765 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !7, file: !7, line: 156, scopeLine: 156, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !16)
!766 = !DILocation(line: 158, column: 6, scope: !765, inlinedAt: !767)
!767 = !DILocation(line: 60, column: 41, scope: !757)
!768 = !DILocation(line: 158, column: 21, scope: !765, inlinedAt: !767)
!769 = !DILocation(line: 158, column: 12, scope: !765, inlinedAt: !767)
!770 = !DILocation(line: 643, column: 60, scope: !771, inlinedAt: !772)
!771 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 643, scopeLine: 643, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!772 = !DILocation(line: 644, column: 55, scope: !773, inlinedAt: !769)
!773 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !33, file: !33, line: 644, scopeLine: 644, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!774 = !DILocation(line: 643, column: 64, scope: !771, inlinedAt: !772)
!775 = !DILocation(line: 628, column: 81, scope: !776, inlinedAt: !770)
!776 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 628, scopeLine: 628, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!777 = !DILocation(line: 628, column: 78, scope: !776, inlinedAt: !770)
!778 = !DILocalVariable(name: "dot", scope: !765, file: !7, line: 159, type: !13, align: 4)
!779 = !DILocation(line: 159, column: 6, scope: !765, inlinedAt: !767)
!780 = !DILocation(line: 643, column: 60, scope: !781, inlinedAt: !782)
!781 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 643, scopeLine: 643, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!782 = !DILocation(line: 159, column: 12, scope: !765, inlinedAt: !767)
!783 = !DILocation(line: 643, column: 64, scope: !781, inlinedAt: !782)
!784 = !DILocation(line: 628, column: 81, scope: !785, inlinedAt: !780)
!785 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 628, scopeLine: 628, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!786 = !DILocation(line: 628, column: 78, scope: !785, inlinedAt: !780)
!787 = !DILocation(line: 154, column: 21, scope: !788, inlinedAt: !789)
!788 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !33, file: !33, line: 151, scopeLine: 151, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!789 = !DILocation(line: 160, column: 15, scope: !765, inlinedAt: !767)
!790 = !DILocation(line: 154, column: 10, scope: !788, inlinedAt: !789)
!791 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.double[<3>].angle", scope: !7, file: !7, line: 61, type: !792, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!792 = !DISubroutineType(types: !793)
!793 = !{!158, !203, !203}
!794 = !DILocalVariable(name: "self", arg: 1, scope: !791, file: !7, line: 61, type: !202)
!795 = !DILocation(line: 61, column: 22, scope: !791)
!796 = !DILocalVariable(name: "v2", arg: 2, scope: !791, file: !7, line: 61, type: !202)
!797 = !DILocation(line: 61, column: 33, scope: !791)
!798 = !DILocalVariable(name: "len", scope: !799, file: !7, line: 158, type: !158, align: 8)
!799 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !7, file: !7, line: 156, scopeLine: 156, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !16)
!800 = !DILocation(line: 158, column: 6, scope: !799, inlinedAt: !801)
!801 = !DILocation(line: 61, column: 40, scope: !791)
!802 = !DILocation(line: 158, column: 21, scope: !799, inlinedAt: !801)
!803 = !DILocation(line: 158, column: 12, scope: !799, inlinedAt: !801)
!804 = !DILocation(line: 686, column: 64, scope: !805, inlinedAt: !806)
!805 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 686, scopeLine: 686, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!806 = !DILocation(line: 687, column: 58, scope: !807, inlinedAt: !803)
!807 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !33, file: !33, line: 687, scopeLine: 687, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!808 = !DILocation(line: 686, column: 68, scope: !805, inlinedAt: !806)
!809 = !DILocation(line: 671, column: 85, scope: !810, inlinedAt: !804)
!810 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 671, scopeLine: 671, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!811 = !DILocation(line: 671, column: 82, scope: !810, inlinedAt: !804)
!812 = !DILocalVariable(name: "dot", scope: !799, file: !7, line: 159, type: !158, align: 8)
!813 = !DILocation(line: 159, column: 6, scope: !799, inlinedAt: !801)
!814 = !DILocation(line: 686, column: 64, scope: !815, inlinedAt: !816)
!815 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 686, scopeLine: 686, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!816 = !DILocation(line: 159, column: 12, scope: !799, inlinedAt: !801)
!817 = !DILocation(line: 686, column: 68, scope: !815, inlinedAt: !816)
!818 = !DILocation(line: 671, column: 85, scope: !819, inlinedAt: !814)
!819 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 671, scopeLine: 671, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!820 = !DILocation(line: 671, column: 82, scope: !819, inlinedAt: !814)
!821 = !DILocation(line: 156, column: 20, scope: !822, inlinedAt: !823)
!822 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !33, file: !33, line: 151, scopeLine: 151, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!823 = !DILocation(line: 160, column: 15, scope: !799, inlinedAt: !801)
!824 = !DILocation(line: 156, column: 10, scope: !822, inlinedAt: !823)
!825 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.float[<3>].refract", scope: !7, file: !7, line: 63, type: !60, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!826 = !DILocalVariable(name: "self", arg: 1, scope: !825, file: !7, line: 63, type: !62)
!827 = !DILocation(line: 63, column: 24, scope: !825)
!828 = !DILocalVariable(name: "n", arg: 2, scope: !825, file: !7, line: 63, type: !62)
!829 = !DILocation(line: 63, column: 36, scope: !825)
!830 = !DILocalVariable(name: "r", arg: 3, scope: !825, file: !7, line: 63, type: !13)
!831 = !DILocation(line: 63, column: 45, scope: !825)
!832 = !DILocalVariable(name: "dot", scope: !833, file: !7, line: 241, type: !13, align: 4)
!833 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !7, file: !7, line: 239, scopeLine: 239, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !16)
!834 = !DILocation(line: 241, column: 6, scope: !833, inlinedAt: !835)
!835 = !DILocation(line: 63, column: 51, scope: !825)
!836 = !DILocation(line: 643, column: 60, scope: !837, inlinedAt: !838)
!837 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 643, scopeLine: 643, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!838 = !DILocation(line: 241, column: 12, scope: !833, inlinedAt: !835)
!839 = !DILocation(line: 643, column: 64, scope: !837, inlinedAt: !838)
!840 = !DILocation(line: 628, column: 81, scope: !841, inlinedAt: !836)
!841 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 628, scopeLine: 628, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!842 = !DILocation(line: 628, column: 78, scope: !841, inlinedAt: !836)
!843 = !DILocalVariable(name: "d", scope: !833, file: !7, line: 242, type: !13, align: 4)
!844 = !DILocation(line: 242, column: 6, scope: !833, inlinedAt: !835)
!845 = !DILocation(line: 242, column: 14, scope: !833, inlinedAt: !835)
!846 = !DILocation(line: 242, column: 18, scope: !833, inlinedAt: !835)
!847 = !DILocation(line: 242, column: 27, scope: !833, inlinedAt: !835)
!848 = !DILocation(line: 242, column: 33, scope: !833, inlinedAt: !835)
!849 = !DILocation(line: 242, column: 23, scope: !833, inlinedAt: !835)
!850 = !DILocation(line: 242, column: 10, scope: !833, inlinedAt: !835)
!851 = !DILocation(line: 244, column: 9, scope: !833, inlinedAt: !835)
!852 = !DILocation(line: 244, column: 17, scope: !833, inlinedAt: !835)
!853 = !DILocation(line: 244, column: 21, scope: !833, inlinedAt: !835)
!854 = !DILocation(line: 244, column: 25, scope: !833, inlinedAt: !835)
!855 = !DILocation(line: 244, column: 30, scope: !833, inlinedAt: !835)
!856 = !DILocation(line: 244, column: 34, scope: !833, inlinedAt: !835)
!857 = !DILocation(line: 25, column: 10, scope: !858, inlinedAt: !859)
!858 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !51, file: !51, line: 20, scopeLine: 20, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!859 = !DILocation(line: 515, column: 33, scope: !860, inlinedAt: !861)
!860 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !33, file: !33, line: 515, scopeLine: 515, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!861 = !DILocation(line: 244, column: 46, scope: !833, inlinedAt: !835)
!862 = !DILocation(line: 244, column: 57, scope: !833, inlinedAt: !835)
!863 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.double[<3>].refract", scope: !7, file: !7, line: 64, type: !200, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!864 = !DILocalVariable(name: "self", arg: 1, scope: !863, file: !7, line: 64, type: !202)
!865 = !DILocation(line: 64, column: 22, scope: !863)
!866 = !DILocalVariable(name: "n", arg: 2, scope: !863, file: !7, line: 64, type: !202)
!867 = !DILocation(line: 64, column: 33, scope: !863)
!868 = !DILocalVariable(name: "r", arg: 3, scope: !863, file: !7, line: 64, type: !158)
!869 = !DILocation(line: 64, column: 43, scope: !863)
!870 = !DILocalVariable(name: "dot", scope: !871, file: !7, line: 241, type: !158, align: 8)
!871 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !7, file: !7, line: 239, scopeLine: 239, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !16)
!872 = !DILocation(line: 241, column: 6, scope: !871, inlinedAt: !873)
!873 = !DILocation(line: 64, column: 49, scope: !863)
!874 = !DILocation(line: 686, column: 64, scope: !875, inlinedAt: !876)
!875 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 686, scopeLine: 686, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!876 = !DILocation(line: 241, column: 12, scope: !871, inlinedAt: !873)
!877 = !DILocation(line: 686, column: 68, scope: !875, inlinedAt: !876)
!878 = !DILocation(line: 671, column: 85, scope: !879, inlinedAt: !874)
!879 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 671, scopeLine: 671, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!880 = !DILocation(line: 671, column: 82, scope: !879, inlinedAt: !874)
!881 = !DILocalVariable(name: "d", scope: !871, file: !7, line: 242, type: !158, align: 8)
!882 = !DILocation(line: 242, column: 6, scope: !871, inlinedAt: !873)
!883 = !DILocation(line: 242, column: 14, scope: !871, inlinedAt: !873)
!884 = !DILocation(line: 242, column: 18, scope: !871, inlinedAt: !873)
!885 = !DILocation(line: 242, column: 27, scope: !871, inlinedAt: !873)
!886 = !DILocation(line: 242, column: 33, scope: !871, inlinedAt: !873)
!887 = !DILocation(line: 242, column: 23, scope: !871, inlinedAt: !873)
!888 = !DILocation(line: 242, column: 10, scope: !871, inlinedAt: !873)
!889 = !DILocation(line: 244, column: 9, scope: !871, inlinedAt: !873)
!890 = !DILocation(line: 244, column: 17, scope: !871, inlinedAt: !873)
!891 = !DILocation(line: 244, column: 21, scope: !871, inlinedAt: !873)
!892 = !DILocation(line: 244, column: 25, scope: !871, inlinedAt: !873)
!893 = !DILocation(line: 244, column: 30, scope: !871, inlinedAt: !873)
!894 = !DILocation(line: 244, column: 34, scope: !871, inlinedAt: !873)
!895 = !DILocation(line: 25, column: 10, scope: !896, inlinedAt: !897)
!896 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !51, file: !51, line: 20, scopeLine: 20, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!897 = !DILocation(line: 515, column: 33, scope: !898, inlinedAt: !899)
!898 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !33, file: !33, line: 515, scopeLine: 515, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!899 = !DILocation(line: 244, column: 46, scope: !871, inlinedAt: !873)
!900 = !DILocation(line: 244, column: 57, scope: !871, inlinedAt: !873)
!901 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.float[<3>].rotate_quat", scope: !7, file: !7, line: 72, type: !902, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!902 = !DISubroutineType(types: !903)
!903 = !{!62, !63, !904}
!904 = !DICompositeType(tag: DW_TAG_union_type, name: "Quaternion", scope: !7, file: !7, line: 3, size: 128, align: 128, elements: !905, identifier: "std_math_quaternion$float$.Quaternion")
!905 = !{!906, !914}
!906 = !DIDerivedType(tag: DW_TAG_member, scope: !904, file: !7, line: 5, baseType: !907, size: 128, align: 128)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !904, file: !7, line: 5, size: 128, align: 128, elements: !908)
!908 = !{!909, !911, !912, !913}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !907, file: !7, line: 7, baseType: !910, size: 32, align: 32)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 98, baseType: !13, align: 4)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !907, file: !7, line: 7, baseType: !910, size: 32, align: 32, offset: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !907, file: !7, line: 7, baseType: !910, size: 32, align: 32, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !907, file: !7, line: 7, baseType: !910, size: 32, align: 32, offset: 96)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !904, file: !7, line: 9, baseType: !110, size: 128, align: 128)
!915 = !DILocalVariable(name: "self", arg: 1, scope: !901, file: !7, line: 72, type: !62)
!916 = !DILocation(line: 72, column: 28, scope: !901)
!917 = !DILocalVariable(name: "q", arg: 2, scope: !901, file: !7, line: 72, type: !918)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternionf", scope: !7, file: !7, line: 98, baseType: !904, align: 16)
!919 = !DILocation(line: 72, column: 46, scope: !901)
!920 = !DILocation(line: 173, column: 3, scope: !921, inlinedAt: !922)
!921 = distinct !DISubprogram(name: "rotate_by_quat3", linkageName: "rotate_by_quat3", scope: !7, file: !7, line: 170, scopeLine: 170, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!922 = !DILocation(line: 72, column: 52, scope: !901)
!923 = !DILocation(line: 173, column: 5, scope: !921, inlinedAt: !922)
!924 = !DILocation(line: 173, column: 11, scope: !921, inlinedAt: !922)
!925 = !DILocation(line: 173, column: 17, scope: !921, inlinedAt: !922)
!926 = !DILocation(line: 173, column: 23, scope: !921, inlinedAt: !922)
!927 = !DILocation(line: 173, column: 29, scope: !921, inlinedAt: !922)
!928 = !DILocation(line: 173, column: 35, scope: !921, inlinedAt: !922)
!929 = !DILocation(line: 173, column: 41, scope: !921, inlinedAt: !922)
!930 = !DILocation(line: 173, column: 47, scope: !921, inlinedAt: !922)
!931 = !DILocation(line: 173, column: 53, scope: !921, inlinedAt: !922)
!932 = !DILocation(line: 174, column: 6, scope: !921, inlinedAt: !922)
!933 = !DILocation(line: 174, column: 8, scope: !921, inlinedAt: !922)
!934 = !DILocation(line: 174, column: 18, scope: !921, inlinedAt: !922)
!935 = !DILocation(line: 174, column: 14, scope: !921, inlinedAt: !922)
!936 = !DILocation(line: 174, column: 24, scope: !921, inlinedAt: !922)
!937 = !DILocation(line: 174, column: 34, scope: !921, inlinedAt: !922)
!938 = !DILocation(line: 174, column: 30, scope: !921, inlinedAt: !922)
!939 = !DILocation(line: 174, column: 40, scope: !921, inlinedAt: !922)
!940 = !DILocation(line: 175, column: 6, scope: !921, inlinedAt: !922)
!941 = !DILocation(line: 175, column: 8, scope: !921, inlinedAt: !922)
!942 = !DILocation(line: 175, column: 18, scope: !921, inlinedAt: !922)
!943 = !DILocation(line: 175, column: 14, scope: !921, inlinedAt: !922)
!944 = !DILocation(line: 175, column: 24, scope: !921, inlinedAt: !922)
!945 = !DILocation(line: 175, column: 34, scope: !921, inlinedAt: !922)
!946 = !DILocation(line: 175, column: 30, scope: !921, inlinedAt: !922)
!947 = !DILocation(line: 175, column: 40, scope: !921, inlinedAt: !922)
!948 = !DILocation(line: 172, column: 9, scope: !921, inlinedAt: !922)
!949 = !DILocation(line: 176, column: 3, scope: !921, inlinedAt: !922)
!950 = !DILocation(line: 176, column: 5, scope: !921, inlinedAt: !922)
!951 = !DILocation(line: 176, column: 15, scope: !921, inlinedAt: !922)
!952 = !DILocation(line: 176, column: 11, scope: !921, inlinedAt: !922)
!953 = !DILocation(line: 176, column: 21, scope: !921, inlinedAt: !922)
!954 = !DILocation(line: 176, column: 31, scope: !921, inlinedAt: !922)
!955 = !DILocation(line: 176, column: 27, scope: !921, inlinedAt: !922)
!956 = !DILocation(line: 176, column: 37, scope: !921, inlinedAt: !922)
!957 = !DILocation(line: 177, column: 6, scope: !921, inlinedAt: !922)
!958 = !DILocation(line: 177, column: 8, scope: !921, inlinedAt: !922)
!959 = !DILocation(line: 177, column: 14, scope: !921, inlinedAt: !922)
!960 = !DILocation(line: 177, column: 20, scope: !921, inlinedAt: !922)
!961 = !DILocation(line: 177, column: 26, scope: !921, inlinedAt: !922)
!962 = !DILocation(line: 177, column: 32, scope: !921, inlinedAt: !922)
!963 = !DILocation(line: 177, column: 38, scope: !921, inlinedAt: !922)
!964 = !DILocation(line: 177, column: 44, scope: !921, inlinedAt: !922)
!965 = !DILocation(line: 177, column: 50, scope: !921, inlinedAt: !922)
!966 = !DILocation(line: 177, column: 56, scope: !921, inlinedAt: !922)
!967 = !DILocation(line: 178, column: 6, scope: !921, inlinedAt: !922)
!968 = !DILocation(line: 178, column: 8, scope: !921, inlinedAt: !922)
!969 = !DILocation(line: 178, column: 19, scope: !921, inlinedAt: !922)
!970 = !DILocation(line: 178, column: 14, scope: !921, inlinedAt: !922)
!971 = !DILocation(line: 178, column: 25, scope: !921, inlinedAt: !922)
!972 = !DILocation(line: 178, column: 35, scope: !921, inlinedAt: !922)
!973 = !DILocation(line: 178, column: 31, scope: !921, inlinedAt: !922)
!974 = !DILocation(line: 178, column: 41, scope: !921, inlinedAt: !922)
!975 = !DILocation(line: 179, column: 3, scope: !921, inlinedAt: !922)
!976 = !DILocation(line: 179, column: 5, scope: !921, inlinedAt: !922)
!977 = !DILocation(line: 179, column: 16, scope: !921, inlinedAt: !922)
!978 = !DILocation(line: 179, column: 11, scope: !921, inlinedAt: !922)
!979 = !DILocation(line: 179, column: 22, scope: !921, inlinedAt: !922)
!980 = !DILocation(line: 179, column: 32, scope: !921, inlinedAt: !922)
!981 = !DILocation(line: 179, column: 28, scope: !921, inlinedAt: !922)
!982 = !DILocation(line: 179, column: 38, scope: !921, inlinedAt: !922)
!983 = !DILocation(line: 180, column: 6, scope: !921, inlinedAt: !922)
!984 = !DILocation(line: 180, column: 8, scope: !921, inlinedAt: !922)
!985 = !DILocation(line: 180, column: 18, scope: !921, inlinedAt: !922)
!986 = !DILocation(line: 180, column: 14, scope: !921, inlinedAt: !922)
!987 = !DILocation(line: 180, column: 24, scope: !921, inlinedAt: !922)
!988 = !DILocation(line: 180, column: 34, scope: !921, inlinedAt: !922)
!989 = !DILocation(line: 180, column: 30, scope: !921, inlinedAt: !922)
!990 = !DILocation(line: 180, column: 40, scope: !921, inlinedAt: !922)
!991 = !DILocation(line: 181, column: 6, scope: !921, inlinedAt: !922)
!992 = !DILocation(line: 181, column: 8, scope: !921, inlinedAt: !922)
!993 = !DILocation(line: 181, column: 14, scope: !921, inlinedAt: !922)
!994 = !DILocation(line: 181, column: 20, scope: !921, inlinedAt: !922)
!995 = !DILocation(line: 181, column: 26, scope: !921, inlinedAt: !922)
!996 = !DILocation(line: 181, column: 32, scope: !921, inlinedAt: !922)
!997 = !DILocation(line: 181, column: 38, scope: !921, inlinedAt: !922)
!998 = !DILocation(line: 181, column: 44, scope: !921, inlinedAt: !922)
!999 = !DILocation(line: 181, column: 50, scope: !921, inlinedAt: !922)
!1000 = !DILocation(line: 181, column: 56, scope: !921, inlinedAt: !922)
!1001 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.double[<3>].rotate_quat", scope: !7, file: !7, line: 73, type: !1002, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!202, !203, !1004}
!1004 = !DICompositeType(tag: DW_TAG_union_type, name: "Quaternion", scope: !7, file: !7, line: 3, size: 256, align: 256, elements: !1005, identifier: "std_math_quaternion$double$.Quaternion")
!1005 = !{!1006, !1014}
!1006 = !DIDerivedType(tag: DW_TAG_member, scope: !1004, file: !7, line: 5, baseType: !1007, size: 256, align: 256)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !1004, file: !7, line: 5, size: 256, align: 256, elements: !1008)
!1008 = !{!1009, !1011, !1012, !1013}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !1007, file: !7, line: 7, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 99, baseType: !158, align: 8)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !1007, file: !7, line: 7, baseType: !1010, size: 64, align: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !1007, file: !7, line: 7, baseType: !1010, size: 64, align: 64, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1007, file: !7, line: 7, baseType: !1010, size: 64, align: 64, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1004, file: !7, line: 9, baseType: !248, size: 256, align: 256)
!1015 = !DILocalVariable(name: "self", arg: 1, scope: !1001, file: !7, line: 73, type: !202)
!1016 = !DILocation(line: 73, column: 26, scope: !1001)
!1017 = !DILocalVariable(name: "q", arg: 2, scope: !1001, file: !7, line: 73, type: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternion", scope: !7, file: !7, line: 99, baseType: !1004, align: 32)
!1019 = !DILocation(line: 73, column: 43, scope: !1001)
!1020 = !DILocation(line: 173, column: 3, scope: !1021, inlinedAt: !1022)
!1021 = distinct !DISubprogram(name: "rotate_by_quat3", linkageName: "rotate_by_quat3", scope: !7, file: !7, line: 170, scopeLine: 170, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!1022 = !DILocation(line: 73, column: 49, scope: !1001)
!1023 = !DILocation(line: 173, column: 5, scope: !1021, inlinedAt: !1022)
!1024 = !DILocation(line: 173, column: 11, scope: !1021, inlinedAt: !1022)
!1025 = !DILocation(line: 173, column: 17, scope: !1021, inlinedAt: !1022)
!1026 = !DILocation(line: 173, column: 23, scope: !1021, inlinedAt: !1022)
!1027 = !DILocation(line: 173, column: 29, scope: !1021, inlinedAt: !1022)
!1028 = !DILocation(line: 173, column: 35, scope: !1021, inlinedAt: !1022)
!1029 = !DILocation(line: 173, column: 41, scope: !1021, inlinedAt: !1022)
!1030 = !DILocation(line: 173, column: 47, scope: !1021, inlinedAt: !1022)
!1031 = !DILocation(line: 173, column: 53, scope: !1021, inlinedAt: !1022)
!1032 = !DILocation(line: 174, column: 6, scope: !1021, inlinedAt: !1022)
!1033 = !DILocation(line: 174, column: 8, scope: !1021, inlinedAt: !1022)
!1034 = !DILocation(line: 174, column: 18, scope: !1021, inlinedAt: !1022)
!1035 = !DILocation(line: 174, column: 14, scope: !1021, inlinedAt: !1022)
!1036 = !DILocation(line: 174, column: 24, scope: !1021, inlinedAt: !1022)
!1037 = !DILocation(line: 174, column: 34, scope: !1021, inlinedAt: !1022)
!1038 = !DILocation(line: 174, column: 30, scope: !1021, inlinedAt: !1022)
!1039 = !DILocation(line: 174, column: 40, scope: !1021, inlinedAt: !1022)
!1040 = !DILocation(line: 175, column: 6, scope: !1021, inlinedAt: !1022)
!1041 = !DILocation(line: 175, column: 8, scope: !1021, inlinedAt: !1022)
!1042 = !DILocation(line: 175, column: 18, scope: !1021, inlinedAt: !1022)
!1043 = !DILocation(line: 175, column: 14, scope: !1021, inlinedAt: !1022)
!1044 = !DILocation(line: 175, column: 24, scope: !1021, inlinedAt: !1022)
!1045 = !DILocation(line: 175, column: 34, scope: !1021, inlinedAt: !1022)
!1046 = !DILocation(line: 175, column: 30, scope: !1021, inlinedAt: !1022)
!1047 = !DILocation(line: 175, column: 40, scope: !1021, inlinedAt: !1022)
!1048 = !DILocation(line: 172, column: 9, scope: !1021, inlinedAt: !1022)
!1049 = !DILocation(line: 176, column: 3, scope: !1021, inlinedAt: !1022)
!1050 = !DILocation(line: 176, column: 5, scope: !1021, inlinedAt: !1022)
!1051 = !DILocation(line: 176, column: 15, scope: !1021, inlinedAt: !1022)
!1052 = !DILocation(line: 176, column: 11, scope: !1021, inlinedAt: !1022)
!1053 = !DILocation(line: 176, column: 21, scope: !1021, inlinedAt: !1022)
!1054 = !DILocation(line: 176, column: 31, scope: !1021, inlinedAt: !1022)
!1055 = !DILocation(line: 176, column: 27, scope: !1021, inlinedAt: !1022)
!1056 = !DILocation(line: 176, column: 37, scope: !1021, inlinedAt: !1022)
!1057 = !DILocation(line: 177, column: 6, scope: !1021, inlinedAt: !1022)
!1058 = !DILocation(line: 177, column: 8, scope: !1021, inlinedAt: !1022)
!1059 = !DILocation(line: 177, column: 14, scope: !1021, inlinedAt: !1022)
!1060 = !DILocation(line: 177, column: 20, scope: !1021, inlinedAt: !1022)
!1061 = !DILocation(line: 177, column: 26, scope: !1021, inlinedAt: !1022)
!1062 = !DILocation(line: 177, column: 32, scope: !1021, inlinedAt: !1022)
