; ModuleID = 'std::net::tcp'
source_filename = "std::net::tcp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%.fault = type { i64, %"char[]", i64 }
%Socket = type { i32, i32, [128 x i8] }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.net.tcp.connect = comdat any

$std.net.tcp.connect_async = comdat any

$std.net.tcp.connect_to = comdat any

$std.net.tcp.connect_async_to = comdat any

$std.net.tcp.listen = comdat any

$std.net.tcp.accept = comdat any

$std.net.tcp.listen_to = comdat any

$"$ct.std.net.tcp.TcpSocket" = comdat any

$"$ct.std.net.Socket" = comdat any

$"$ct.std.net.tcp.TcpServerSocket" = comdat any

$"$ct.char" = comdat any

$"$ct.std.net.IpProtocol" = comdat any

$"std.net.IpProtocol$ai_family" = comdat any

$"std.net.NetError$INVALID_URL" = comdat any

$"std.net.NetError$URL_TOO_LONG" = comdat any

$"std.net.NetError$INVALID_SOCKET" = comdat any

$"std.net.NetError$GENERAL_ERROR" = comdat any

$"std.net.NetError$INVALID_IP_STRING" = comdat any

$"std.net.NetError$ADDRINFO_FAILED" = comdat any

$"std.net.NetError$CONNECT_FAILED" = comdat any

$"std.net.NetError$LISTEN_FAILED" = comdat any

$"std.net.NetError$ACCEPT_FAILED" = comdat any

$"std.net.NetError$WRITE_FAILED" = comdat any

$"std.net.NetError$READ_FAILED" = comdat any


!0 = !{i32 4, !"PIE Level", i32 2}
!1 = !{i32 4, !"PIC Level", i32 2}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = !{i32 2, !"Debug Info Version", i32 3}
!4 = !{i32 2, !"frame-pointer", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "tcp.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/net")
!8 = !{!9, !18}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SocketOption", scope: !7, file: !7, line: 84, baseType: !10, size: 8, align: 8, elements: !11)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !{!12, !13, !14, !15, !16, !17}
!12 = !DIEnumerator(name: "REUSEADDR", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "REUSEPORT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "KEEPALIVE", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "BROADCAST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OOBINLINE", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "DONTROUTE", value: 5, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IpProtocol", scope: !7, file: !7, line: 5, baseType: !10, size: 8, align: 8, elements: !19)
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "UNSPECIFIED", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "IPV4", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "IPV6", value: 2, isUnsigned: true)
!23 = distinct !DISubprogram(name: "connect", linkageName: "std.net.tcp.connect", scope: !7, file: !7, line: 8, type: !24, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !56)
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !28, !42, !37, !50, !51, !18}
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !27)
!27 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TcpSocket*", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "TcpSocket", scope: !7, file: !7, line: 5, baseType: !30, align: 4)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Socket", scope: !7, file: !7, line: 4, size: 1088, align: 32, elements: !31, identifier: "std.net.Socket")
!31 = !{!32, !35, !38}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !30, file: !7, line: 6, baseType: !33, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "NativeSocket", scope: !7, file: !7, line: 7, baseType: !34, align: 4)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !30, file: !7, line: 7, baseType: !36, size: 32, align: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "Socklen_t", scope: !7, file: !7, line: 9, baseType: !37, align: 4)
!37 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr_storage", scope: !30, file: !7, line: 10, baseType: !39, size: 1024, align: 8, offset: 64)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, align: 8, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 128, lowerBound: 0)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !44, identifier: "char[]")
!44 = !{!45, !47}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !43, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !43, baseType: !48, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !49)
!49 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "Duration", scope: !7, file: !7, line: 5, baseType: !27, align: 8)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "SocketOption[]", size: 128, align: 64, elements: !52, identifier: "SocketOption[]")
!52 = !{!53, !55}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !51, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SocketOption*", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !51, baseType: !48, size: 64, align: 64, offset: 64)
!56 = !{}
!57 = !DILocalVariable(name: "host", arg: 1, scope: !23, file: !7, line: 8, type: !42)
!58 = !DILocation(line: 8, column: 30, scope: !23)
!59 = !DILocalVariable(name: "port", arg: 2, scope: !23, file: !7, line: 8, type: !37)
!60 = !DILocation(line: 8, column: 41, scope: !23)
!61 = !DILocalVariable(name: "timeout", arg: 3, scope: !23, file: !7, line: 8, type: !50)
!62 = !DILocation(line: 8, column: 56, scope: !23)
!63 = !DILocalVariable(name: "options", arg: 4, scope: !23, file: !7, line: 8, type: !51)
!64 = !DILocation(line: 8, column: 85, scope: !23)
!65 = !DILocalVariable(name: "ip_protocol", arg: 5, scope: !23, file: !7, line: 8, type: !18)
!66 = !DILocation(line: 8, column: 105, scope: !23)
!67 = !DILocalVariable(name: "ai", scope: !23, file: !7, line: 10, type: !68, align: 8)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "AddrInfo*", baseType: !69, size: 64, align: 64, dwarfAddressSpace: 0)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddrInfo", scope: !7, file: !7, line: 14, size: 384, align: 64, elements: !70, identifier: "std.net.os.AddrInfo")
!70 = !{!71, !73, !75, !77, !79, !80, !88}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !69, file: !7, line: 16, baseType: !72, size: 32, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIFlags", scope: !7, file: !7, line: 7, baseType: !34, align: 4)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !69, file: !7, line: 17, baseType: !74, size: 32, align: 32, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIFamily", scope: !7, file: !7, line: 4, baseType: !34, align: 4)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !69, file: !7, line: 18, baseType: !76, size: 32, align: 32, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "AISockType", scope: !7, file: !7, line: 6, baseType: !34, align: 4)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !69, file: !7, line: 19, baseType: !78, size: 32, align: 32, offset: 96)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIProtocol", scope: !7, file: !7, line: 5, baseType: !34, align: 4)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !69, file: !7, line: 20, baseType: !36, size: 32, align: 32, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, scope: !69, file: !7, line: 26, baseType: !81, size: 128, align: 64, offset: 192)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !69, file: !7, line: 26, size: 128, align: 64, elements: !82)
!82 = !{!83, !86}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !81, file: !7, line: 28, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "SockAddrPtr", scope: !7, file: !7, line: 12, baseType: !85, align: 8)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !81, file: !7, line: 29, baseType: !87, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !7, file: !7, line: 6, baseType: !46, align: 8)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !69, file: !7, line: 31, baseType: !68, size: 64, align: 64, offset: 320)
!89 = !DILocation(line: 10, column: 12, scope: !23)
!90 = !DILocation(line: 10, column: 44, scope: !23)
!91 = !DILocation(line: 10, column: 23, scope: !23)
!92 = !DILocation(line: 12, column: 6, scope: !23)
!93 = !DILocation(line: 14, column: 26, scope: !94)
!94 = distinct !DILexicalBlock(scope: !23, file: !7, line: 13, column: 2)
!95 = !DILocation(line: 11, column: 25, scope: !96)
!96 = distinct !DILexicalBlock(scope: !23, file: !7, line: 11, column: 12)
!97 = !DILocation(line: 11, column: 12, scope: !96)
!98 = !DILocation(line: 11, column: 25, scope: !99)
!99 = distinct !DILexicalBlock(scope: !23, file: !7, line: 11, column: 12)
!100 = !DILocation(line: 11, column: 12, scope: !99)
!101 = !DILocation(line: 16, column: 9, scope: !23)
!102 = !DILocation(line: 11, column: 25, scope: !103)
!103 = distinct !DILexicalBlock(scope: !23, file: !7, line: 11, column: 12)
!104 = !DILocation(line: 11, column: 12, scope: !103)
!105 = !DILocation(line: 11, column: 25, scope: !106)
!106 = distinct !DILexicalBlock(scope: !23, file: !7, line: 11, column: 12)
!107 = !DILocation(line: 11, column: 12, scope: !106)
!108 = distinct !DISubprogram(name: "connect_async", linkageName: "std.net.tcp.connect_async", scope: !7, file: !7, line: 19, type: !109, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !56)
!109 = !DISubroutineType(types: !110)
!110 = !{!26, !28, !42, !37, !51, !18}
!111 = !DILocalVariable(name: "host", arg: 1, scope: !108, file: !7, line: 19, type: !42)
!112 = !DILocation(line: 19, column: 36, scope: !108)
!113 = !DILocalVariable(name: "port", arg: 2, scope: !108, file: !7, line: 19, type: !37)
!114 = !DILocation(line: 19, column: 47, scope: !108)
!115 = !DILocalVariable(name: "options", arg: 3, scope: !108, file: !7, line: 19, type: !51)
!116 = !DILocation(line: 19, column: 69, scope: !108)
!117 = !DILocalVariable(name: "ip_protocol", arg: 4, scope: !108, file: !7, line: 19, type: !18)
!118 = !DILocation(line: 19, column: 89, scope: !108)
!119 = !DILocalVariable(name: "ai", scope: !108, file: !7, line: 21, type: !68, align: 8)
!120 = !DILocation(line: 21, column: 12, scope: !108)
!121 = !DILocation(line: 21, column: 43, scope: !108)
!122 = !DILocation(line: 21, column: 22, scope: !108)
!123 = !DILocation(line: 23, column: 9, scope: !108)
!124 = !DILocation(line: 22, column: 25, scope: !125)
!125 = distinct !DILexicalBlock(scope: !108, file: !7, line: 22, column: 12)
!126 = !DILocation(line: 22, column: 12, scope: !125)
!127 = !DILocation(line: 22, column: 25, scope: !128)
!128 = distinct !DILexicalBlock(scope: !108, file: !7, line: 22, column: 12)
!129 = !DILocation(line: 22, column: 12, scope: !128)
!130 = distinct !DISubprogram(name: "connect_to", linkageName: "std.net.tcp.connect_to", scope: !7, file: !7, line: 26, type: !131, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !56)
!131 = !DISubroutineType(types: !132)
!132 = !{!26, !28, !68, !51}
!133 = !DILocalVariable(name: "ai", arg: 1, scope: !130, file: !7, line: 26, type: !68)
!134 = !DILocation(line: 26, column: 36, scope: !130)
!135 = !DILocalVariable(name: "options", arg: 2, scope: !130, file: !7, line: 26, type: !51)
!136 = !DILocation(line: 26, column: 56, scope: !130)
!137 = !DILocation(line: 28, column: 10, scope: !130)
!138 = distinct !DISubprogram(name: "connect_async_to", linkageName: "std.net.tcp.connect_async_to", scope: !7, file: !7, line: 31, type: !131, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !56)
!139 = !DILocalVariable(name: "ai", arg: 1, scope: !138, file: !7, line: 31, type: !68)
!140 = !DILocation(line: 31, column: 42, scope: !138)
!141 = !DILocalVariable(name: "options", arg: 2, scope: !138, file: !7, line: 31, type: !51)
!142 = !DILocation(line: 31, column: 62, scope: !138)
