; ModuleID = 'std::hash::md5'
source_filename = "std::hash::md5"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Md5 = type { i32, i32, i32, i32, i32, i32, [64 x i8], [16 x i32] }

$std.hash.md5.Md5.init = comdat any

$std.hash.md5.Md5.update = comdat any

$std.hash.md5.Md5.final = comdat any

$std.hash.md5.hash = comdat any

$"$ct.std.hash.md5.Md5" = comdat any

$std.hash.md5.BLOCK_BYTES = comdat any

$std.hash.md5.HASH_BYTES = comdat any

$"$ct.ulong" = comdat any

$"$ct.long" = comdat any

$"$ct.uint" = comdat any

@"$ct.std.hash.md5.Md5" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 152, i64 0, i64 8, [0 x i64] zeroinitializer }, comdat, align 8
@std.hash.md5.BLOCK_BYTES = weak local_unnamed_addr constant i32 64, comdat, align 4, !dbg !0
@std.hash.md5.HASH_BYTES = weak local_unnamed_addr constant i32 16, comdat, align 4, !dbg !4
@.panic_msg = internal constant [63 x i8] c"Reference parameter 'self' was passed a null pointer argument.\00", align 1
@.file = internal constant [7 x i8] c"md5.c3\00", align 1
@.func = internal constant [5 x i8] c"init\00", align 1
@std.core.builtin.panic = extern_weak global ptr, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BLOCK_BYTES", linkageName: "std.hash.md5.BLOCK_BYTES", scope: !2, file: !2, line: 5, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "md5.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/hash")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "HASH_BYTES", linkageName: "std.hash.md5.HASH_BYTES", scope: !2, file: !2, line: 6, type: !3, isLocal: false, isDefinition: true, align: 4)
!6 = !{i32 4, !"PIE Level", i32 2}
!7 = !{i32 4, !"PIC Level", i32 2}
!8 = !{i32 2, !"Dwarf Version", i32 4}
!9 = !{i32 2, !"Debug Info Version", i32 3}
!10 = !{i32 2, !"frame-pointer", i32 2}
!11 = !{i32 1, !"uwtable", i32 2}
!12 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !13, splitDebugInlining: false)
!13 = !{!0, !4}
!14 = distinct !DISubprogram(name: "init", linkageName: "std.hash.md5.Md5.init", scope: !2, file: !2, line: 28, type: !15, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !12, retainedNodes: !36)
!15 = !DISubroutineType(types: !16)
!16 = !{null, !17}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Md5*", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "Md5", scope: !2, file: !2, line: 8, size: 1216, align: 32, elements: !19, identifier: "std.hash.md5.Md5")
!19 = !{!20, !22, !23, !24, !25, !26, !27, !32}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !18, file: !2, line: 10, baseType: !21, size: 32, align: 32)
!21 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !18, file: !2, line: 10, baseType: !21, size: 32, align: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !18, file: !2, line: 11, baseType: !21, size: 32, align: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !18, file: !2, line: 11, baseType: !21, size: 32, align: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !18, file: !2, line: 11, baseType: !21, size: 32, align: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !18, file: !2, line: 11, baseType: !21, size: 32, align: 32, offset: 160)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !18, file: !2, line: 12, baseType: !28, size: 512, align: 8, offset: 192)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 512, align: 8, elements: !30)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!30 = !{!31}
!31 = !DISubrange(count: 64, lowerBound: 0)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !18, file: !2, line: 13, baseType: !33, size: 512, align: 32, offset: 704)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 512, align: 32, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 16, lowerBound: 0)
!36 = !{}
!37 = !DILocation(line: 29, column: 1, scope: !14)
!38 = !DILocalVariable(name: "self", arg: 1, scope: !14, file: !2, line: 28, type: !17)
!39 = !DILocation(line: 28, column: 18, scope: !14)
!40 = !DILocation(line: 30, column: 2, scope: !14)
!41 = !DILocation(line: 30, column: 11, scope: !14)
!42 = !DILocation(line: 31, column: 2, scope: !14)
!43 = !DILocation(line: 31, column: 11, scope: !14)
!44 = !DILocation(line: 32, column: 2, scope: !14)
!45 = !DILocation(line: 32, column: 11, scope: !14)
!46 = !DILocation(line: 33, column: 2, scope: !14)
!47 = !DILocation(line: 33, column: 11, scope: !14)
!48 = !DILocation(line: 35, column: 2, scope: !14)
!49 = !DILocation(line: 35, column: 12, scope: !14)
!50 = !DILocation(line: 36, column: 2, scope: !14)
!51 = !DILocation(line: 36, column: 12, scope: !14)
!52 = distinct !DISubprogram(name: "update", linkageName: "std.hash.md5.Md5.update", scope: !2, file: !2, line: 40, type: !53, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !12, retainedNodes: !36)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !17, !55}
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !56, identifier: "char[]")
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !55, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !55, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !61)
!61 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!62 = !DILocation(line: 41, column: 1, scope: !52)
!63 = !DILocalVariable(name: "ctx", arg: 1, scope: !52, file: !2, line: 40, type: !17)
!64 = !DILocation(line: 40, column: 20, scope: !52)
!65 = !DILocalVariable(name: "data", arg: 2, scope: !52, file: !2, line: 40, type: !55)
!66 = !DILocation(line: 40, column: 33, scope: !52)
!67 = !DILocalVariable(name: "saved_lo", scope: !52, file: !2, line: 42, type: !21, align: 4)
!68 = !DILocation(line: 42, column: 7, scope: !52)
!69 = !DILocation(line: 42, column: 18, scope: !52)
!70 = !DILocation(line: 43, column: 7, scope: !52)
!71 = !DILocation(line: 43, column: 17, scope: !52)
!72 = !DILocation(line: 43, column: 28, scope: !52)
!73 = !DILocation(line: 43, column: 54, scope: !52)
!74 = !DILocation(line: 43, column: 64, scope: !52)
!75 = !DILocation(line: 44, column: 2, scope: !52)
!76 = !DILocation(line: 44, column: 12, scope: !52)
!77 = !DILocalVariable(name: "used", scope: !52, file: !2, line: 46, type: !60, align: 8)
!78 = !DILocation(line: 46, column: 6, scope: !52)
!79 = !DILocation(line: 46, column: 14, scope: !52)
!80 = !DILocation(line: 48, column: 6, scope: !52)
!81 = !DILocalVariable(name: "available", scope: !82, file: !2, line: 50, type: !60, align: 8)
!82 = distinct !DILexicalBlock(scope: !52, file: !2, line: 49, column: 2)
!83 = !DILocation(line: 50, column: 7, scope: !82)
!84 = !DILocation(line: 50, column: 24, scope: !82)
!85 = !DILocation(line: 50, column: 19, scope: !82)
!86 = !DILocation(line: 52, column: 7, scope: !82)
!87 = !DILocation(line: 52, column: 18, scope: !82)
!88 = !DILocation(line: 54, column: 32, scope: !89)
!89 = distinct !DILexicalBlock(scope: !82, file: !2, line: 53, column: 3)
!90 = !DILocation(line: 54, column: 37, scope: !89)
!91 = !DILocation(line: 54, column: 4, scope: !89)
!92 = !DILocation(line: 54, column: 15, scope: !89)
!93 = !DILocation(line: 54, column: 20, scope: !89)
!94 = !DILocation(line: 55, column: 10, scope: !89)
!95 = !DILocation(line: 57, column: 32, scope: !82)
!96 = !DILocation(line: 57, column: 37, scope: !82)
!97 = !DILocation(line: 57, column: 38, scope: !82)
!98 = !DILocation(line: 57, column: 3, scope: !82)
!99 = !DILocation(line: 57, column: 14, scope: !82)
!100 = !DILocation(line: 57, column: 19, scope: !82)
!101 = !DILocation(line: 58, column: 10, scope: !82)
!102 = !DILocation(line: 58, column: 15, scope: !82)
!103 = !DILocation(line: 59, column: 14, scope: !82)
!104 = !DILocation(line: 59, column: 26, scope: !82)
!105 = !DILocation(line: 59, column: 3, scope: !82)
!106 = !DILocation(line: 62, column: 6, scope: !52)
!107 = !DILocation(line: 64, column: 26, scope: !108)
!108 = distinct !DILexicalBlock(scope: !52, file: !2, line: 63, column: 2)
!109 = !DILocation(line: 64, column: 10, scope: !108)
!110 = !DILocation(line: 64, column: 50, scope: !108)
!111 = !DILocation(line: 66, column: 26, scope: !52)
!112 = !DILocation(line: 66, column: 31, scope: !52)
!113 = !DILocation(line: 66, column: 2, scope: !52)
!114 = !DILocation(line: 66, column: 14, scope: !52)
!115 = distinct !DISubprogram(name: "final", linkageName: "std.hash.md5.Md5.final", scope: !2, file: !2, line: 69, type: !116, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !12, retainedNodes: !36)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !17}
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 128, align: 8, elements: !34)
!119 = !DILocation(line: 70, column: 1, scope: !115)
!120 = !DILocalVariable(name: "ctx", arg: 1, scope: !115, file: !2, line: 69, type: !17)
!121 = !DILocation(line: 69, column: 31, scope: !115)
!122 = !DILocalVariable(name: "used", scope: !115, file: !2, line: 71, type: !60, align: 8)
!123 = !DILocation(line: 71, column: 6, scope: !115)
