; ModuleID = 'std::encoding::json'
source_filename = "std::encoding::json"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%ByteReader = type { %"char[]", i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%JsonContext = type { i32, %any, %any, i32, ptr, double, i8, i8 }
%"any[]" = type { ptr, i64 }

$std.encoding.json.parse_string = comdat any

$std.encoding.json.temp_parse_string = comdat any

$std.encoding.json.parse = comdat any

$std.encoding.json.temp_parse = comdat any

$std.encoding.json.lex_string = comdat any

$.dyn_search = comdat any

$"std.encoding.json.JsonParsingError$EOF" = comdat any

$"std.encoding.json.JsonParsingError$UNEXPECTED_CHARACTER" = comdat any

$"std.encoding.json.JsonParsingError$INVALID_ESCAPE_SEQUENCE" = comdat any

$"std.encoding.json.JsonParsingError$DUPLICATE_MEMBERS" = comdat any

$"std.encoding.json.JsonParsingError$INVALID_NUMBER" = comdat any

$"$ct.std.encoding.json.JsonParsingError" = comdat any

$"$ct.std.encoding.json.JsonContext" = comdat any

$"$ct.int" = comdat any

$"$ct.std.encoding.json.JsonTokenType" = comdat any

$"$ct.std.io.ByteReader" = comdat any

$"$ct.std.core.mem.allocator.TempAllocator" = comdat any

$"$ct.std.core.mem.allocator.OnStackAllocator" = comdat any


!0 = !{i32 4, !"PIE Level", i32 2}
!1 = !{i32 4, !"PIC Level", i32 2}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = !{i32 2, !"Debug Info Version", i32 3}
!4 = !{i32 2, !"frame-pointer", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "json.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/encoding")
!8 = !{!9}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "JsonTokenType", scope: !10, file: !7, line: 47, baseType: !34, size: 32, align: 32, elements: !35)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "JsonContext", scope: !7, file: !7, line: 64, size: 576, align: 64, elements: !11, identifier: "std.encoding.json.JsonContext")
!11 = !{!12, !14, !21, !26, !27, !29, !31, !33}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !10, file: !7, line: 66, baseType: !13, size: 32, align: 32)
!13 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !10, file: !7, line: 67, baseType: !15, size: 128, align: 64, offset: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "InStream", size: 128, align: 64, elements: !16, identifier: "InStream")
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !15, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !15, baseType: !20, size: 64, align: 64, offset: 64)
!20 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !10, file: !7, line: 68, baseType: !22, size: 128, align: 64, offset: 192)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !23, identifier: "Allocator")
!23 = !{!24, !25}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !22, baseType: !18, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !22, baseType: !20, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !10, file: !7, line: 69, baseType: !9, size: 32, align: 32, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "last_string", scope: !10, file: !7, line: 70, baseType: !28, size: 64, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !7, file: !7, line: 4, baseType: !18, align: 8)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "last_number", scope: !10, file: !7, line: 71, baseType: !30, size: 64, align: 64, offset: 448)
!30 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !10, file: !7, line: 72, baseType: !32, size: 8, align: 8, offset: 512)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !DIDerivedType(tag: DW_TAG_member, scope: !10, file: !7, line: 73, baseType: !32, size: 8, align: 8, offset: 520)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!36 = !DIEnumerator(name: "NO_TOKEN", value: 0)
!37 = !DIEnumerator(name: "LBRACE", value: 1)
!38 = !DIEnumerator(name: "LBRACKET", value: 2)
!39 = !DIEnumerator(name: "COMMA", value: 3)
!40 = !DIEnumerator(name: "COLON", value: 4)
!41 = !DIEnumerator(name: "RBRACE", value: 5)
!42 = !DIEnumerator(name: "RBRACKET", value: 6)
!43 = !DIEnumerator(name: "STRING", value: 7)
!44 = !DIEnumerator(name: "NUMBER", value: 8)
!45 = !DIEnumerator(name: "TRUE", value: 9)
!46 = !DIEnumerator(name: "FALSE", value: 10)
!47 = !DIEnumerator(name: "NULL", value: 11)
!48 = !DIEnumerator(name: "EOF", value: 12)
!49 = distinct !DISubprogram(name: "parse_string", linkageName: "std.encoding.json.parse_string", scope: !7, file: !7, line: 18, type: !50, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !112)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !54, !69, !22}
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !53)
!53 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object**", baseType: !55, size: 64, align: 64, dwarfAddressSpace: 0)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object*", baseType: !56, size: 64, align: 64, dwarfAddressSpace: 0)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", scope: !7, file: !7, line: 11, size: 576, align: 64, elements: !57, identifier: "std.collections.object.Object")
!57 = !{!58, !59, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !56, file: !7, line: 13, baseType: !20, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !56, file: !7, line: 14, baseType: !22, size: 128, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, scope: !56, file: !7, line: 15, baseType: !61, size: 384, align: 64, offset: 192)
!61 = !DICompositeType(tag: DW_TAG_union_type, scope: !56, file: !7, line: 15, size: 384, align: 64, elements: !62)
!62 = !{!63, !65, !66, !68, !77, !78, !88}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !61, file: !7, line: 17, baseType: !64, size: 128, align: 64)
!64 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !61, file: !7, line: 18, baseType: !30, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !61, file: !7, line: 19, baseType: !67, size: 8, align: 8)
!67 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !61, file: !7, line: 20, baseType: !69, size: 128, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !70)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !71, identifier: "char[]")
!71 = !{!72, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !70, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !70, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !76)
!76 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !61, file: !7, line: 21, baseType: !18, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !61, file: !7, line: 22, baseType: !79, size: 320, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalList", scope: !7, file: !7, line: 466, baseType: !80, align: 8)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !7, file: !7, line: 14, size: 320, align: 64, elements: !81, identifier: "std_collections_list$p$std.collections.object.Object$.List")
!81 = !{!82, !83, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !80, file: !7, line: 16, baseType: !75, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !80, file: !7, line: 17, baseType: !75, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !80, file: !7, line: 18, baseType: !22, size: 128, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !80, file: !7, line: 19, baseType: !86, size: 64, align: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !87, size: 64, align: 64, dwarfAddressSpace: 0)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !7, file: !7, line: 466, baseType: !55, align: 8)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !61, file: !7, line: 23, baseType: !89, size: 384, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalMap", scope: !7, file: !7, line: 465, baseType: !90, align: 8)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !7, file: !7, line: 10, size: 384, align: 64, elements: !91, identifier: "std_collections_map$String$p$std.collections.object.Object$.HashMap")
!91 = !{!92, !107, !108, !109, !110}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !90, file: !7, line: 12, baseType: !93, size: 128, align: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !94, identifier: "Entry*[]")
!94 = !{!95, !106}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !93, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !97, size: 64, align: 64, dwarfAddressSpace: 0)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !98, size: 64, align: 64, dwarfAddressSpace: 0)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !7, file: !7, line: 499, size: 320, align: 64, elements: !99, identifier: "std_collections_map$String$p$std.collections.object.Object$.Entry")
!99 = !{!100, !101, !103, !105}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !98, file: !7, line: 501, baseType: !13, size: 32, align: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !98, file: !7, line: 502, baseType: !102, size: 128, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !7, file: !7, line: 465, baseType: !69, align: 8)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !98, file: !7, line: 503, baseType: !104, size: 64, align: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !7, file: !7, line: 465, baseType: !55, align: 8)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !7, line: 504, baseType: !97, size: 64, align: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !93, baseType: !75, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !90, file: !7, line: 13, baseType: !22, size: 128, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !90, file: !7, line: 14, baseType: !13, size: 32, align: 32, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !90, file: !7, line: 15, baseType: !13, size: 32, align: 32, offset: 288)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !90, file: !7, line: 16, baseType: !111, size: 32, align: 32, offset: 320)
!111 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!112 = !{}
!113 = !DILocalVariable(name: "s", arg: 1, scope: !49, file: !7, line: 18, type: !69)
!114 = !DILocation(line: 18, column: 33, scope: !49)
!115 = !DILocalVariable(name: "allocator", arg: 2, scope: !49, file: !7, line: 18, type: !22)
!116 = !DILocation(line: 18, column: 46, scope: !49)
!117 = !DILocation(line: 20, column: 33, scope: !49)
!118 = !DILocation(line: 20, column: 15, scope: !49)
!119 = !DILocation(line: 20, column: 9, scope: !49)
!120 = distinct !DISubprogram(name: "temp_parse_string", linkageName: "std.encoding.json.temp_parse_string", scope: !7, file: !7, line: 23, type: !121, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !112)
!121 = !DISubroutineType(types: !122)
!122 = !{!52, !54, !69}
!123 = !DILocalVariable(name: "s", arg: 1, scope: !120, file: !7, line: 23, type: !69)
!124 = !DILocation(line: 23, column: 38, scope: !120)
!125 = !DILocation(line: 25, column: 33, scope: !120)
!126 = !DILocation(line: 25, column: 15, scope: !120)
!127 = !DILocation(line: 396, column: 7, scope: !128, inlinedAt: !130)
!128 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !129, file: !129, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!129 = !DIFile(filename: "mem_allocator.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!130 = !DILocation(line: 25, column: 48, scope: !120)
!131 = !DILocation(line: 398, column: 3, scope: !132, inlinedAt: !130)
!132 = distinct !DILexicalBlock(scope: !128, file: !129, line: 397, column: 2)
!133 = !DILocation(line: 400, column: 9, scope: !128, inlinedAt: !130)
!134 = !DILocation(line: 25, column: 9, scope: !120)
!135 = distinct !DISubprogram(name: "parse", linkageName: "std.encoding.json.parse", scope: !7, file: !7, line: 28, type: !136, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !112)
!136 = !DISubroutineType(types: !137)
!137 = !{!52, !54, !15, !22}
!138 = !DILocalVariable(name: "s", arg: 1, scope: !135, file: !7, line: 28, type: !15)
!139 = !DILocation(line: 28, column: 28, scope: !135)
!140 = !DILocalVariable(name: "allocator", arg: 2, scope: !135, file: !7, line: 28, type: !22)
!141 = !DILocation(line: 28, column: 41, scope: !135)
!142 = !DILocalVariable(name: "buffer", scope: !143, file: !7, line: 484, type: !145, align: 16)
!143 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !144, file: !144, line: 482, scopeLine: 482, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !112)
!144 = !DIFile(filename: "mem.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 4096, align: 8, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 512, lowerBound: 0)
!148 = !DILocation(line: 484, column: 14, scope: !143, inlinedAt: !149)
!149 = !DILocation(line: 30, column: 2, scope: !135)
!150 = !DILocalVariable(name: "allocator", scope: !143, file: !7, line: 485, type: !151, align: 8)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !7, file: !7, line: 3, size: 384, align: 64, elements: !152, identifier: "std.core.mem.allocator.OnStackAllocator")
!152 = !{!153, !154, !155, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !151, file: !7, line: 5, baseType: !22, size: 128, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !151, file: !7, line: 6, baseType: !70, size: 128, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !151, file: !7, line: 7, baseType: !75, size: 64, align: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !151, file: !7, line: 8, baseType: !157, size: 64, align: 64, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !158, size: 64, align: 64, dwarfAddressSpace: 0)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !7, file: !7, line: 12, size: 192, align: 64, elements: !159, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk")
!159 = !{!160, !161, !162}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !158, file: !7, line: 14, baseType: !67, size: 8, align: 8)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !158, file: !7, line: 15, baseType: !157, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !158, file: !7, line: 16, baseType: !18, size: 64, align: 64, offset: 128)
!163 = !DILocation(line: 485, column: 19, scope: !143, inlinedAt: !149)
!164 = !DILocation(line: 486, column: 18, scope: !143, inlinedAt: !149)
!165 = !DILocation(line: 392, column: 27, scope: !166, inlinedAt: !167)
!166 = distinct !DISubprogram(name: "heap", linkageName: "heap", scope: !129, file: !129, line: 392, scopeLine: 392, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!167 = !DILocation(line: 486, column: 37, scope: !143, inlinedAt: !149)
!168 = !DILocation(line: 486, column: 2, scope: !143, inlinedAt: !149)
!169 = !DILocalVariable(name: "mem", scope: !135, file: !7, line: 30, type: !22, align: 8)
!170 = !DILocation(line: 30, column: 28, scope: !135)
!171 = !DILocation(line: 488, column: 9, scope: !172, inlinedAt: !149)
!172 = distinct !DILexicalBlock(scope: !143, file: !144, line: 488, column: 2)
!173 = !DILocalVariable(name: "context", scope: !174, file: !7, line: 32, type: !10, align: 8)
!174 = distinct !DILexicalBlock(scope: !135, file: !7, line: 31, column: 2)
!175 = !DILocation(line: 32, column: 15, scope: !174)
!176 = !DILocation(line: 32, column: 73, scope: !174)
!177 = !DILocation(line: 32, column: 51, scope: !174)
!178 = !DILocation(line: 32, column: 89, scope: !174)
!179 = !DILocation(line: 32, column: 105, scope: !174)
!180 = !DILocalVariable(name: "current", scope: !181, file: !7, line: 536, type: !182, align: 8)
!181 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !144, file: !144, line: 534, scopeLine: 534, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !112)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !183, size: 64, align: 64, dwarfAddressSpace: 0)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !7, file: !7, line: 10, size: 320, align: 64, elements: !184, identifier: "std.core.mem.allocator.TempAllocator")
!184 = !{!185, !186, !199, !200, !201}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !183, file: !7, line: 12, baseType: !22, size: 128, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !183, file: !7, line: 13, baseType: !187, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !188, size: 64, align: 64, dwarfAddressSpace: 0)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !7, file: !7, line: 22, size: 320, align: 64, elements: !189, identifier: "std.core.mem.allocator.TempAllocatorPage")
!189 = !{!190, !191, !192, !193, !194, !195}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !188, file: !7, line: 24, baseType: !187, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !188, file: !7, line: 25, baseType: !18, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !188, file: !7, line: 26, baseType: !75, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !188, file: !7, line: 27, baseType: !75, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !188, file: !7, line: 28, baseType: !75, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !188, file: !7, line: 29, baseType: !196, align: 8, offset: 320)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, align: 8, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 0, lowerBound: 0)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !183, file: !7, line: 14, baseType: !75, size: 64, align: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !183, file: !7, line: 15, baseType: !75, size: 64, align: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !183, file: !7, line: 16, baseType: !196, align: 8, offset: 320)
!202 = !DILocation(line: 536, column: 17, scope: !181, inlinedAt: !203)
!203 = !DILocation(line: 33, column: 3, scope: !174)
!204 = !DILocation(line: 396, column: 7, scope: !205, inlinedAt: !206)
!205 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !129, file: !129, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!206 = !DILocation(line: 536, column: 38, scope: !181, inlinedAt: !203)
!207 = !DILocation(line: 398, column: 3, scope: !208, inlinedAt: !206)
!208 = distinct !DILexicalBlock(scope: !205, file: !129, line: 397, column: 2)
!209 = !DILocation(line: 400, column: 9, scope: !205, inlinedAt: !206)
!210 = !DILocalVariable(name: "original", scope: !181, file: !7, line: 539, type: !182, align: 8)
!211 = !DILocation(line: 539, column: 18, scope: !181, inlinedAt: !203)
!212 = !DILocation(line: 539, column: 29, scope: !181, inlinedAt: !203)
!213 = !DILocation(line: 540, column: 7, scope: !181, inlinedAt: !203)
!214 = !DILocation(line: 540, column: 19, scope: !181, inlinedAt: !203)
!215 = !DILocation(line: 540, column: 59, scope: !181, inlinedAt: !203)
!216 = !DILocalVariable(name: "mark", scope: !181, file: !7, line: 542, type: !75, align: 8)
!217 = !DILocation(line: 542, column: 6, scope: !181, inlinedAt: !203)
!218 = !DILocation(line: 542, column: 13, scope: !181, inlinedAt: !203)
!219 = !DILocation(line: 35, column: 11, scope: !220)
!220 = distinct !DILexicalBlock(scope: !174, file: !7, line: 34, column: 3)
!221 = !DILocation(line: 545, column: 17, scope: !222, inlinedAt: !203)
!222 = distinct !DILexicalBlock(scope: !181, file: !144, line: 544, column: 2)
!223 = !DILocation(line: 545, column: 3, scope: !222, inlinedAt: !203)
!224 = !DILocation(line: 547, column: 39, scope: !222, inlinedAt: !203)
!225 = !DILocation(line: 487, column: 8, scope: !226, inlinedAt: !149)
!226 = distinct !DILexicalBlock(scope: !143, file: !144, line: 487, column: 8)
!227 = !DILocation(line: 545, column: 17, scope: !228, inlinedAt: !203)
!228 = distinct !DILexicalBlock(scope: !181, file: !144, line: 544, column: 2)
!229 = !DILocation(line: 545, column: 3, scope: !228, inlinedAt: !203)
!230 = !DILocation(line: 547, column: 39, scope: !228, inlinedAt: !203)
!231 = !DILocation(line: 487, column: 8, scope: !232, inlinedAt: !149)
!232 = distinct !DILexicalBlock(scope: !143, file: !144, line: 487, column: 8)
!233 = distinct !DISubprogram(name: "temp_parse", linkageName: "std.encoding.json.temp_parse", scope: !7, file: !7, line: 40, type: !234, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !112)
!234 = !DISubroutineType(types: !235)
!235 = !{!52, !54, !15}
!236 = !DILocalVariable(name: "s", arg: 1, scope: !233, file: !7, line: 40, type: !15)
!237 = !DILocation(line: 40, column: 33, scope: !233)
!238 = !DILocation(line: 396, column: 7, scope: !239, inlinedAt: !240)
!239 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !129, file: !129, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!240 = !DILocation(line: 42, column: 29, scope: !233)
!241 = !DILocation(line: 398, column: 3, scope: !242, inlinedAt: !240)
!242 = distinct !DILexicalBlock(scope: !239, file: !129, line: 397, column: 2)
!243 = !DILocation(line: 400, column: 9, scope: !239, inlinedAt: !240)
!244 = !DILocation(line: 42, column: 9, scope: !233)
!245 = distinct !DISubprogram(name: "parse_from_token", linkageName: "std.encoding.json.parse_from_token", scope: !7, file: !7, line: 81, type: !246, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !112)
!246 = !DISubroutineType(types: !247)
!247 = !{!52, !54, !248, !9}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "JsonContext*", baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
