; ModuleID = 'std::collections::object'
source_filename = "std::collections::object"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%Object = type { i64, %any, %.anon }
%.anon = type { %HashMap }
%HashMap = type { %"Entry*[]", %any, i32, i32, float }
%"Entry*[]" = type { ptr, i64 }
%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%"char[][]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.collections.object.Object.to_format = comdat any

$std.collections.object.Object.free = comdat any

$std.collections.object.Object.is_null = comdat any

$std.collections.object.Object.is_empty = comdat any

$std.collections.object.Object.is_map = comdat any

$std.collections.object.Object.is_array = comdat any

$std.collections.object.Object.is_bool = comdat any

$std.collections.object.Object.is_string = comdat any

$std.collections.object.Object.is_float = comdat any

$std.collections.object.Object.is_int = comdat any

$std.collections.object.Object.is_keyable = comdat any

$std.collections.object.Object.is_indexable = comdat any

$std.collections.object.Object.set_object = comdat any

$std.collections.object.Object.get = comdat any

$std.collections.object.Object.has_key = comdat any

$std.collections.object.Object.get_at = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "TRUE_OBJECT", linkageName: "std.collections.object.TRUE_OBJECT", scope: !2, file: !2, line: 7, type: !3, isLocal: false, isDefinition: true, align: 8)
!2 = !DIFile(filename: "object.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/collections")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", scope: !2, file: !2, line: 11, size: 576, align: 64, elements: !4, identifier: "std.collections.object.Object")
!4 = !{!5, !7, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !3, file: !2, line: 13, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!7 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !3, file: !2, line: 14, baseType: !8, size: 128, align: 64, offset: 64)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !9, identifier: "Allocator")
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !8, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !8, baseType: !6, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, scope: !3, file: !2, line: 15, baseType: !14, size: 384, align: 64, offset: 192)
!14 = !DICompositeType(tag: DW_TAG_union_type, scope: !3, file: !2, line: 15, size: 384, align: 64, elements: !15)
!15 = !{!16, !18, !20, !22, !32, !33, !44}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !14, file: !2, line: 17, baseType: !17, size: 128, align: 64)
!17 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !14, file: !2, line: 18, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !14, file: !2, line: 19, baseType: !21, size: 8, align: 8)
!21 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !14, file: !2, line: 20, baseType: !23, size: 128, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !25, identifier: "char[]")
!25 = !{!26, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !24, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !24, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !31)
!31 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !14, file: !2, line: 21, baseType: !11, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !14, file: !2, line: 22, baseType: !34, size: 320, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalList", scope: !2, file: !2, line: 466, baseType: !35, align: 8)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 14, size: 320, align: 64, elements: !36, identifier: "std_collections_list$p$std.collections.object.Object$.List")
!36 = !{!37, !38, !39, !40}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !35, file: !2, line: 16, baseType: !30, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !35, file: !2, line: 17, baseType: !30, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !35, file: !2, line: 18, baseType: !8, size: 128, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !35, file: !2, line: 19, baseType: !41, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 466, baseType: !43, align: 8)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !14, file: !2, line: 23, baseType: !45, size: 384, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalMap", scope: !2, file: !2, line: 465, baseType: !46, align: 8)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !2, file: !2, line: 10, size: 384, align: 64, elements: !47, identifier: "std_collections_map$String$p$std.collections.object.Object$.HashMap")
!47 = !{!48, !64, !65, !66, !67}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !46, file: !2, line: 12, baseType: !49, size: 128, align: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !50, identifier: "Entry*[]")
!50 = !{!51, !63}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !49, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !2, file: !2, line: 499, size: 320, align: 64, elements: !55, identifier: "std_collections_map$String$p$std.collections.object.Object$.Entry")
!55 = !{!56, !58, !60, !62}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !54, file: !2, line: 501, baseType: !57, size: 32, align: 32)
!57 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !54, file: !2, line: 502, baseType: !59, size: 128, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !2, file: !2, line: 465, baseType: !23, align: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !54, file: !2, line: 503, baseType: !61, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !2, file: !2, line: 465, baseType: !43, align: 8)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !2, line: 504, baseType: !53, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, baseType: !30, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !46, file: !2, line: 13, baseType: !8, size: 128, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !46, file: !2, line: 14, baseType: !57, size: 32, align: 32, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !46, file: !2, line: 15, baseType: !57, size: 32, align: 32, offset: 288)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !46, file: !2, line: 16, baseType: !68, size: 32, align: 32, offset: 320)
!68 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "FALSE_OBJECT", linkageName: "std.collections.object.FALSE_OBJECT", scope: !2, file: !2, line: 8, type: !3, isLocal: false, isDefinition: true, align: 8)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "NULL_OBJECT", linkageName: "std.collections.object.NULL_OBJECT", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 8)
!73 = !{i32 4, !"PIE Level", i32 2}
!74 = !{i32 4, !"PIC Level", i32 2}
!75 = !{i32 2, !"Dwarf Version", i32 4}
!76 = !{i32 2, !"Debug Info Version", i32 3}
!77 = !{i32 2, !"frame-pointer", i32 2}
!78 = !{i32 1, !"uwtable", i32 2}
!79 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !80, splitDebugInlining: false)
!80 = !{!0, !69, !71}
!81 = distinct !DISubprogram(name: "to_format", linkageName: "std.collections.object.Object.to_format", scope: !2, file: !2, line: 28, type: !82, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !79, retainedNodes: !104)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !86, !43, !87}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !85)
!85 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !88, size: 64, align: 64, dwarfAddressSpace: 0)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 70, size: 384, align: 64, elements: !89, identifier: "std.io.Formatter")
!89 = !{!90, !91, !96}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !88, file: !2, line: 72, baseType: !11, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !88, file: !2, line: 73, baseType: !92, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 23, baseType: !93, align: 8)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !94, size: 64, align: 64, dwarfAddressSpace: 0)
!94 = !DISubroutineType(types: !95)
!95 = !{!84, !11, !11, !28}
!96 = !DIDerivedType(tag: DW_TAG_member, scope: !88, file: !2, line: 74, baseType: !97, size: 256, align: 64, offset: 128)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !88, file: !2, line: 74, size: 256, align: 64, elements: !98)
!98 = !{!99, !100, !101, !102, !103}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !97, file: !2, line: 76, baseType: !57, size: 32, align: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !97, file: !2, line: 77, baseType: !57, size: 32, align: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !97, file: !2, line: 78, baseType: !57, size: 32, align: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !97, file: !2, line: 79, baseType: !30, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !97, file: !2, line: 80, baseType: !84, size: 64, align: 64, offset: 192)
!104 = !{}
!105 = !DILocation(line: 29, column: 1, scope: !81)
!106 = !DILocalVariable(name: "self", arg: 1, scope: !81, file: !2, line: 28, type: !43)
!107 = !DILocation(line: 28, column: 26, scope: !81)
!108 = !DILocalVariable(name: "formatter", arg: 2, scope: !81, file: !2, line: 28, type: !87)
!109 = !DILocation(line: 28, column: 44, scope: !81)
!110 = !DILocation(line: 30, column: 10, scope: !111)
!111 = distinct !DILexicalBlock(scope: !81, file: !2, line: 30, column: 2)
!112 = !DILocation(line: 32, column: 8, scope: !111)
!113 = !DILocation(line: 33, column: 11, scope: !114)
!114 = distinct !DILexicalBlock(scope: !111, file: !2, line: 33, column: 4)
!115 = !DILocation(line: 34, column: 8, scope: !111)
!116 = !DILocation(line: 35, column: 11, scope: !117)
!117 = distinct !DILexicalBlock(scope: !111, file: !2, line: 35, column: 4)
!118 = !DILocation(line: 36, column: 8, scope: !111)
!119 = !DILocation(line: 37, column: 36, scope: !120)
!120 = distinct !DILexicalBlock(scope: !111, file: !2, line: 37, column: 4)
!121 = !DILocation(line: 37, column: 11, scope: !120)
!122 = !DILocation(line: 38, column: 8, scope: !111)
!123 = !DILocation(line: 39, column: 28, scope: !124)
!124 = distinct !DILexicalBlock(scope: !111, file: !2, line: 39, column: 4)
!125 = !DILocation(line: 39, column: 46, scope: !124)
!126 = !DILocation(line: 39, column: 11, scope: !124)
!127 = !DILocation(line: 40, column: 8, scope: !111)
!128 = !DILocalVariable(name: "n", scope: !129, file: !2, line: 41, type: !30, align: 8)
!129 = distinct !DILexicalBlock(scope: !111, file: !2, line: 41, column: 4)
!130 = !DILocation(line: 41, column: 8, scope: !129)
!131 = !DILocation(line: 41, column: 12, scope: !129)
!132 = !DILocalVariable(name: ".temp", scope: !133, file: !2, line: 42, type: !134, align: 8)
!133 = distinct !DILexicalBlock(scope: !129, file: !2, line: 42, column: 4)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ObjectInternalList*", baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!135 = !DILocation(line: 42, column: 21, scope: !133)
!136 = !DILocalVariable(name: ".temp", scope: !133, file: !2, line: 42, type: !30, align: 8)
!137 = !DILocation(line: 42, column: 13, scope: !133)
!138 = !DILocalVariable(name: "i", scope: !139, file: !2, line: 42, type: !30, align: 8)
!139 = distinct !DILexicalBlock(scope: !133, file: !2, line: 43, column: 4)
!140 = !DILocation(line: 42, column: 13, scope: !139)
!141 = !DILocalVariable(name: "ol", scope: !139, file: !2, line: 42, type: !42, align: 8)
!142 = !DILocation(line: 42, column: 16, scope: !139)
!143 = !DILocation(line: 42, column: 21, scope: !139)
!144 = !DILocation(line: 363, column: 9, scope: !145, inlinedAt: !142)
!145 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !146, file: !146, line: 361, scopeLine: 361, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !79)
!146 = !DIFile(filename: "list.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/collections")
!147 = !DILocation(line: 363, column: 22, scope: !145, inlinedAt: !142)
!148 = !DILocation(line: 44, column: 9, scope: !149)
!149 = distinct !DILexicalBlock(scope: !139, file: !2, line: 43, column: 4)
!150 = !DILocation(line: 44, column: 16, scope: !149)
!151 = !DILocation(line: 44, column: 21, scope: !149)
!152 = !DILocation(line: 45, column: 5, scope: !149)
!153 = !DILocation(line: 45, column: 10, scope: !149)
!154 = !DILocation(line: 47, column: 4, scope: !129)
!155 = !DILocation(line: 47, column: 9, scope: !129)
!156 = !DILocation(line: 48, column: 11, scope: !129)
!157 = !DILocation(line: 49, column: 8, scope: !111)
!158 = !DILocalVariable(name: "n", scope: !159, file: !2, line: 50, type: !30, align: 8)
!159 = distinct !DILexicalBlock(scope: !111, file: !2, line: 50, column: 4)
!160 = !DILocation(line: 50, column: 8, scope: !159)
!161 = !DILocation(line: 50, column: 12, scope: !159)
!162 = !DILocalVariable(name: "buffer", scope: !163, file: !2, line: 484, type: !165, align: 16)
!163 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !164, file: !164, line: 482, scopeLine: 482, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !79, retainedNodes: !104)
!164 = !DIFile(filename: "mem.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8192, align: 8, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 1024, lowerBound: 0)
!168 = !DILocation(line: 484, column: 14, scope: !163, inlinedAt: !169)
!169 = !DILocation(line: 51, column: 4, scope: !159)
!170 = !DILocalVariable(name: "allocator", scope: !163, file: !2, line: 485, type: !171, align: 8)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 3, size: 384, align: 64, elements: !172, identifier: "std.core.mem.allocator.OnStackAllocator")
!172 = !{!173, !174, !175, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !171, file: !2, line: 5, baseType: !8, size: 128, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !171, file: !2, line: 6, baseType: !24, size: 128, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !171, file: !2, line: 7, baseType: !30, size: 64, align: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !171, file: !2, line: 8, baseType: !177, size: 64, align: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !178, size: 64, align: 64, dwarfAddressSpace: 0)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 12, size: 192, align: 64, elements: !179, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk")
!179 = !{!180, !181, !182}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !178, file: !2, line: 14, baseType: !21, size: 8, align: 8)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !178, file: !2, line: 15, baseType: !177, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !178, file: !2, line: 16, baseType: !11, size: 64, align: 64, offset: 128)
!183 = !DILocation(line: 485, column: 19, scope: !163, inlinedAt: !169)
!184 = !DILocation(line: 486, column: 18, scope: !163, inlinedAt: !169)
!185 = !DILocation(line: 392, column: 27, scope: !186, inlinedAt: !188)
!186 = distinct !DISubprogram(name: "heap", linkageName: "heap", scope: !187, file: !187, line: 392, scopeLine: 392, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !79)
!187 = !DIFile(filename: "mem_allocator.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!188 = !DILocation(line: 486, column: 37, scope: !163, inlinedAt: !169)
!189 = !DILocation(line: 486, column: 2, scope: !163, inlinedAt: !169)
!190 = !DILocalVariable(name: "mem", scope: !159, file: !2, line: 51, type: !8, align: 8)
!191 = !DILocation(line: 51, column: 31, scope: !159)
!192 = !DILocation(line: 488, column: 9, scope: !193, inlinedAt: !169)
!193 = distinct !DILexicalBlock(scope: !163, file: !164, line: 488, column: 2)
!194 = !DILocalVariable(name: ".temp", scope: !195, file: !2, line: 53, type: !197, align: 8)
!195 = distinct !DILexicalBlock(scope: !196, file: !2, line: 53, column: 5)
!196 = distinct !DILexicalBlock(scope: !159, file: !2, line: 52, column: 4)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key[]", size: 128, align: 64, elements: !198, identifier: "Key[]")
!198 = !{!199, !201}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !197, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Key*", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !197, baseType: !30, size: 64, align: 64, offset: 64)
!202 = !DILocation(line: 53, column: 23, scope: !195)
!203 = !DILocation(line: 53, column: 42, scope: !195)
!204 = !DILocalVariable(name: ".temp", scope: !195, file: !2, line: 53, type: !30, align: 8)
!205 = !DILocation(line: 53, column: 14, scope: !195)
!206 = !DILocalVariable(name: "i", scope: !207, file: !2, line: 53, type: !30, align: 8)
!207 = distinct !DILexicalBlock(scope: !195, file: !2, line: 54, column: 5)
!208 = !DILocation(line: 53, column: 14, scope: !207)
!209 = !DILocalVariable(name: "key", scope: !207, file: !2, line: 53, type: !23, align: 8)
!210 = !DILocation(line: 53, column: 17, scope: !207)
!211 = !DILocation(line: 53, column: 23, scope: !207)
!212 = !DILocation(line: 55, column: 10, scope: !213)
!213 = distinct !DILexicalBlock(scope: !207, file: !2, line: 54, column: 5)
!214 = !DILocation(line: 55, column: 17, scope: !213)
!215 = !DILocation(line: 55, column: 22, scope: !213)
!216 = !DILocation(line: 487, column: 8, scope: !217, inlinedAt: !169)
!217 = distinct !DILexicalBlock(scope: !163, file: !164, line: 487, column: 8)
!218 = !DILocation(line: 56, column: 6, scope: !213)
!219 = !DILocation(line: 56, column: 37, scope: !213)
!220 = !DILocation(line: 56, column: 11, scope: !213)
!221 = !DILocation(line: 487, column: 8, scope: !222, inlinedAt: !169)
!222 = distinct !DILexicalBlock(scope: !163, file: !164, line: 487, column: 8)
!223 = !DILocation(line: 57, column: 6, scope: !213)
!224 = !DILocation(line: 57, column: 11, scope: !213)
!225 = !DILocation(line: 487, column: 8, scope: !226, inlinedAt: !169)
!226 = distinct !DILexicalBlock(scope: !163, file: !164, line: 487, column: 8)
!227 = !DILocation(line: 487, column: 8, scope: !228, inlinedAt: !169)
!228 = distinct !DILexicalBlock(scope: !163, file: !164, line: 487, column: 8)
!229 = !DILocation(line: 60, column: 4, scope: !159)
!230 = !DILocation(line: 60, column: 9, scope: !159)
!231 = !DILocation(line: 61, column: 11, scope: !159)
!232 = !DILocation(line: 63, column: 12, scope: !233)
!233 = distinct !DILexicalBlock(scope: !234, file: !2, line: 63, column: 4)
!234 = distinct !DILexicalBlock(scope: !111, file: !2, line: 63, column: 4)
!235 = !DILocation(line: 66, column: 44, scope: !236)
!236 = distinct !DILexicalBlock(scope: !233, file: !2, line: 66, column: 6)
!237 = !DILocation(line: 66, column: 13, scope: !236)
!238 = !DILocation(line: 68, column: 45, scope: !239)
!239 = distinct !DILexicalBlock(scope: !233, file: !2, line: 68, column: 6)
!240 = !DILocation(line: 68, column: 13, scope: !239)
!241 = !DILocation(line: 70, column: 36, scope: !242)
!242 = distinct !DILexicalBlock(scope: !233, file: !2, line: 70, column: 6)
!243 = !DILocation(line: 70, column: 13, scope: !242)
!244 = !DILocation(line: 72, column: 36, scope: !245)
!245 = distinct !DILexicalBlock(scope: !233, file: !2, line: 72, column: 6)
!246 = !DILocation(line: 72, column: 13, scope: !245)
!247 = !DILocation(line: 74, column: 13, scope: !248)
!248 = distinct !DILexicalBlock(scope: !233, file: !2, line: 74, column: 6)
!249 = distinct !DISubprogram(name: "free", linkageName: "std.collections.object.Object.free", scope: !2, file: !2, line: 115, type: !250, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !79, retainedNodes: !104)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !43}
!252 = !DILocation(line: 116, column: 1, scope: !249)
!253 = !DILocalVariable(name: "self", arg: 1, scope: !249, file: !2, line: 115, type: !43)
!254 = !DILocation(line: 115, column: 21, scope: !249)
!255 = !DILocation(line: 117, column: 10, scope: !256)
!256 = distinct !DILexicalBlock(scope: !249, file: !2, line: 117, column: 2)
!257 = !DILocation(line: 119, column: 8, scope: !256)
!258 = !DILocation(line: 120, column: 4, scope: !259)
!259 = distinct !DILexicalBlock(scope: !256, file: !2, line: 120, column: 4)
!260 = !DILocation(line: 121, column: 8, scope: !256)
