; ModuleID = 'std::core::runtime'
source_filename = "std::core::runtime"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"fn void!()[]" = type { ptr, i64 }
%"char[][]" = type { ptr, i64 }
%"BenchmarkUnit[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%BenchmarkUnit = type { %"char[]", ptr }
%"char[]" = type { ptr, i64 }
%"TestUnit[]" = type { ptr, i64 }
%TestUnit = type { %"char[]", ptr }
%TestContext = type { [25 x i64] }

$std.core.runtime.benchmark_collection_create = comdat any

$std.core.runtime.set_benchmark_warmup_iterations = comdat any

$std.core.runtime.set_benchmark_max_iterations = comdat any

$std.core.runtime.run_benchmarks = comdat any

$std.core.runtime.default_benchmark_runner = comdat any

$std.core.runtime.test_collection_create = comdat any

$std.core.runtime.cmp_test_unit = comdat any

$std.core.runtime.test_panic = comdat any

$std.core.runtime.run_tests = comdat any

$std.core.runtime.default_test_runner = comdat any

$.dyn_search = comdat any

$"$ct.std.core.runtime.AnyRaw" = comdat any

$"$ct.std.core.runtime.SliceRaw" = comdat any

$"$ct.std.core.runtime.BenchmarkUnit" = comdat any

$"$ct.std.core.runtime.TestUnit" = comdat any

$"$ct.std.core.runtime.TestContext" = comdat any

$std.core.runtime.DEFAULT_BENCHMARK_WARMUP_ITERATIONS = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "DEFAULT_BENCHMARK_WARMUP_ITERATIONS", linkageName: "std.core.runtime.DEFAULT_BENCHMARK_WARMUP_ITERATIONS", scope: !2, file: !2, line: 45, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "runtime.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "DEFAULT_BENCHMARK_MAX_ITERATIONS", linkageName: "std.core.runtime.DEFAULT_BENCHMARK_MAX_ITERATIONS", scope: !2, file: !2, line: 46, type: !3, isLocal: false, isDefinition: true, align: 4)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "benchmark_warmup_iterations", linkageName: "std.core.runtime.benchmark_warmup_iterations", scope: !2, file: !2, line: 48, type: !8, isLocal: true, isDefinition: true, align: 4)
!8 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "benchmark_max_iterations", linkageName: "std.core.runtime.benchmark_max_iterations", scope: !2, file: !2, line: 49, type: !8, isLocal: true, isDefinition: true, align: 4)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "test_context", linkageName: "std.core.runtime.test_context", scope: !2, file: !2, line: 182, type: !13, isLocal: true, isDefinition: true, align: 8)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestContext*", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestContext", scope: !2, file: !2, line: 163, size: 1600, align: 64, elements: !15, identifier: "std.core.runtime.TestContext")
!15 = !{!16}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !14, file: !2, line: 165, baseType: !17, size: 1600, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "JmpBuf", scope: !2, file: !2, line: 36, baseType: !18, align: 8)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1600, align: 64, elements: !20)
!19 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!20 = !{!21}
!21 = !DISubrange(count: 25, lowerBound: 0)
!22 = !{i32 4, !"PIE Level", i32 2}
!23 = !{i32 4, !"PIC Level", i32 2}
!24 = !{i32 2, !"Dwarf Version", i32 4}
!25 = !{i32 2, !"Debug Info Version", i32 3}
!26 = !{i32 2, !"frame-pointer", i32 2}
!27 = !{i32 1, !"uwtable", i32 2}
!28 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !29, splitDebugInlining: false)
!29 = !{!0, !4, !6, !9, !11}
!30 = distinct !DISubprogram(name: "benchmark_collection_create", linkageName: "std.core.runtime.benchmark_collection_create", scope: !2, file: !2, line: 33, type: !31, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!31 = !DISubroutineType(types: !32)
!32 = !{!33, !35, !57}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !34)
!34 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkUnit[]", size: 128, align: 64, elements: !36, identifier: "BenchmarkUnit[]")
!36 = !{!37, !56}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !35, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkUnit*", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkUnit", scope: !2, file: !2, line: 27, size: 192, align: 64, elements: !40, identifier: "std.core.runtime.BenchmarkUnit")
!40 = !{!41, !50}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !39, file: !2, line: 29, baseType: !42, size: 128, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !44, identifier: "char[]")
!44 = !{!45, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !43, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !47, size: 64, align: 64, dwarfAddressSpace: 0)
!47 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !43, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !19)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !39, file: !2, line: 30, baseType: !51, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "BenchmarkFn", scope: !2, file: !2, line: 25, baseType: !52, align: 8)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkFn", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DISubroutineType(types: !54)
!54 = !{!33, !55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !35, baseType: !49, size: 64, align: 64, offset: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !58, identifier: "Allocator")
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !57, baseType: !55, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !57, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!62 = !{}
!63 = !DILocalVariable(name: "allocator", arg: 1, scope: !30, file: !2, line: 33, type: !57)
!64 = !DILocation(line: 33, column: 58, scope: !30)
!65 = !DILocalVariable(name: "fns", scope: !30, file: !2, line: 35, type: !66, align: 8)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkFn[]", size: 128, align: 64, elements: !67, identifier: "BenchmarkFn[]")
!67 = !{!68, !70}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !66, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkFn*", baseType: !51, size: 64, align: 64, dwarfAddressSpace: 0)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !66, baseType: !49, size: 64, align: 64, offset: 64)
!71 = !DILocation(line: 35, column: 16, scope: !30)
!72 = !DILocation(line: 35, column: 22, scope: !30)
!73 = !DILocalVariable(name: "names", scope: !30, file: !2, line: 36, type: !74, align: 8)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !75, identifier: "String[]")
!75 = !{!76, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !74, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !74, baseType: !49, size: 64, align: 64, offset: 64)
!79 = !DILocation(line: 36, column: 11, scope: !30)
!80 = !DILocation(line: 36, column: 19, scope: !30)
!81 = !DILocalVariable(name: "benchmarks", scope: !30, file: !2, line: 37, type: !35, align: 8)
!82 = !DILocation(line: 37, column: 18, scope: !30)
!83 = !DILocation(line: 37, column: 80, scope: !30)
!84 = !DILocation(line: 286, column: 55, scope: !85, inlinedAt: !87)
!85 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !86, file: !86, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!86 = !DIFile(filename: "mem_allocator.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!87 = !DILocation(line: 269, column: 9, scope: !88, inlinedAt: !89)
!88 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !86, file: !86, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!89 = !DILocation(line: 37, column: 42, scope: !30)
!90 = !DILocation(line: 286, column: 40, scope: !85, inlinedAt: !87)
!91 = !DILocation(line: 62, column: 7, scope: !92, inlinedAt: !93)
!92 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !86, file: !86, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!93 = !DILocation(line: 286, column: 11, scope: !85, inlinedAt: !87)
!94 = !DILocation(line: 62, column: 20, scope: !92, inlinedAt: !93)
!95 = !DILocation(line: 28, column: 71, scope: !96, inlinedAt: !97)
!96 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !86, file: !86, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!97 = !DILocation(line: 68, column: 10, scope: !92, inlinedAt: !93)
!98 = !DILocation(line: 286, column: 67, scope: !85, inlinedAt: !87)
!99 = !DILocalVariable(name: ".temp", scope: !100, file: !2, line: 38, type: !49, align: 8)
!100 = distinct !DILexicalBlock(scope: !30, file: !2, line: 38, column: 2)
!101 = !DILocation(line: 38, column: 26, scope: !100)
!102 = !DILocation(line: 38, column: 11, scope: !100)
!103 = !DILocalVariable(name: "i", scope: !104, file: !2, line: 38, type: !49, align: 8)
!104 = distinct !DILexicalBlock(scope: !100, file: !2, line: 39, column: 2)
!105 = !DILocation(line: 38, column: 11, scope: !104)
!106 = !DILocalVariable(name: "benchmark", scope: !104, file: !2, line: 38, type: !52, align: 8)
!107 = !DILocation(line: 38, column: 14, scope: !104)
!108 = !DILocation(line: 38, column: 26, scope: !104)
!109 = !DILocation(line: 40, column: 3, scope: !110)
!110 = distinct !DILexicalBlock(scope: !104, file: !2, line: 39, column: 2)
!111 = !DILocation(line: 40, column: 14, scope: !110)
!112 = !DILocation(line: 40, column: 21, scope: !110)
!113 = !DILocation(line: 40, column: 27, scope: !110)
!114 = !DILocation(line: 40, column: 31, scope: !110)
!115 = !DILocation(line: 40, column: 35, scope: !110)
!116 = !DILocation(line: 42, column: 9, scope: !30)
!117 = distinct !DISubprogram(name: "set_benchmark_warmup_iterations", linkageName: "std.core.runtime.set_benchmark_warmup_iterations", scope: !2, file: !2, line: 51, type: !118, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !8}
!120 = !DILocalVariable(name: "value", arg: 1, scope: !117, file: !2, line: 51, type: !8)
!121 = !DILocation(line: 51, column: 46, scope: !117)
!122 = !DILocation(line: 53, column: 35, scope: !117)
!123 = distinct !DISubprogram(name: "set_benchmark_max_iterations", linkageName: "std.core.runtime.set_benchmark_max_iterations", scope: !2, file: !2, line: 56, type: !118, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!124 = !DILocalVariable(name: "value", arg: 1, scope: !123, file: !2, line: 56, type: !8)
!125 = !DILocation(line: 56, column: 43, scope: !123)
!126 = !DILocation(line: 58, column: 12, scope: !123)
!127 = !DILocation(line: 59, column: 32, scope: !123)
!128 = distinct !DISubprogram(name: "run_benchmarks", linkageName: "std.core.runtime.run_benchmarks", scope: !2, file: !2, line: 62, type: !129, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !35}
!131 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!132 = !DILocalVariable(name: "benchmarks", arg: 1, scope: !128, file: !2, line: 62, type: !35)
!133 = !DILocation(line: 62, column: 40, scope: !128)
!134 = !DILocalVariable(name: "benchmarks_passed", scope: !128, file: !2, line: 64, type: !3, align: 4)
!135 = !DILocation(line: 64, column: 6, scope: !128)
!136 = !DILocation(line: 64, column: 26, scope: !128)
!137 = !DILocalVariable(name: "benchmark_count", scope: !128, file: !2, line: 65, type: !3, align: 4)
!138 = !DILocation(line: 65, column: 6, scope: !128)
!139 = !DILocation(line: 65, column: 24, scope: !128)
!140 = !DILocalVariable(name: "max_name", scope: !128, file: !2, line: 66, type: !49, align: 8)
!141 = !DILocation(line: 66, column: 6, scope: !128)
!142 = !DILocalVariable(name: ".temp", scope: !143, file: !2, line: 68, type: !49, align: 8)
!143 = distinct !DILexicalBlock(scope: !128, file: !2, line: 68, column: 2)
!144 = !DILocation(line: 68, column: 19, scope: !143)
!145 = !DILocalVariable(name: "unit", scope: !146, file: !2, line: 68, type: !38, align: 8)
!146 = distinct !DILexicalBlock(scope: !143, file: !2, line: 69, column: 2)
!147 = !DILocation(line: 68, column: 12, scope: !146)
!148 = !DILocation(line: 68, column: 19, scope: !146)
!149 = !DILocation(line: 70, column: 7, scope: !150)
!150 = distinct !DILexicalBlock(scope: !146, file: !2, line: 69, column: 2)
!151 = !DILocation(line: 70, column: 18, scope: !150)
!152 = !DILocation(line: 70, column: 44, scope: !150)
!153 = !DILocalVariable(name: "len", scope: !128, file: !2, line: 73, type: !49, align: 8)
!154 = !DILocation(line: 73, column: 6, scope: !128)
!155 = !DILocation(line: 73, column: 12, scope: !128)
!156 = !DILocalVariable(name: "name", scope: !128, file: !2, line: 75, type: !157, align: 8)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 4, baseType: !55, align: 8)
!158 = !DILocation(line: 75, column: 10, scope: !128)
!159 = !DILocation(line: 75, column: 26, scope: !128)
!160 = !DILocation(line: 76, column: 26, scope: !128)
!161 = !DILocation(line: 76, column: 2, scope: !128)
!162 = !DILocation(line: 378, column: 22, scope: !163, inlinedAt: !165)
!163 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !164, file: !164, line: 368, scopeLine: 368, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!164 = !DIFile(filename: "dstring.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!165 = !DILocation(line: 77, column: 2, scope: !128)
!166 = !DILocation(line: 378, column: 4, scope: !163, inlinedAt: !165)
!167 = !DILocation(line: 78, column: 26, scope: !128)
!168 = !DILocation(line: 78, column: 32, scope: !128)
!169 = !DILocation(line: 78, column: 2, scope: !128)
!170 = !DILocation(line: 200, column: 20, scope: !171, inlinedAt: !173)
!171 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !172, file: !172, line: 198, scopeLine: 198, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!172 = !DIFile(filename: "io.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/io")
!173 = !DILocation(line: 80, column: 6, scope: !128)
!174 = !DILocalVariable(name: "len", scope: !175, file: !2, line: 174, type: !49, align: 8)
!175 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !172, file: !172, line: 172, scopeLine: 172, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !62)
!176 = !DILocation(line: 174, column: 6, scope: !175, inlinedAt: !177)
!177 = !DILocation(line: 200, column: 3, scope: !171, inlinedAt: !173)
!178 = !DILocation(line: 120, column: 35, scope: !179, inlinedAt: !180)
!179 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !172, file: !172, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!180 = !DILocation(line: 174, column: 12, scope: !175, inlinedAt: !177)
!181 = !DILocation(line: 120, column: 25, scope: !179, inlinedAt: !180)
!182 = !DILocation(line: 175, column: 17, scope: !175, inlinedAt: !177)
!183 = !DILocation(line: 175, column: 2, scope: !175, inlinedAt: !177)
!184 = !DILocation(line: 180, column: 4, scope: !175, inlinedAt: !177)
!185 = !DILocation(line: 182, column: 9, scope: !175, inlinedAt: !177)
!186 = !DILocation(line: 82, column: 2, scope: !128)
!187 = !DILocalVariable(name: "sys_clock_started", scope: !128, file: !2, line: 84, type: !34, align: 8)
!188 = !DILocation(line: 84, column: 7, scope: !128)
!189 = !DILocalVariable(name: "sys_clock_finished", scope: !128, file: !2, line: 85, type: !34, align: 8)
!190 = !DILocation(line: 85, column: 7, scope: !128)
!191 = !DILocalVariable(name: "sys_clocks", scope: !128, file: !2, line: 86, type: !34, align: 8)
!192 = !DILocation(line: 86, column: 7, scope: !128)
!193 = !DILocalVariable(name: "clock", scope: !128, file: !2, line: 87, type: !194, align: 8)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "Clock", scope: !2, file: !2, line: 6, baseType: !19, align: 8)
!195 = !DILocation(line: 87, column: 8, scope: !128)
!196 = !DILocalVariable(name: "err", scope: !128, file: !2, line: 88, type: !33, align: 8)
!197 = !DILocation(line: 88, column: 11, scope: !128)
!198 = !DILocalVariable(name: ".temp", scope: !199, file: !2, line: 90, type: !49, align: 8)
!199 = distinct !DILexicalBlock(scope: !128, file: !2, line: 90, column: 2)
!200 = !DILocation(line: 90, column: 17, scope: !199)
!201 = !DILocalVariable(name: "unit", scope: !202, file: !2, line: 90, type: !39, align: 8)
!202 = distinct !DILexicalBlock(scope: !199, file: !2, line: 91, column: 2)
!203 = !DILocation(line: 90, column: 10, scope: !202)
!204 = !DILocation(line: 90, column: 17, scope: !202)
!205 = !DILocation(line: 93, column: 36, scope: !206)
!206 = distinct !DILexicalBlock(scope: !202, file: !2, line: 91, column: 2)
!207 = !DILocation(line: 93, column: 3, scope: !206)
!208 = !DILocation(line: 94, column: 27, scope: !206)
!209 = !DILocation(line: 94, column: 38, scope: !206)
!210 = !DILocation(line: 94, column: 3, scope: !206)
!211 = !DILocation(line: 95, column: 21, scope: !206)
!212 = !DILocation(line: 95, column: 7, scope: !206)
!213 = !DILocalVariable(name: "i", scope: !214, file: !2, line: 97, type: !8, align: 4)
!214 = distinct !DILexicalBlock(scope: !206, file: !2, line: 97, column: 3)
!215 = !DILocation(line: 97, column: 13, scope: !214)
!216 = !DILocation(line: 97, column: 17, scope: !214)
!217 = !DILocation(line: 97, column: 20, scope: !214)
!218 = !DILocation(line: 97, column: 24, scope: !214)
!219 = !DILocalVariable(name: "f", scope: !220, file: !2, line: 330, type: !33, align: 8)
!220 = distinct !DISubprogram(name: "@catch", linkageName: "@catch", scope: !221, file: !221, line: 328, scopeLine: 328, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !62)
!221 = !DIFile(filename: "builtin.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!222 = !DILocation(line: 330, column: 12, scope: !220, inlinedAt: !223)
!223 = !DILocation(line: 99, column: 10, scope: !224)
!224 = distinct !DILexicalBlock(scope: !214, file: !2, line: 98, column: 3)
!225 = !DILocation(line: 99, column: 17, scope: !220, inlinedAt: !223)
!226 = !DILocation(line: 330, column: 16, scope: !220, inlinedAt: !223)
!227 = !DILocation(line: 330, column: 30, scope: !220, inlinedAt: !223)
!228 = !DILocation(line: 331, column: 9, scope: !220, inlinedAt: !223)
!229 = !DILocation(line: 192, column: 25, scope: !230, inlinedAt: !232)
!230 = distinct !DISubprogram(name: "@volatile_load", linkageName: "@volatile_load", scope: !231, file: !231, line: 190, scopeLine: 190, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!231 = !DIFile(filename: "mem.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!232 = !DILocation(line: 100, column: 4, scope: !224)
!233 = !DILocation(line: 97, column: 53, scope: !214)
!234 = !DILocation(line: 103, column: 29, scope: !206)
!235 = !DILocation(line: 104, column: 23, scope: !206)
!236 = !DILocalVariable(name: "i", scope: !237, file: !2, line: 106, type: !8, align: 4)
!237 = distinct !DILexicalBlock(scope: !206, file: !2, line: 106, column: 3)
!238 = !DILocation(line: 106, column: 13, scope: !237)
!239 = !DILocation(line: 106, column: 17, scope: !237)
!240 = !DILocation(line: 106, column: 20, scope: !237)
!241 = !DILocation(line: 106, column: 24, scope: !237)
!242 = !DILocalVariable(name: "f", scope: !243, file: !2, line: 330, type: !33, align: 8)
!243 = distinct !DISubprogram(name: "@catch", linkageName: "@catch", scope: !221, file: !221, line: 328, scopeLine: 328, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !62)
!244 = !DILocation(line: 330, column: 12, scope: !243, inlinedAt: !245)
!245 = !DILocation(line: 108, column: 10, scope: !246)
!246 = distinct !DILexicalBlock(scope: !237, file: !2, line: 107, column: 3)
!247 = !DILocation(line: 108, column: 17, scope: !243, inlinedAt: !245)
!248 = !DILocation(line: 330, column: 16, scope: !243, inlinedAt: !245)
!249 = !DILocation(line: 330, column: 30, scope: !243, inlinedAt: !245)
!250 = !DILocation(line: 331, column: 9, scope: !243, inlinedAt: !245)
!251 = !DILocation(line: 192, column: 25, scope: !252, inlinedAt: !253)
!252 = distinct !DISubprogram(name: "@volatile_load", linkageName: "@volatile_load", scope: !231, file: !231, line: 190, scopeLine: 190, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!253 = !DILocation(line: 109, column: 4, scope: !246)
!254 = !DILocation(line: 106, column: 50, scope: !237)
!255 = !DILocation(line: 112, column: 24, scope: !206)
!256 = !DILocalVariable(name: "nano_seconds", scope: !206, file: !2, line: 113, type: !257, align: 8)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "NanoDuration", scope: !2, file: !2, line: 7, baseType: !34, align: 8)
!258 = !DILocation(line: 113, column: 16, scope: !206)
!259 = !DILocation(line: 113, column: 31, scope: !206)
!260 = !DILocation(line: 114, column: 16, scope: !206)
!261 = !DILocation(line: 114, column: 37, scope: !206)
!262 = !DILocation(line: 116, column: 7, scope: !206)
!263 = !DILocation(line: 118, column: 46, scope: !264)
!264 = distinct !DILexicalBlock(scope: !206, file: !2, line: 117, column: 3)
!265 = !DILocation(line: 118, column: 8, scope: !264)
!266 = !DILocation(line: 92, column: 9, scope: !267)
!267 = distinct !DILexicalBlock(scope: !206, file: !2, line: 92, column: 9)
!268 = !DILocation(line: 122, column: 51, scope: !206)
!269 = !DILocation(line: 122, column: 72, scope: !206)
!270 = !DILocation(line: 122, column: 99, scope: !206)
!271 = !DILocation(line: 122, column: 118, scope: !206)
!272 = !DILocation(line: 122, column: 7, scope: !206)
!273 = !DILocation(line: 123, column: 3, scope: !206)
!274 = !DILocation(line: 92, column: 9, scope: !275)
!275 = distinct !DILexicalBlock(scope: !206, file: !2, line: 92, column: 9)
!276 = !DILocation(line: 126, column: 41, scope: !128)
!277 = !DILocation(line: 126, column: 58, scope: !128)
!278 = !DILocation(line: 126, column: 86, scope: !128)
!279 = !DILocation(line: 126, column: 6, scope: !128)
!280 = !DILocation(line: 128, column: 3, scope: !128)
!281 = !DILocation(line: 128, column: 23, scope: !128)
!282 = !DILocation(line: 128, column: 52, scope: !128)
!283 = !DILocation(line: 129, column: 3, scope: !128)
!284 = !DILocation(line: 130, column: 3, scope: !128)
!285 = !DILocation(line: 130, column: 21, scope: !128)
!286 = !DILocation(line: 127, column: 6, scope: !128)
!287 = !DILocation(line: 132, column: 9, scope: !128)
!288 = !DILocation(line: 132, column: 28, scope: !128)
!289 = distinct !DISubprogram(name: "default_benchmark_runner", linkageName: "std.core.runtime.default_benchmark_runner", scope: !2, file: !2, line: 135, type: !290, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28)
!290 = !DISubroutineType(types: !291)
!291 = !{!131}
!292 = !DILocalVariable(name: "current", scope: !293, file: !2, line: 536, type: !294, align: 8)
!293 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !231, file: !231, line: 534, scopeLine: 534, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !62)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !295, size: 64, align: 64, dwarfAddressSpace: 0)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !296, identifier: "std.core.mem.allocator.TempAllocator")
!296 = !{!297, !298, !311, !312, !313}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !295, file: !2, line: 12, baseType: !57, size: 128, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !295, file: !2, line: 13, baseType: !299, size: 64, align: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !300, size: 64, align: 64, dwarfAddressSpace: 0)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !301, identifier: "std.core.mem.allocator.TempAllocatorPage")
!301 = !{!302, !303, !304, !305, !306, !307}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !300, file: !2, line: 24, baseType: !299, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !300, file: !2, line: 25, baseType: !55, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !300, file: !2, line: 26, baseType: !49, size: 64, align: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !300, file: !2, line: 27, baseType: !49, size: 64, align: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !300, file: !2, line: 28, baseType: !49, size: 64, align: 64, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !300, file: !2, line: 29, baseType: !308, align: 8, offset: 320)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, align: 8, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 0, lowerBound: 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !295, file: !2, line: 14, baseType: !49, size: 64, align: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !295, file: !2, line: 15, baseType: !49, size: 64, align: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !295, file: !2, line: 16, baseType: !308, align: 8, offset: 320)
!314 = !DILocation(line: 536, column: 17, scope: !293, inlinedAt: !315)
!315 = !DILocation(line: 137, column: 2, scope: !289)
!316 = !DILocation(line: 396, column: 7, scope: !317, inlinedAt: !318)
!317 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !86, file: !86, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!318 = !DILocation(line: 536, column: 38, scope: !293, inlinedAt: !315)
!319 = !DILocation(line: 398, column: 3, scope: !320, inlinedAt: !318)
!320 = distinct !DILexicalBlock(scope: !317, file: !86, line: 397, column: 2)
!321 = !DILocation(line: 400, column: 9, scope: !317, inlinedAt: !318)
!322 = !DILocalVariable(name: "mark", scope: !293, file: !2, line: 542, type: !49, align: 8)
!323 = !DILocation(line: 542, column: 6, scope: !293, inlinedAt: !315)
!324 = !DILocation(line: 542, column: 13, scope: !293, inlinedAt: !315)
!325 = !DILocation(line: 396, column: 7, scope: !326, inlinedAt: !327)
!326 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !86, file: !86, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!327 = !DILocation(line: 139, column: 64, scope: !328)
!328 = distinct !DILexicalBlock(scope: !289, file: !2, line: 138, column: 2)
!329 = !DILocation(line: 398, column: 3, scope: !330, inlinedAt: !327)
!330 = distinct !DILexicalBlock(scope: !326, file: !86, line: 397, column: 2)
!331 = !DILocation(line: 400, column: 9, scope: !326, inlinedAt: !327)
!332 = !DILocation(line: 139, column: 25, scope: !328)
!333 = !DILocation(line: 139, column: 10, scope: !328)
!334 = !DILocation(line: 545, column: 17, scope: !335, inlinedAt: !315)
!335 = distinct !DILexicalBlock(scope: !293, file: !231, line: 544, column: 2)
!336 = !DILocation(line: 545, column: 3, scope: !335, inlinedAt: !315)
!337 = !DILocation(line: 549, column: 2, scope: !335, inlinedAt: !315)
!338 = distinct !DISubprogram(name: "test_collection_create", linkageName: "std.core.runtime.test_collection_create", scope: !2, file: !2, line: 151, type: !339, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!339 = !DISubroutineType(types: !340)
!340 = !{!33, !341, !57}
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestUnit[]", size: 128, align: 64, elements: !342, identifier: "TestUnit[]")
!342 = !{!343, !351}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !341, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestUnit*", baseType: !345, size: 64, align: 64, dwarfAddressSpace: 0)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestUnit", scope: !2, file: !2, line: 145, size: 192, align: 64, elements: !346, identifier: "std.core.runtime.TestUnit")
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !345, file: !2, line: 147, baseType: !42, size: 128, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !345, file: !2, line: 148, baseType: !349, size: 64, align: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "TestFn", scope: !2, file: !2, line: 143, baseType: !350, align: 8)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestFn", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !341, baseType: !49, size: 64, align: 64, offset: 64)
!352 = !DILocalVariable(name: "allocator", arg: 1, scope: !338, file: !2, line: 151, type: !57)
!353 = !DILocation(line: 151, column: 48, scope: !338)
!354 = !DILocalVariable(name: "fns", scope: !338, file: !2, line: 153, type: !355, align: 8)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestFn[]", size: 128, align: 64, elements: !356, identifier: "TestFn[]")
!356 = !{!357, !359}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !355, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestFn*", baseType: !349, size: 64, align: 64, dwarfAddressSpace: 0)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !355, baseType: !49, size: 64, align: 64, offset: 64)
!360 = !DILocation(line: 153, column: 11, scope: !338)
!361 = !DILocation(line: 153, column: 17, scope: !338)
!362 = !DILocalVariable(name: "names", scope: !338, file: !2, line: 154, type: !74, align: 8)
!363 = !DILocation(line: 154, column: 11, scope: !338)
!364 = !DILocation(line: 154, column: 19, scope: !338)
!365 = !DILocalVariable(name: "tests", scope: !338, file: !2, line: 155, type: !341, align: 8)
!366 = !DILocation(line: 155, column: 13, scope: !338)
!367 = !DILocation(line: 155, column: 65, scope: !338)
!368 = !DILocation(line: 286, column: 55, scope: !369, inlinedAt: !370)
!369 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !86, file: !86, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!370 = !DILocation(line: 269, column: 9, scope: !371, inlinedAt: !372)
!371 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !86, file: !86, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!372 = !DILocation(line: 155, column: 32, scope: !338)
!373 = !DILocation(line: 286, column: 40, scope: !369, inlinedAt: !370)
!374 = !DILocation(line: 62, column: 7, scope: !375, inlinedAt: !376)
!375 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !86, file: !86, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!376 = !DILocation(line: 286, column: 11, scope: !369, inlinedAt: !370)
!377 = !DILocation(line: 62, column: 20, scope: !375, inlinedAt: !376)
!378 = !DILocation(line: 28, column: 71, scope: !379, inlinedAt: !380)
!379 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !86, file: !86, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!380 = !DILocation(line: 68, column: 10, scope: !375, inlinedAt: !376)
!381 = !DILocation(line: 286, column: 67, scope: !369, inlinedAt: !370)
!382 = !DILocalVariable(name: ".temp", scope: !383, file: !2, line: 156, type: !49, align: 8)
!383 = distinct !DILexicalBlock(scope: !338, file: !2, line: 156, column: 2)
!384 = !DILocation(line: 156, column: 21, scope: !383)
!385 = !DILocation(line: 156, column: 11, scope: !383)
!386 = !DILocalVariable(name: "i", scope: !387, file: !2, line: 156, type: !49, align: 8)
!387 = distinct !DILexicalBlock(scope: !383, file: !2, line: 157, column: 2)
!388 = !DILocation(line: 156, column: 11, scope: !387)
!389 = !DILocalVariable(name: "test", scope: !387, file: !2, line: 156, type: !350, align: 8)
!390 = !DILocation(line: 156, column: 14, scope: !387)
!391 = !DILocation(line: 156, column: 21, scope: !387)
!392 = !DILocation(line: 158, column: 3, scope: !393)
!393 = distinct !DILexicalBlock(scope: !387, file: !2, line: 157, column: 2)
!394 = !DILocation(line: 158, column: 9, scope: !393)
!395 = !DILocation(line: 158, column: 16, scope: !393)
!396 = !DILocation(line: 158, column: 22, scope: !393)
!397 = !DILocation(line: 158, column: 26, scope: !393)
!398 = !DILocation(line: 158, column: 30, scope: !393)
!399 = !DILocation(line: 160, column: 9, scope: !338)
!400 = distinct !DISubprogram(name: "cmp_test_unit", linkageName: "std.core.runtime.cmp_test_unit", scope: !2, file: !2, line: 169, type: !401, scopeLine: 169, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!401 = !DISubroutineType(types: !402)
!402 = !{!3, !345, !345}
!403 = !DILocalVariable(name: "a", arg: 1, scope: !400, file: !2, line: 169, type: !345)
!404 = !DILocation(line: 169, column: 31, scope: !400)
!405 = !DILocalVariable(name: "b", arg: 2, scope: !400, file: !2, line: 169, type: !345)
!406 = !DILocation(line: 169, column: 43, scope: !400)
!407 = !DILocalVariable(name: "an", scope: !400, file: !2, line: 171, type: !49, align: 8)
!408 = !DILocation(line: 171, column: 6, scope: !400)
