; ModuleID = 'std::collections::anylist'
source_filename = "std::collections::anylist"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.collections.anylist.AnyList.new_init = comdat any

$std.collections.anylist.AnyList.init = comdat any

$std.collections.anylist.AnyList.temp_init = comdat any

$std.collections.anylist.AnyList.to_format = comdat any

$std.collections.anylist.AnyList.to_new_string = comdat any

$std.collections.anylist.AnyList.to_string = comdat any

$std.collections.anylist.AnyList.to_tstring = comdat any

$std.collections.anylist.AnyList.free_element = comdat any

$std.collections.anylist.AnyList.copy_pop = comdat any

$std.collections.anylist.AnyList.new_pop = comdat any

$std.collections.anylist.AnyList.temp_pop = comdat any

$std.collections.anylist.AnyList.tcopy_pop = comdat any

$std.collections.anylist.AnyList.pop_retained = comdat any

$std.collections.anylist.AnyList.clear = comdat any

$std.collections.anylist.AnyList.pop_first_retained = comdat any

$std.collections.anylist.AnyList.new_pop_first = comdat any

$std.collections.anylist.AnyList.copy_pop_first = comdat any

$std.collections.anylist.AnyList.tcopy_pop_first = comdat any


!0 = !{i32 4, !"PIE Level", i32 2}
!1 = !{i32 4, !"PIC Level", i32 2}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = !{i32 2, !"Debug Info Version", i32 3}
!4 = !{i32 2, !"frame-pointer", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!7 = !DIFile(filename: "anylist.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/collections")
!8 = distinct !DISubprogram(name: "new_init", linkageName: "std.collections.anylist.AnyList.new_init", scope: !7, file: !7, line: 24, type: !9, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !31)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !11, !16, !19}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "AnyList*", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnyList", scope: !7, file: !7, line: 10, size: 320, align: 64, elements: !13, identifier: "std.collections.anylist.AnyList")
!13 = !{!14, !17, !18, !25}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !12, file: !7, line: 12, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !16)
!16 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !12, file: !7, line: 13, baseType: !15, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !12, file: !7, line: 14, baseType: !19, size: 128, align: 64, offset: 128)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !20, identifier: "Allocator")
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !19, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !19, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !12, file: !7, line: 15, baseType: !26, size: 64, align: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !28, identifier: "any")
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, baseType: !22, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, baseType: !24, size: 64, align: 64, offset: 64)
!31 = !{}
!32 = !DILocation(line: 25, column: 1, scope: !8)
!33 = !DILocalVariable(name: "self", arg: 1, scope: !8, file: !7, line: 24, type: !11)
!34 = !DILocation(line: 24, column: 30, scope: !8)
!35 = !DILocalVariable(name: "initial_capacity", arg: 2, scope: !8, file: !7, line: 24, type: !15)
!36 = !DILocation(line: 24, column: 41, scope: !8)
!37 = !DILocalVariable(name: "allocator", arg: 3, scope: !8, file: !7, line: 24, type: !19)
!38 = !DILocation(line: 24, column: 74, scope: !8)
!39 = !DILocation(line: 26, column: 19, scope: !8)
!40 = !DILocation(line: 392, column: 27, scope: !41, inlinedAt: !43)
!41 = distinct !DISubprogram(name: "heap", linkageName: "heap", scope: !42, file: !42, line: 392, scopeLine: 392, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!42 = !DIFile(filename: "mem_allocator.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!43 = !DILocation(line: 26, column: 43, scope: !8)
!44 = !DILocation(line: 26, column: 51, scope: !8)
!45 = !DILocation(line: 26, column: 9, scope: !8)
!46 = distinct !DISubprogram(name: "init", linkageName: "std.collections.anylist.AnyList.init", scope: !7, file: !7, line: 33, type: !47, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !31)
!47 = !DISubroutineType(types: !48)
!48 = !{!11, !11, !19, !16}
!49 = !DILocation(line: 34, column: 1, scope: !46)
!50 = !DILocalVariable(name: "self", arg: 1, scope: !46, file: !7, line: 33, type: !11)
!51 = !DILocation(line: 33, column: 26, scope: !46)
!52 = !DILocalVariable(name: "allocator", arg: 2, scope: !46, file: !7, line: 33, type: !19)
!53 = !DILocation(line: 33, column: 43, scope: !46)
!54 = !DILocalVariable(name: "initial_capacity", arg: 3, scope: !46, file: !7, line: 33, type: !15)
!55 = !DILocation(line: 33, column: 58, scope: !46)
!56 = !DILocation(line: 35, column: 2, scope: !46)
!57 = !DILocation(line: 35, column: 19, scope: !46)
!58 = !DILocation(line: 36, column: 2, scope: !46)
!59 = !DILocation(line: 36, column: 14, scope: !46)
!60 = !DILocation(line: 37, column: 6, scope: !46)
!61 = !DILocalVariable(name: "y", scope: !62, file: !7, line: 1004, type: !15, align: 8)
!62 = distinct !DISubprogram(name: "next_power_of_2", linkageName: "next_power_of_2", scope: !63, file: !63, line: 1002, scopeLine: 1002, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !31)
!63 = !DIFile(filename: "math.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/math")
!64 = !DILocation(line: 1004, column: 13, scope: !62, inlinedAt: !65)
!65 = !DILocation(line: 39, column: 28, scope: !66)
!66 = distinct !DILexicalBlock(scope: !46, file: !7, line: 38, column: 2)
!67 = !DILocation(line: 1004, column: 17, scope: !62, inlinedAt: !65)
!68 = !DILocation(line: 1005, column: 2, scope: !62, inlinedAt: !65)
!69 = !DILocation(line: 1005, column: 9, scope: !70, inlinedAt: !65)
!70 = distinct !DILexicalBlock(scope: !62, file: !63, line: 1005, column: 2)
!71 = !DILocation(line: 1005, column: 13, scope: !70, inlinedAt: !65)
!72 = !DILocation(line: 1005, column: 16, scope: !70, inlinedAt: !65)
!73 = !DILocation(line: 1005, column: 21, scope: !70, inlinedAt: !65)
!74 = !DILocation(line: 1006, column: 9, scope: !62, inlinedAt: !65)
!75 = !DILocation(line: 40, column: 3, scope: !66)
!76 = !DILocation(line: 286, column: 55, scope: !77, inlinedAt: !78)
!77 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !42, file: !42, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!78 = !DILocation(line: 269, column: 9, scope: !79, inlinedAt: !80)
!79 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !42, file: !42, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!80 = !DILocation(line: 40, column: 29, scope: !66)
!81 = !DILocation(line: 286, column: 40, scope: !77, inlinedAt: !78)
!82 = !DILocation(line: 62, column: 7, scope: !83, inlinedAt: !84)
!83 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !42, file: !42, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!84 = !DILocation(line: 286, column: 11, scope: !77, inlinedAt: !78)
!85 = !DILocation(line: 62, column: 20, scope: !83, inlinedAt: !84)
!86 = !DILocation(line: 28, column: 71, scope: !87, inlinedAt: !88)
!87 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !42, file: !42, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!88 = !DILocation(line: 68, column: 10, scope: !83, inlinedAt: !84)
!89 = !DILocation(line: 286, column: 67, scope: !77, inlinedAt: !78)
!90 = !DILocation(line: 44, column: 3, scope: !91)
!91 = distinct !DILexicalBlock(scope: !46, file: !7, line: 43, column: 2)
!92 = !DILocation(line: 44, column: 18, scope: !91)
!93 = !DILocation(line: 46, column: 2, scope: !46)
!94 = !DILocation(line: 46, column: 18, scope: !46)
!95 = !DILocation(line: 47, column: 9, scope: !46)
!96 = distinct !DISubprogram(name: "temp_init", linkageName: "std.collections.anylist.AnyList.temp_init", scope: !7, file: !7, line: 55, type: !97, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !31)
!97 = !DISubroutineType(types: !98)
!98 = !{!11, !11, !16}
!99 = !DILocation(line: 56, column: 1, scope: !96)
!100 = !DILocalVariable(name: "self", arg: 1, scope: !96, file: !7, line: 55, type: !11)
!101 = !DILocation(line: 55, column: 31, scope: !96)
!102 = !DILocalVariable(name: "initial_capacity", arg: 2, scope: !96, file: !7, line: 55, type: !15)
!103 = !DILocation(line: 55, column: 42, scope: !96)
!104 = !DILocation(line: 396, column: 7, scope: !105, inlinedAt: !106)
!105 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !42, file: !42, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!106 = !DILocation(line: 57, column: 30, scope: !96)
!107 = !DILocation(line: 398, column: 3, scope: !108, inlinedAt: !106)
!108 = distinct !DILexicalBlock(scope: !105, file: !42, line: 397, column: 2)
!109 = !DILocation(line: 400, column: 9, scope: !105, inlinedAt: !106)
!110 = !DILocation(line: 57, column: 38, scope: !96)
!111 = !DILocation(line: 57, column: 9, scope: !96)
!112 = distinct !DISubprogram(name: "to_format", linkageName: "std.collections.anylist.AnyList.to_format", scope: !7, file: !7, line: 60, type: !113, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !31)
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !117, !11, !118}
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !116)
!116 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !119, size: 64, align: 64, dwarfAddressSpace: 0)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !7, file: !7, line: 70, size: 384, align: 64, elements: !120, identifier: "std.io.Formatter")
!120 = !{!121, !122, !128}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !119, file: !7, line: 72, baseType: !22, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !119, file: !7, line: 73, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !7, file: !7, line: 23, baseType: !124, align: 8)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !125, size: 64, align: 64, dwarfAddressSpace: 0)
!125 = !DISubroutineType(types: !126)
!126 = !{!115, !22, !22, !127}
!127 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!128 = !DIDerivedType(tag: DW_TAG_member, scope: !119, file: !7, line: 74, baseType: !129, size: 256, align: 64, offset: 128)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !119, file: !7, line: 74, size: 256, align: 64, elements: !130)
!130 = !{!131, !133, !134, !135, !136}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !129, file: !7, line: 76, baseType: !132, size: 32, align: 32)
!132 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !129, file: !7, line: 77, baseType: !132, size: 32, align: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !129, file: !7, line: 78, baseType: !132, size: 32, align: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !129, file: !7, line: 79, baseType: !15, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !129, file: !7, line: 80, baseType: !115, size: 64, align: 64, offset: 192)
!137 = !DILocation(line: 61, column: 1, scope: !112)
!138 = !DILocalVariable(name: "self", arg: 1, scope: !112, file: !7, line: 60, type: !11)
!139 = !DILocation(line: 60, column: 27, scope: !112)
!140 = !DILocalVariable(name: "formatter", arg: 2, scope: !112, file: !7, line: 60, type: !118)
!141 = !DILocation(line: 60, column: 45, scope: !112)
!142 = !DILocation(line: 62, column: 10, scope: !143)
!143 = distinct !DILexicalBlock(scope: !112, file: !7, line: 62, column: 2)
!144 = !DILocation(line: 65, column: 11, scope: !145)
!145 = distinct !DILexicalBlock(scope: !143, file: !7, line: 65, column: 4)
!146 = !DILocation(line: 67, column: 36, scope: !147)
!147 = distinct !DILexicalBlock(scope: !143, file: !7, line: 67, column: 4)
!148 = !DILocation(line: 67, column: 49, scope: !147)
!149 = !DILocation(line: 67, column: 11, scope: !147)
!150 = !DILocalVariable(name: "n", scope: !151, file: !7, line: 69, type: !15, align: 8)
!151 = distinct !DILexicalBlock(scope: !143, file: !7, line: 69, column: 4)
!152 = !DILocation(line: 69, column: 8, scope: !151)
!153 = !DILocation(line: 69, column: 12, scope: !151)
!154 = !DILocalVariable(name: ".temp", scope: !155, file: !7, line: 70, type: !156, align: 8)
!155 = distinct !DILexicalBlock(scope: !151, file: !7, line: 70, column: 4)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any[]*", baseType: !157, size: 64, align: 64, dwarfAddressSpace: 0)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !158, identifier: "any[]")
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !157, baseType: !26, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !157, baseType: !15, size: 64, align: 64, offset: 64)
!161 = !DILocation(line: 70, column: 26, scope: !155)
!162 = !DILocation(line: 70, column: 40, scope: !155)
!163 = !DILocalVariable(name: ".temp", scope: !155, file: !7, line: 70, type: !15, align: 8)
!164 = !DILocation(line: 70, column: 13, scope: !155)
!165 = !DILocalVariable(name: "i", scope: !166, file: !7, line: 70, type: !15, align: 8)
!166 = distinct !DILexicalBlock(scope: !155, file: !7, line: 71, column: 4)
!167 = !DILocation(line: 70, column: 13, scope: !166)
!168 = !DILocalVariable(name: "element", scope: !166, file: !7, line: 70, type: !27, align: 8)
!169 = !DILocation(line: 70, column: 16, scope: !166)
!170 = !DILocation(line: 70, column: 26, scope: !166)
!171 = !DILocation(line: 72, column: 9, scope: !172)
!172 = distinct !DILexicalBlock(scope: !166, file: !7, line: 71, column: 4)
!173 = !DILocation(line: 72, column: 17, scope: !172)
!174 = !DILocation(line: 73, column: 5, scope: !172)
!175 = !DILocation(line: 73, column: 33, scope: !172)
!176 = !DILocation(line: 73, column: 10, scope: !172)
!177 = !DILocation(line: 75, column: 4, scope: !151)
!178 = !DILocation(line: 75, column: 9, scope: !151)
!179 = !DILocation(line: 76, column: 11, scope: !151)
!180 = distinct !DISubprogram(name: "to_new_string", linkageName: "std.collections.anylist.AnyList.to_new_string", scope: !7, file: !7, line: 80, type: !181, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !31)
!181 = !DISubroutineType(types: !182)
!182 = !{!183, !11, !19}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !185, identifier: "char[]")
!185 = !{!186, !188}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !184, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !127, size: 64, align: 64, dwarfAddressSpace: 0)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !184, baseType: !15, size: 64, align: 64, offset: 64)
!189 = !DILocation(line: 81, column: 1, scope: !180)
!190 = !DILocalVariable(name: "self", arg: 1, scope: !180, file: !7, line: 80, type: !11)
!191 = !DILocation(line: 80, column: 33, scope: !180)
!192 = !DILocalVariable(name: "allocator", arg: 2, scope: !180, file: !7, line: 80, type: !19)
!193 = !DILocation(line: 80, column: 50, scope: !180)
!194 = !DILocation(line: 82, column: 31, scope: !180)
!195 = !DILocation(line: 82, column: 48, scope: !180)
!196 = !DILocation(line: 392, column: 27, scope: !197, inlinedAt: !198)
!197 = distinct !DISubprogram(name: "heap", linkageName: "heap", scope: !42, file: !42, line: 392, scopeLine: 392, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!198 = !DILocation(line: 82, column: 72, scope: !180)
!199 = !DILocation(line: 82, column: 17, scope: !180)
!200 = distinct !DISubprogram(name: "to_string", linkageName: "std.collections.anylist.AnyList.to_string", scope: !7, file: !7, line: 86, type: !181, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !31)
!201 = !DILocation(line: 87, column: 1, scope: !200)
!202 = !DILocalVariable(name: "self", arg: 1, scope: !200, file: !7, line: 86, type: !11)
!203 = !DILocation(line: 86, column: 29, scope: !200)
!204 = !DILocalVariable(name: "allocator", arg: 2, scope: !200, file: !7, line: 86, type: !19)
!205 = !DILocation(line: 86, column: 46, scope: !200)
!206 = !DILocation(line: 88, column: 31, scope: !200)
!207 = !DILocation(line: 88, column: 48, scope: !200)
!208 = !DILocation(line: 88, column: 17, scope: !200)
!209 = distinct !DISubprogram(name: "to_tstring", linkageName: "std.collections.anylist.AnyList.to_tstring", scope: !7, file: !7, line: 91, type: !210, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !31)
!210 = !DISubroutineType(types: !211)
!211 = !{!183, !11}
!212 = !DILocation(line: 91, column: 40, scope: !209)
!213 = !DILocalVariable(name: "self", arg: 1, scope: !209, file: !7, line: 91, type: !11)
!214 = !DILocation(line: 91, column: 30, scope: !209)
!215 = !DILocation(line: 91, column: 63, scope: !209)
!216 = !DILocation(line: 91, column: 48, scope: !209)
!217 = distinct !DISubprogram(name: "append_internal", linkageName: "std.collections.anylist.AnyList.append_internal", scope: !7, file: !7, line: 102, type: !218, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !31)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !11, !27}
!220 = !DILocation(line: 103, column: 1, scope: !217)
!221 = !DILocalVariable(name: "self", arg: 1, scope: !217, file: !7, line: 102, type: !11)
!222 = !DILocation(line: 102, column: 33, scope: !217)
!223 = !DILocalVariable(name: "element", arg: 2, scope: !217, file: !7, line: 102, type: !27)
!224 = !DILocation(line: 102, column: 44, scope: !217)
!225 = !DILocation(line: 494, column: 52, scope: !226, inlinedAt: !227)
!226 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !7, file: !7, line: 494, scopeLine: 494, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!227 = !DILocation(line: 104, column: 2, scope: !217)
!228 = !DILocation(line: 105, column: 2, scope: !217)
!229 = !DILocation(line: 105, column: 15, scope: !217)
!230 = !DILocation(line: 105, column: 30, scope: !217)
!231 = distinct !DISubprogram(name: "free_element", linkageName: "std.collections.anylist.AnyList.free_element", scope: !7, file: !7, line: 111, type: !218, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !31)
!232 = !DILocation(line: 112, column: 1, scope: !231)
!233 = !DILocalVariable(name: "self", arg: 1, scope: !231, file: !7, line: 111, type: !11)
!234 = !DILocation(line: 111, column: 30, scope: !231)
