; ModuleID = 'std::math::uuid'
source_filename = "std::math::uuid"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"char[]" = type { ptr, i64 }

$std.math.uuid.Uuid.to_format = comdat any

$std.math.uuid.Uuid.to_string = comdat any

$std.math.uuid.generate = comdat any

$std.math.uuid.generate_from_random = comdat any

$.dyn_search = comdat any

$"$ct.std.math.uuid.Uuid" = comdat any

$"$ct.a16$char" = comdat any

$"$ct.char" = comdat any

$"$ct.std.math.random.Sfc64Random" = comdat any

$"$ct.a4$ulong" = comdat any

$"$ct.ulong" = comdat any

$"$sel.next_bytes" = comdat any

$"$sel.to_format" = comdat any

$"$sel.to_string" = comdat any

@"$ct.std.math.uuid.Uuid" = linkonce global %.introspect { i8 18, i64 0, ptr null, i64 16, i64 ptrtoint (ptr @"$ct.a16$char" to i64), i64 0, [0 x i64] zeroinitializer }, comdat, align 8
@"$ct.a16$char" = linkonce global %.introspect { i8 15, i64 0, ptr null, i64 16, i64 ptrtoint (ptr @"$ct.char" to i64), i64 16, [0 x i64] zeroinitializer }, comdat, align 8
@"$ct.char" = linkonce global %.introspect { i8 3, i64 0, ptr null, i64 1, i64 0, i64 0, [0 x i64] zeroinitializer }, comdat, align 8
@std.math.random.default_random_initialized = extern_weak thread_local global i8, align 1
@std.math.random.default_random = extern_weak thread_local global [4 x i64], align 16

!0 = !{i32 4, !"PIE Level", i32 2}
!1 = !{i32 4, !"PIC Level", i32 2}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = !{i32 2, !"Debug Info Version", i32 3}
!4 = !{i32 2, !"frame-pointer", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!7 = !DIFile(filename: "uuid.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/math")
!8 = distinct !DISubprogram(name: "to_format", linkageName: "std.math.uuid.Uuid.to_format", scope: !7, file: !7, line: 28, type: !9, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !13, !16, !22}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !12)
!12 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !15)
!15 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Uuid*", baseType: !17, size: 64, align: 64, dwarfAddressSpace: 0)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uuid", scope: !7, file: !7, line: 5, baseType: !18, align: 1)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 128, align: 8, elements: !20)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !{!21}
!21 = !DISubrange(count: 16, lowerBound: 0)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !7, file: !7, line: 70, size: 384, align: 64, elements: !24, identifier: "std.io.Formatter")
!24 = !{!25, !27, !32}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !23, file: !7, line: 72, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !23, file: !7, line: 73, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !7, file: !7, line: 23, baseType: !29, align: 8)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!30 = !DISubroutineType(types: !31)
!31 = !{!11, !26, !26, !19}
!32 = !DIDerivedType(tag: DW_TAG_member, scope: !23, file: !7, line: 74, baseType: !33, size: 256, align: 64, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !23, file: !7, line: 74, size: 256, align: 64, elements: !34)
!34 = !{!35, !37, !38, !39, !40}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !33, file: !7, line: 76, baseType: !36, size: 32, align: 32)
!36 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !33, file: !7, line: 77, baseType: !36, size: 32, align: 32, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !33, file: !7, line: 78, baseType: !36, size: 32, align: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !33, file: !7, line: 79, baseType: !14, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !33, file: !7, line: 80, baseType: !11, size: 64, align: 64, offset: 192)
!41 = !{}
!42 = !DILocation(line: 29, column: 1, scope: !8)
!43 = !DILocalVariable(name: "self", arg: 1, scope: !8, file: !7, line: 28, type: !16)
!44 = !DILocation(line: 28, column: 24, scope: !8)
!45 = !DILocalVariable(name: "formatter", arg: 2, scope: !8, file: !7, line: 28, type: !22)
!46 = !DILocation(line: 28, column: 42, scope: !8)
!47 = !DILocation(line: 31, column: 5, scope: !8)
!48 = !DILocation(line: 31, column: 11, scope: !8)
!49 = !DILocation(line: 31, column: 17, scope: !8)
!50 = !DILocation(line: 31, column: 23, scope: !8)
!51 = !DILocation(line: 31, column: 29, scope: !8)
!52 = !DILocation(line: 31, column: 35, scope: !8)
!53 = !DILocation(line: 31, column: 41, scope: !8)
!54 = !DILocation(line: 31, column: 47, scope: !8)
!55 = !DILocation(line: 32, column: 5, scope: !8)
!56 = !DILocation(line: 32, column: 11, scope: !8)
!57 = !DILocation(line: 32, column: 17, scope: !8)
!58 = !DILocation(line: 32, column: 23, scope: !8)
!59 = !DILocation(line: 33, column: 5, scope: !8)
!60 = !DILocation(line: 33, column: 11, scope: !8)
!61 = !DILocation(line: 33, column: 17, scope: !8)
!62 = !DILocation(line: 33, column: 23, scope: !8)
!63 = !DILocation(line: 34, column: 5, scope: !8)
!64 = !DILocation(line: 34, column: 11, scope: !8)
!65 = !DILocation(line: 34, column: 17, scope: !8)
!66 = !DILocation(line: 34, column: 23, scope: !8)
!67 = !DILocation(line: 35, column: 5, scope: !8)
!68 = !DILocation(line: 35, column: 11, scope: !8)
!69 = !DILocation(line: 35, column: 18, scope: !8)
!70 = !DILocation(line: 35, column: 24, scope: !8)
!71 = !DILocation(line: 35, column: 31, scope: !8)
!72 = !DILocation(line: 35, column: 37, scope: !8)
!73 = !DILocation(line: 35, column: 44, scope: !8)
!74 = !DILocation(line: 35, column: 50, scope: !8)
!75 = !DILocation(line: 35, column: 57, scope: !8)
!76 = !DILocation(line: 35, column: 63, scope: !8)
!77 = !DILocation(line: 35, column: 70, scope: !8)
!78 = !DILocation(line: 35, column: 76, scope: !8)
!79 = !DILocation(line: 30, column: 9, scope: !8)
!80 = distinct !DISubprogram(name: "to_string", linkageName: "std.math.uuid.Uuid.to_string", scope: !7, file: !7, line: 38, type: !81, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !16, !89}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !84)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !85, identifier: "char[]")
!85 = !{!86, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !84, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !84, baseType: !14, size: 64, align: 64, offset: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !90, identifier: "Allocator")
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !89, baseType: !26, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !89, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!94 = !DILocation(line: 39, column: 1, scope: !80)
!95 = !DILocalVariable(name: "self", arg: 1, scope: !80, file: !7, line: 38, type: !16)
!96 = !DILocation(line: 38, column: 26, scope: !80)
!97 = !DILocalVariable(name: "allocator", arg: 2, scope: !80, file: !7, line: 38, type: !89)
!98 = !DILocation(line: 38, column: 43, scope: !80)
!99 = !DILocation(line: 40, column: 35, scope: !80)
!100 = !DILocation(line: 40, column: 52, scope: !80)
!101 = !DILocation(line: 40, column: 17, scope: !80)
!102 = distinct !DISubprogram(name: "generate", linkageName: "std.math.uuid.generate", scope: !7, file: !7, line: 10, type: !103, scopeLine: 10, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6)
!103 = !DISubroutineType(types: !104)
!104 = !{!17}
!105 = !DILocation(line: 179, column: 7, scope: !106, inlinedAt: !108)
!106 = distinct !DISubprogram(name: "init_default_random", linkageName: "init_default_random", scope: !107, file: !107, line: 177, scopeLine: 177, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!107 = !DIFile(filename: "math_random.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/math")
!108 = !DILocation(line: 12, column: 10, scope: !102)
!109 = !DILocation(line: 136, column: 33, scope: !110, inlinedAt: !111)
!110 = distinct !DISubprogram(name: "is_random", linkageName: "is_random", scope: !107, file: !107, line: 136, scopeLine: 136, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!111 = !DILocation(line: 24, column: 11, scope: !112, inlinedAt: !114)
!112 = distinct !DILexicalBlock(scope: !113, file: !107, line: 27, column: 1)
!113 = distinct !DISubprogram(name: "seed_entropy", linkageName: "seed_entropy", scope: !107, file: !107, line: 26, scopeLine: 26, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!114 = !DILocation(line: 181, column: 3, scope: !115, inlinedAt: !108)
!115 = distinct !DILexicalBlock(scope: !106, file: !107, line: 180, column: 2)
!116 = !DILocation(line: 28, column: 20, scope: !113, inlinedAt: !114)
!117 = !DILocation(line: 28, column: 2, scope: !113, inlinedAt: !114)
!118 = !DILocation(line: 182, column: 32, scope: !115, inlinedAt: !108)
!119 = !DILocation(line: 13, column: 9, scope: !102)
!120 = distinct !DISubprogram(name: "generate_from_random", linkageName: "std.math.uuid.generate_from_random", scope: !7, file: !7, line: 19, type: !121, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!121 = !DISubroutineType(types: !122)
!122 = !{!17, !123}
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "Random", size: 128, align: 64, elements: !124, identifier: "Random")
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !123, baseType: !26, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !123, baseType: !93, size: 64, align: 64, offset: 64)
!127 = !DILocalVariable(name: "random", arg: 1, scope: !120, file: !7, line: 19, type: !123)
!128 = !DILocation(line: 19, column: 37, scope: !120)
!129 = !DILocalVariable(name: "uuid", scope: !120, file: !7, line: 21, type: !17, align: 16)
!130 = !DILocation(line: 21, column: 7, scope: !120)
!131 = !DILocation(line: 22, column: 22, scope: !120)
!132 = !DILocation(line: 22, column: 2, scope: !120)
!133 = !DILocation(line: 23, column: 7, scope: !120)
!134 = !DILocation(line: 23, column: 18, scope: !120)
!135 = !DILocation(line: 23, column: 13, scope: !120)
!136 = !DILocation(line: 24, column: 7, scope: !120)
!137 = !DILocation(line: 24, column: 18, scope: !120)
!138 = !DILocation(line: 24, column: 13, scope: !120)
!139 = !DILocation(line: 25, column: 9, scope: !120)
