; ModuleID = 'std::io::os'
source_filename = "std::io::os"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%.fault = type { i64, %"char[]", i64 }
%"any[]" = type { ptr, i64 }
%PathImp = type { %"char[]", i32 }
%Stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, [3 x i64] }
%File = type { ptr }
%List = type { i64, i64, %any, ptr }

$std.io.os.native_temp_directory = comdat any

$std.io.os.native_file_or_dir_exists = comdat any

$std.io.os.native_is_file = comdat any

$std.io.os.native_is_dir = comdat any

$std.io.os.native_stat = comdat any

$std.io.os.native_file_size = comdat any

$std.io.os.native_rmtree = comdat any

$std.io.os.native_fopen = comdat any

$std.io.os.native_remove = comdat any

$std.io.os.native_freopen = comdat any

$std.io.os.native_fseek = comdat any

$std.io.os.native_ftell = comdat any

$std.io.os.native_fwrite = comdat any

$std.io.os.native_fputc = comdat any

$std.io.os.native_fread = comdat any

$std.io.os.native_ls = comdat any

$"$ct.ulong" = comdat any

$"std.io.IoError$ALREADY_EXISTS" = comdat any

$"std.io.IoError$BUSY" = comdat any

$"std.io.IoError$CANNOT_READ_DIR" = comdat any

$"std.io.IoError$DIR_NOT_EMPTY" = comdat any

$"std.io.IoError$EOF" = comdat any


!0 = !{i32 4, !"PIE Level", i32 2}
!1 = !{i32 4, !"PIC Level", i32 2}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = !{i32 2, !"Debug Info Version", i32 3}
!4 = !{i32 2, !"frame-pointer", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "temp_directory.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/io/os")
!8 = !{!9, !27}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !10, file: !7, line: 26, baseType: !23, size: 32, align: 32, elements: !24)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !7, file: !7, line: 20, size: 192, align: 64, elements: !11, identifier: "std.io.path.PathImp")
!11 = !{!12, !22}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !10, file: !7, line: 22, baseType: !13, size: 128, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !15, identifier: "char[]")
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !14, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !14, baseType: !20, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !21)
!21 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !10, file: !7, line: 23, baseType: !9, size: 32, align: 32, offset: 128)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !{!25, !26}
!25 = !DIEnumerator(name: "WIN32", value: 0)
!26 = !DIEnumerator(name: "POSIX", value: 1)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Seek", scope: !28, file: !28, line: 7, baseType: !23, size: 32, align: 32, elements: !29)
!28 = !DIFile(filename: "file_libc.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/io/os")
!29 = !{!30, !31, !32}
!30 = !DIEnumerator(name: "SET", value: 0)
!31 = !DIEnumerator(name: "CURSOR", value: 1)
!32 = !DIEnumerator(name: "END", value: 2)
!33 = distinct !DISubprogram(name: "native_temp_directory", linkageName: "std.io.os.native_temp_directory", scope: !7, file: !7, line: 4, type: !34, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !38, !40}
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !37)
!37 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Path*", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "Path", scope: !7, file: !7, line: 18, baseType: !10, align: 8)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !41, identifier: "Allocator")
!41 = !{!42, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !40, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, baseType: !45, size: 64, align: 64, offset: 64)
!45 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!46 = !{}
!47 = !DILocalVariable(name: "allocator", arg: 1, scope: !33, file: !7, line: 4, type: !40)
!48 = !DILocation(line: 4, column: 42, scope: !33)
!49 = !DILocalVariable(name: ".temp", scope: !50, file: !7, line: 6, type: !51, align: 16)
!50 = distinct !DILexicalBlock(scope: !33, file: !7, line: 6, column: 2)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 512, align: 64, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 4, lowerBound: 0)
!54 = !DILocation(line: 6, column: 24, scope: !50)
!55 = !DILocation(line: 6, column: 51, scope: !50)
!56 = !DILocalVariable(name: ".temp", scope: !50, file: !7, line: 6, type: !20, align: 8)
!57 = !DILocalVariable(name: "env", scope: !58, file: !7, line: 6, type: !13, align: 8)
!58 = distinct !DILexicalBlock(scope: !50, file: !7, line: 7, column: 2)
!59 = !DILocation(line: 6, column: 18, scope: !58)
!60 = !DILocation(line: 6, column: 24, scope: !58)
!61 = !DILocalVariable(name: "tmpdir", scope: !62, file: !7, line: 8, type: !13, align: 8)
!62 = distinct !DILexicalBlock(scope: !58, file: !7, line: 7, column: 2)
!63 = !DILocation(line: 8, column: 10, scope: !62)
!64 = !DILocation(line: 8, column: 24, scope: !62)
!65 = !DILocation(line: 8, column: 40, scope: !62)
!66 = !DILocation(line: 9, column: 7, scope: !62)
!67 = !DILocation(line: 9, column: 28, scope: !62)
!68 = !DILocation(line: 11, column: 15, scope: !33)
!69 = distinct !DISubprogram(name: "native_file_or_dir_exists", linkageName: "std.io.os.native_file_or_dir_exists", scope: !70, file: !70, line: 70, type: !71, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!70 = !DIFile(filename: "fileinfo.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/io/os")
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !13}
!73 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!74 = !DILocalVariable(name: "path", arg: 1, scope: !69, file: !70, line: 70, type: !13)
!75 = !DILocation(line: 70, column: 42, scope: !69)
!76 = !DILocalVariable(name: "stat", scope: !69, file: !70, line: 78, type: !77, align: 8)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stat", scope: !70, file: !70, line: 14, size: 1152, align: 64, elements: !78, identifier: "libc.Stat")
!78 = !{!79, !81, !83, !85, !88, !90, !92, !94, !95, !97, !99, !101, !103, !104, !105, !106, !107, !108}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !77, file: !70, line: 16, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "Dev_t", scope: !70, file: !70, line: 9, baseType: !21, align: 8)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !77, file: !70, line: 17, baseType: !82, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ino_t", scope: !70, file: !70, line: 8, baseType: !21, align: 8)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !77, file: !70, line: 18, baseType: !84, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nlink_t", scope: !70, file: !70, line: 6, baseType: !21, align: 8)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !77, file: !70, line: 19, baseType: !86, size: 32, align: 32, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mode_t", scope: !70, file: !70, line: 10, baseType: !87, align: 4)
!87 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !77, file: !70, line: 20, baseType: !89, size: 32, align: 32, offset: 224)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uid_t", scope: !70, file: !70, line: 17, baseType: !87, align: 4)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !77, file: !70, line: 21, baseType: !91, size: 32, align: 32, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gid_t", scope: !70, file: !70, line: 18, baseType: !87, align: 4)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !77, file: !70, line: 22, baseType: !93, size: 32, align: 32, offset: 288)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !70, file: !70, line: 21, baseType: !23, align: 4)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !77, file: !70, line: 23, baseType: !80, size: 64, align: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !77, file: !70, line: 24, baseType: !96, size: 64, align: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "Off_t", scope: !70, file: !70, line: 64, baseType: !21, align: 8)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !77, file: !70, line: 25, baseType: !98, size: 64, align: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "Blksize_t", scope: !70, file: !70, line: 5, baseType: !37, align: 8)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !77, file: !70, line: 26, baseType: !100, size: 64, align: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "Blkcnt_t", scope: !70, file: !70, line: 7, baseType: !37, align: 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "st_atime", scope: !77, file: !70, line: 27, baseType: !102, size: 64, align: 64, offset: 576)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time_t", scope: !70, file: !70, line: 63, baseType: !37, align: 8)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "st_atime_nsec", scope: !77, file: !70, line: 28, baseType: !37, size: 64, align: 64, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtime", scope: !77, file: !70, line: 29, baseType: !102, size: 64, align: 64, offset: 704)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtime_nsec", scope: !77, file: !70, line: 30, baseType: !37, size: 64, align: 64, offset: 768)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctime", scope: !77, file: !70, line: 31, baseType: !102, size: 64, align: 64, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctime_nsec", scope: !77, file: !70, line: 32, baseType: !37, size: 64, align: 64, offset: 896)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !77, file: !70, line: 33, baseType: !109, size: 192, align: 64, offset: 960)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 192, align: 64, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 3, lowerBound: 0)
!112 = !DILocation(line: 78, column: 9, scope: !69)
!113 = !DILocation(line: 79, column: 34, scope: !114, inlinedAt: !116)
!114 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !115, file: !115, line: 334, scopeLine: 334, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!115 = !DIFile(filename: "builtin.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!116 = !DILocation(line: 79, column: 11, scope: !69)
!117 = !DILocation(line: 336, column: 12, scope: !114, inlinedAt: !116)
!118 = !DILocation(line: 336, column: 26, scope: !114, inlinedAt: !116)
!119 = !DILocation(line: 337, column: 9, scope: !114, inlinedAt: !116)
!120 = distinct !DISubprogram(name: "native_is_file", linkageName: "std.io.os.native_is_file", scope: !70, file: !70, line: 95, type: !71, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!121 = !DILocalVariable(name: "path", arg: 1, scope: !120, file: !70, line: 95, type: !13)
!122 = !DILocation(line: 95, column: 31, scope: !120)
!123 = !DILocalVariable(name: "stat", scope: !120, file: !70, line: 103, type: !77, align: 8)
!124 = !DILocation(line: 103, column: 9, scope: !120)
!125 = !DILocation(line: 104, column: 34, scope: !126, inlinedAt: !127)
!126 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !115, file: !115, line: 334, scopeLine: 334, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!127 = !DILocation(line: 104, column: 11, scope: !120)
!128 = !DILocation(line: 336, column: 12, scope: !126, inlinedAt: !127)
!129 = !DILocation(line: 336, column: 26, scope: !126, inlinedAt: !127)
!130 = !DILocation(line: 337, column: 9, scope: !126, inlinedAt: !127)
!131 = !DILocation(line: 104, column: 58, scope: !120)
!132 = !DILocation(line: 378, column: 52, scope: !133, inlinedAt: !135)
!133 = distinct !DISubprogram(name: "libc_S_ISTYPE", linkageName: "libc_S_ISTYPE", scope: !134, file: !134, line: 378, scopeLine: 378, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!134 = !DIFile(filename: "libc.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/libc")
!135 = !DILocation(line: 104, column: 44, scope: !120)
!136 = !DILocation(line: 378, column: 71, scope: !133, inlinedAt: !135)
!137 = distinct !DISubprogram(name: "native_is_dir", linkageName: "std.io.os.native_is_dir", scope: !70, file: !70, line: 112, type: !71, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!138 = !DILocalVariable(name: "path", arg: 1, scope: !137, file: !70, line: 112, type: !13)
!139 = !DILocation(line: 112, column: 30, scope: !137)
!140 = !DILocalVariable(name: "stat", scope: !137, file: !70, line: 115, type: !77, align: 8)
!141 = !DILocation(line: 115, column: 8, scope: !137)
!142 = !DILocation(line: 116, column: 33, scope: !143, inlinedAt: !144)
!143 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !115, file: !115, line: 334, scopeLine: 334, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!144 = !DILocation(line: 116, column: 10, scope: !137)
!145 = !DILocation(line: 336, column: 12, scope: !143, inlinedAt: !144)
!146 = !DILocation(line: 336, column: 26, scope: !143, inlinedAt: !144)
!147 = !DILocation(line: 337, column: 9, scope: !143, inlinedAt: !144)
!148 = !DILocation(line: 116, column: 57, scope: !137)
!149 = !DILocation(line: 378, column: 52, scope: !150, inlinedAt: !151)
!150 = distinct !DISubprogram(name: "libc_S_ISTYPE", linkageName: "libc_S_ISTYPE", scope: !134, file: !134, line: 378, scopeLine: 378, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!151 = !DILocation(line: 116, column: 43, scope: !137)
!152 = !DILocation(line: 378, column: 71, scope: !150, inlinedAt: !151)
!153 = distinct !DISubprogram(name: "native_stat", linkageName: "std.io.os.native_stat", scope: !70, file: !70, line: 4, type: !154, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!154 = !DISubroutineType(types: !155)
!155 = !{!36, !43, !156, !13}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Stat*", baseType: !77, size: 64, align: 64, dwarfAddressSpace: 0)
!157 = !DILocalVariable(name: "stat", arg: 1, scope: !153, file: !70, line: 4, type: !156)
!158 = !DILocation(line: 4, column: 28, scope: !153)
!159 = !DILocalVariable(name: "path", arg: 2, scope: !153, file: !70, line: 4, type: !13)
!160 = !DILocation(line: 4, column: 41, scope: !153)
!161 = !DILocalVariable(name: "current", scope: !162, file: !70, line: 536, type: !164, align: 8)
!162 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !163, file: !163, line: 534, scopeLine: 534, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !46)
!163 = !DIFile(filename: "mem.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !165, size: 64, align: 64, dwarfAddressSpace: 0)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !70, file: !70, line: 10, size: 320, align: 64, elements: !166, identifier: "std.core.mem.allocator.TempAllocator")
!166 = !{!167, !168, !181, !182, !183}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !165, file: !70, line: 12, baseType: !40, size: 128, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !165, file: !70, line: 13, baseType: !169, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !170, size: 64, align: 64, dwarfAddressSpace: 0)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !70, file: !70, line: 22, size: 320, align: 64, elements: !171, identifier: "std.core.mem.allocator.TempAllocatorPage")
!171 = !{!172, !173, !174, !175, !176, !177}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !170, file: !70, line: 24, baseType: !169, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !170, file: !70, line: 25, baseType: !43, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !170, file: !70, line: 26, baseType: !20, size: 64, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !170, file: !70, line: 27, baseType: !20, size: 64, align: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !170, file: !70, line: 28, baseType: !20, size: 64, align: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !170, file: !70, line: 29, baseType: !178, align: 8, offset: 320)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, align: 8, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 0, lowerBound: 0)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !165, file: !70, line: 14, baseType: !20, size: 64, align: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !165, file: !70, line: 15, baseType: !20, size: 64, align: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !165, file: !70, line: 16, baseType: !178, align: 8, offset: 320)
!184 = !DILocation(line: 536, column: 17, scope: !162, inlinedAt: !185)
!185 = !DILocation(line: 6, column: 2, scope: !153)
!186 = !DILocation(line: 396, column: 7, scope: !187, inlinedAt: !189)
!187 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !188, file: !188, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!188 = !DIFile(filename: "mem_allocator.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!189 = !DILocation(line: 536, column: 38, scope: !162, inlinedAt: !185)
!190 = !DILocation(line: 398, column: 3, scope: !191, inlinedAt: !189)
!191 = distinct !DILexicalBlock(scope: !187, file: !188, line: 397, column: 2)
!192 = !DILocation(line: 400, column: 9, scope: !187, inlinedAt: !189)
!193 = !DILocalVariable(name: "mark", scope: !162, file: !70, line: 542, type: !20, align: 8)
!194 = !DILocation(line: 542, column: 6, scope: !162, inlinedAt: !185)
!195 = !DILocation(line: 542, column: 13, scope: !162, inlinedAt: !185)
!196 = !DILocalVariable(name: "res", scope: !197, file: !70, line: 9, type: !23, align: 4)
!197 = distinct !DILexicalBlock(scope: !153, file: !70, line: 7, column: 2)
!198 = !DILocation(line: 9, column: 8, scope: !197)
!199 = !DILocation(line: 9, column: 25, scope: !197)
!200 = !DILocation(line: 9, column: 44, scope: !197)
!201 = !DILocation(line: 9, column: 20, scope: !197)
!202 = !DILocation(line: 14, column: 7, scope: !197)
!203 = !DILocation(line: 16, column: 18, scope: !204)
!204 = distinct !DILexicalBlock(scope: !205, file: !70, line: 16, column: 4)
!205 = distinct !DILexicalBlock(scope: !197, file: !70, line: 15, column: 3)
!206 = !DILocation(line: 545, column: 17, scope: !207, inlinedAt: !185)
!207 = distinct !DILexicalBlock(scope: !162, file: !163, line: 544, column: 2)
!208 = !DILocation(line: 545, column: 3, scope: !207, inlinedAt: !185)
!209 = !DILocation(line: 549, column: 2, scope: !207, inlinedAt: !185)
!210 = !DILocation(line: 164, column: 33, scope: !211, inlinedAt: !212)
!211 = distinct !DISubprogram(name: "unreachable", linkageName: "unreachable", scope: !115, file: !115, line: 161, scopeLine: 161, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!212 = !DILocation(line: 21, column: 6, scope: !213)
!213 = distinct !DILexicalBlock(scope: !204, file: !70, line: 21, column: 6)
!214 = !DILocation(line: 164, column: 2, scope: !211, inlinedAt: !212)
!215 = !DILocation(line: 166, column: 2, scope: !211, inlinedAt: !212)
!216 = !DILocation(line: 545, column: 17, scope: !217, inlinedAt: !185)
!217 = distinct !DILexicalBlock(scope: !162, file: !163, line: 544, column: 2)
!218 = !DILocation(line: 545, column: 3, scope: !217, inlinedAt: !185)
!219 = !DILocation(line: 549, column: 2, scope: !217, inlinedAt: !185)
!220 = !DILocation(line: 545, column: 17, scope: !221, inlinedAt: !185)
!221 = distinct !DILexicalBlock(scope: !162, file: !163, line: 544, column: 2)
!222 = !DILocation(line: 545, column: 3, scope: !221, inlinedAt: !185)
!223 = !DILocation(line: 549, column: 2, scope: !221, inlinedAt: !185)
!224 = !DILocation(line: 545, column: 17, scope: !225, inlinedAt: !185)
!225 = distinct !DILexicalBlock(scope: !162, file: !163, line: 544, column: 2)
!226 = !DILocation(line: 545, column: 3, scope: !225, inlinedAt: !185)
!227 = !DILocation(line: 549, column: 2, scope: !225, inlinedAt: !185)
!228 = !DILocation(line: 545, column: 17, scope: !229, inlinedAt: !185)
!229 = distinct !DILexicalBlock(scope: !162, file: !163, line: 544, column: 2)
!230 = !DILocation(line: 545, column: 3, scope: !229, inlinedAt: !185)
!231 = !DILocation(line: 549, column: 2, scope: !229, inlinedAt: !185)
!232 = !DILocation(line: 545, column: 17, scope: !233, inlinedAt: !185)
!233 = distinct !DILexicalBlock(scope: !162, file: !163, line: 544, column: 2)
!234 = !DILocation(line: 545, column: 3, scope: !233, inlinedAt: !185)
!235 = !DILocation(line: 549, column: 2, scope: !233, inlinedAt: !185)
!236 = !DILocation(line: 545, column: 17, scope: !237, inlinedAt: !185)
!237 = distinct !DILexicalBlock(scope: !162, file: !163, line: 544, column: 2)
!238 = !DILocation(line: 545, column: 3, scope: !237, inlinedAt: !185)
!239 = !DILocation(line: 549, column: 2, scope: !237, inlinedAt: !185)
!240 = !DILocation(line: 545, column: 17, scope: !241, inlinedAt: !185)
!241 = distinct !DILexicalBlock(scope: !162, file: !163, line: 544, column: 2)
!242 = !DILocation(line: 545, column: 3, scope: !241, inlinedAt: !185)
!243 = !DILocation(line: 549, column: 2, scope: !241, inlinedAt: !185)
!244 = !DILocation(line: 545, column: 17, scope: !245, inlinedAt: !185)
!245 = distinct !DILexicalBlock(scope: !162, file: !163, line: 544, column: 2)
!246 = !DILocation(line: 545, column: 3, scope: !245, inlinedAt: !185)
!247 = !DILocation(line: 549, column: 2, scope: !245, inlinedAt: !185)
!248 = !DILocation(line: 545, column: 17, scope: !249, inlinedAt: !185)
!249 = distinct !DILexicalBlock(scope: !162, file: !163, line: 544, column: 2)
!250 = !DILocation(line: 545, column: 3, scope: !249, inlinedAt: !185)
!251 = !DILocation(line: 549, column: 2, scope: !249, inlinedAt: !185)
!252 = distinct !DISubprogram(name: "native_file_size", linkageName: "std.io.os.native_file_size", scope: !70, file: !70, line: 56, type: !253, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!253 = !DISubroutineType(types: !254)
!254 = !{!36, !255, !13}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !20, size: 64, align: 64, dwarfAddressSpace: 0)
!256 = !DILocalVariable(name: "path", arg: 1, scope: !252, file: !70, line: 56, type: !13)
!257 = !DILocation(line: 56, column: 33, scope: !252)
!258 = !DILocalVariable(name: "f", scope: !252, file: !70, line: 58, type: !259, align: 8)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !70, file: !70, line: 4, size: 64, align: 64, elements: !260, identifier: "std.io.File")
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !259, file: !70, line: 6, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !70, file: !70, line: 360, baseType: !43, align: 8)
!263 = !DILocation(line: 58, column: 7, scope: !252)
!264 = !DILocation(line: 58, column: 17, scope: !252)
!265 = !DILocation(line: 60, column: 9, scope: !252)
!266 = !DILocation(line: 59, column: 9, scope: !267)
!267 = distinct !DILexicalBlock(scope: !252, file: !70, line: 59, column: 8)
!268 = !DILocation(line: 59, column: 9, scope: !269)
!269 = distinct !DILexicalBlock(scope: !252, file: !70, line: 59, column: 8)
!270 = distinct !DISubprogram(name: "native_rmtree", linkageName: "std.io.os.native_rmtree", scope: !271, file: !271, line: 7, type: !272, scopeLine: 7, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!271 = !DIFile(filename: "rmtree.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/io/os")
!272 = !DISubroutineType(types: !273)
!273 = !{!36, !43, !10}
!274 = !DILocalVariable(name: "dir", arg: 1, scope: !270, file: !271, line: 7, type: !39)
!275 = !DILocation(line: 7, column: 29, scope: !270)
!276 = !DILocation(line: 5, column: 11, scope: !277)
!277 = distinct !DILexicalBlock(scope: !270, file: !271, line: 8, column: 1)
!278 = !DILocalVariable(name: "directory", scope: !270, file: !271, line: 9, type: !279, align: 8)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIRPtr", scope: !271, file: !271, line: 5, baseType: !43, align: 8)
!280 = !DILocation(line: 9, column: 9, scope: !270)
!281 = !DILocation(line: 9, column: 36, scope: !270)
!282 = !DILocation(line: 9, column: 28, scope: !270)
!283 = !DILocation(line: 11, column: 7, scope: !270)
!284 = !DILocation(line: 11, column: 31, scope: !270)
!285 = !DILocation(line: 11, column: 45, scope: !270)
!286 = !DILocation(line: 11, column: 72, scope: !270)
!287 = !DILocation(line: 10, column: 12, scope: !288)
!288 = distinct !DILexicalBlock(scope: !270, file: !271, line: 10, column: 8)
!289 = !DILocation(line: 10, column: 39, scope: !288)
!290 = !DILocation(line: 10, column: 30, scope: !288)
!291 = !DILocation(line: 10, column: 12, scope: !292)
!292 = distinct !DILexicalBlock(scope: !270, file: !271, line: 10, column: 8)
!293 = !DILocation(line: 10, column: 39, scope: !292)
!294 = !DILocation(line: 10, column: 30, scope: !292)
!295 = !DILocalVariable(name: "entry", scope: !270, file: !271, line: 12, type: !296, align: 8)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Posix_dirent*", baseType: !297, size: 64, align: 64, dwarfAddressSpace: 0)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Posix_dirent", scope: !271, file: !271, line: 7, size: 192, align: 64, elements: !298, identifier: "std.os.posix.Posix_dirent")
!298 = !{!299, !300, !301, !303, !304}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "d_fileno", scope: !297, file: !271, line: 9, baseType: !82, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !297, file: !271, line: 10, baseType: !96, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !297, file: !271, line: 11, baseType: !302, size: 16, align: 16, offset: 128)
!302 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !297, file: !271, line: 13, baseType: !18, size: 8, align: 8, offset: 144)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !297, file: !271, line: 25, baseType: !178, align: 8, offset: 152)
!305 = !DILocation(line: 12, column: 16, scope: !270)
!306 = !DILocation(line: 13, column: 2, scope: !270)
!307 = !DILocation(line: 13, column: 33, scope: !308)
!308 = distinct !DILexicalBlock(scope: !270, file: !271, line: 13, column: 2)
!309 = !DILocation(line: 13, column: 25, scope: !308)
!310 = !DILocalVariable(name: "current", scope: !311, file: !271, line: 536, type: !164, align: 8)
!311 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !163, file: !163, line: 534, scopeLine: 534, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !46)
!312 = !DILocation(line: 536, column: 17, scope: !311, inlinedAt: !313)
!313 = !DILocation(line: 15, column: 3, scope: !314)
!314 = distinct !DILexicalBlock(scope: !308, file: !271, line: 14, column: 2)
!315 = !DILocation(line: 396, column: 7, scope: !316, inlinedAt: !317)
!316 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !188, file: !188, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!317 = !DILocation(line: 536, column: 38, scope: !311, inlinedAt: !313)
!318 = !DILocation(line: 398, column: 3, scope: !319, inlinedAt: !317)
!319 = distinct !DILexicalBlock(scope: !316, file: !188, line: 397, column: 2)
!320 = !DILocation(line: 400, column: 9, scope: !316, inlinedAt: !317)
!321 = !DILocalVariable(name: "mark", scope: !311, file: !271, line: 542, type: !20, align: 8)
!322 = !DILocation(line: 542, column: 6, scope: !311, inlinedAt: !313)
!323 = !DILocation(line: 542, column: 13, scope: !311, inlinedAt: !313)
!324 = !DILocalVariable(name: "name", scope: !325, file: !271, line: 17, type: !13, align: 8)
!325 = distinct !DILexicalBlock(scope: !314, file: !271, line: 16, column: 3)
!326 = !DILocation(line: 17, column: 11, scope: !325)
!327 = !DILocation(line: 17, column: 29, scope: !325)
!328 = !DILocation(line: 17, column: 20, scope: !325)
!329 = !DILocation(line: 18, column: 9, scope: !325)
!330 = !DILocation(line: 18, column: 17, scope: !325)
!331 = !DILocation(line: 18, column: 32, scope: !325)
!332 = !DILocation(line: 545, column: 17, scope: !333, inlinedAt: !313)
!333 = distinct !DILexicalBlock(scope: !311, file: !163, line: 544, column: 2)
!334 = !DILocation(line: 545, column: 3, scope: !333, inlinedAt: !313)
!335 = !DILocation(line: 549, column: 2, scope: !333, inlinedAt: !313)
!336 = !DILocalVariable(name: "new_path", scope: !325, file: !271, line: 19, type: !39, align: 8)
!337 = !DILocation(line: 19, column: 9, scope: !325)
!338 = !DILocation(line: 19, column: 20, scope: !325)
!339 = !DILocation(line: 545, column: 17, scope: !340, inlinedAt: !313)
!340 = distinct !DILexicalBlock(scope: !311, file: !163, line: 544, column: 2)
!341 = !DILocation(line: 545, column: 3, scope: !340, inlinedAt: !313)
!342 = !DILocation(line: 10, column: 12, scope: !343)
!343 = distinct !DILexicalBlock(scope: !270, file: !271, line: 10, column: 8)
!344 = !DILocation(line: 10, column: 39, scope: !343)
!345 = !DILocation(line: 10, column: 30, scope: !343)
!346 = !DILocation(line: 20, column: 8, scope: !325)
!347 = !DILocation(line: 22, column: 5, scope: !348)
!348 = distinct !DILexicalBlock(scope: !325, file: !271, line: 21, column: 4)
!349 = !DILocation(line: 545, column: 17, scope: !350, inlinedAt: !313)
!350 = distinct !DILexicalBlock(scope: !311, file: !163, line: 544, column: 2)
!351 = !DILocation(line: 545, column: 3, scope: !350, inlinedAt: !313)
!352 = !DILocation(line: 10, column: 12, scope: !353)
!353 = distinct !DILexicalBlock(scope: !270, file: !271, line: 10, column: 8)
!354 = !DILocation(line: 10, column: 39, scope: !353)
!355 = !DILocation(line: 10, column: 30, scope: !353)
!356 = !DILocation(line: 545, column: 17, scope: !357, inlinedAt: !313)
!357 = distinct !DILexicalBlock(scope: !311, file: !163, line: 544, column: 2)
!358 = !DILocation(line: 545, column: 3, scope: !357, inlinedAt: !313)
!359 = !DILocation(line: 549, column: 2, scope: !357, inlinedAt: !313)
!360 = !DILocation(line: 25, column: 21, scope: !325)
!361 = !DILocation(line: 25, column: 14, scope: !325)
!362 = !DILocation(line: 545, column: 17, scope: !363, inlinedAt: !313)
!363 = distinct !DILexicalBlock(scope: !311, file: !163, line: 544, column: 2)
!364 = !DILocation(line: 545, column: 3, scope: !363, inlinedAt: !313)
!365 = !DILocation(line: 10, column: 12, scope: !366)
!366 = distinct !DILexicalBlock(scope: !270, file: !271, line: 10, column: 8)
!367 = !DILocation(line: 10, column: 39, scope: !366)
!368 = !DILocation(line: 10, column: 30, scope: !366)
!369 = !DILocation(line: 545, column: 17, scope: !370, inlinedAt: !313)
!370 = distinct !DILexicalBlock(scope: !311, file: !163, line: 544, column: 2)
!371 = !DILocation(line: 545, column: 3, scope: !370, inlinedAt: !313)
!372 = !DILocation(line: 549, column: 2, scope: !370, inlinedAt: !313)
!373 = !DILocation(line: 11, column: 22, scope: !374, inlinedAt: !376)
!374 = distinct !DISubprogram(name: "native_rmdir", linkageName: "native_rmdir", scope: !375, file: !375, line: 7, scopeLine: 7, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!375 = !DIFile(filename: "rmdir.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/io/os")
!376 = !DILocation(line: 32, column: 6, scope: !270)
!377 = !DILocation(line: 11, column: 16, scope: !374, inlinedAt: !376)
!378 = !DILocation(line: 11, column: 46, scope: !374, inlinedAt: !376)
!379 = !DILocation(line: 12, column: 18, scope: !380, inlinedAt: !376)
!380 = distinct !DILexicalBlock(scope: !374, file: !375, line: 12, column: 4)
!381 = !DILocation(line: 14, column: 31, scope: !382, inlinedAt: !376)
!382 = distinct !DILexicalBlock(scope: !380, file: !375, line: 14, column: 24)
!383 = !DILocation(line: 18, column: 32, scope: !384, inlinedAt: !376)
!384 = distinct !DILexicalBlock(scope: !380, file: !375, line: 18, column: 25)
!385 = !DILocation(line: 19, column: 38, scope: !386, inlinedAt: !376)
!386 = distinct !DILexicalBlock(scope: !380, file: !375, line: 19, column: 31)
!387 = !DILocation(line: 21, column: 32, scope: !388, inlinedAt: !376)
!388 = distinct !DILexicalBlock(scope: !380, file: !375, line: 21, column: 25)
!389 = !DILocation(line: 22, column: 35, scope: !390, inlinedAt: !376)
!390 = distinct !DILexicalBlock(scope: !380, file: !375, line: 22, column: 28)
!391 = !DILocation(line: 23, column: 31, scope: !392, inlinedAt: !376)
!392 = distinct !DILexicalBlock(scope: !380, file: !375, line: 23, column: 24)
!393 = !DILocation(line: 24, column: 21, scope: !394, inlinedAt: !376)
!394 = distinct !DILexicalBlock(scope: !380, file: !375, line: 24, column: 14)
!395 = !DILocation(line: 10, column: 12, scope: !396)
!396 = distinct !DILexicalBlock(scope: !270, file: !271, line: 10, column: 8)
!397 = !DILocation(line: 10, column: 39, scope: !396)
!398 = !DILocation(line: 10, column: 30, scope: !396)
!399 = !DILocation(line: 10, column: 12, scope: !400)
!400 = distinct !DILexicalBlock(scope: !270, file: !271, line: 10, column: 8)
!401 = !DILocation(line: 10, column: 39, scope: !400)
!402 = !DILocation(line: 10, column: 30, scope: !400)
!403 = distinct !DISubprogram(name: "native_fopen", linkageName: "std.io.os.native_fopen", scope: !28, file: !28, line: 8, type: !404, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!404 = !DISubroutineType(types: !405)
!405 = !{!36, !406, !13, !13}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !43, size: 64, align: 64, dwarfAddressSpace: 0)
!407 = !DILocalVariable(name: "filename", arg: 1, scope: !403, file: !28, line: 8, type: !13)
!408 = !DILocation(line: 8, column: 31, scope: !403)
!409 = !DILocalVariable(name: "mode", arg: 2, scope: !403, file: !28, line: 8, type: !13)
!410 = !DILocation(line: 8, column: 48, scope: !403)
!411 = !DILocation(line: 5, column: 11, scope: !412)
!412 = distinct !DILexicalBlock(scope: !403, file: !28, line: 9, column: 1)
!413 = !DILocation(line: 6, column: 11, scope: !412)
!414 = !DILocalVariable(name: "current", scope: !415, file: !28, line: 536, type: !164, align: 8)
!415 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !163, file: !163, line: 534, scopeLine: 534, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !46)
!416 = !DILocation(line: 536, column: 17, scope: !415, inlinedAt: !417)
!417 = !DILocation(line: 10, column: 2, scope: !403)
!418 = !DILocation(line: 396, column: 7, scope: !419, inlinedAt: !420)
!419 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !188, file: !188, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!420 = !DILocation(line: 536, column: 38, scope: !415, inlinedAt: !417)
!421 = !DILocation(line: 398, column: 3, scope: !422, inlinedAt: !420)
!422 = distinct !DILexicalBlock(scope: !419, file: !188, line: 397, column: 2)
!423 = !DILocation(line: 400, column: 9, scope: !419, inlinedAt: !420)
!424 = !DILocalVariable(name: "mark", scope: !415, file: !28, line: 542, type: !20, align: 8)
!425 = !DILocation(line: 542, column: 6, scope: !415, inlinedAt: !417)
!426 = !DILocation(line: 542, column: 13, scope: !415, inlinedAt: !417)
!427 = !DILocalVariable(name: "file", scope: !428, file: !28, line: 15, type: !43, align: 8)
!428 = distinct !DILexicalBlock(scope: !403, file: !28, line: 11, column: 2)
!429 = !DILocation(line: 15, column: 10, scope: !428)
!430 = !DILocation(line: 15, column: 29, scope: !428)
!431 = !DILocation(line: 15, column: 52, scope: !428)
!432 = !DILocation(line: 15, column: 23, scope: !428)
!433 = !DILocation(line: 17, column: 11, scope: !428)
!434 = !DILocation(line: 90, column: 16, scope: !435, inlinedAt: !437)
!435 = distinct !DILexicalBlock(scope: !436, file: !28, line: 90, column: 2)
!436 = distinct !DISubprogram(name: "file_open_errno", linkageName: "file_open_errno", scope: !28, file: !28, line: 88, scopeLine: 88, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!437 = !DILocation(line: 17, column: 19, scope: !428)
!438 = !DILocation(line: 92, column: 30, scope: !439, inlinedAt: !437)
!439 = distinct !DILexicalBlock(scope: !435, file: !28, line: 92, column: 23)
!440 = !DILocation(line: 93, column: 30, scope: !441, inlinedAt: !437)
!441 = distinct !DILexicalBlock(scope: !435, file: !28, line: 93, column: 23)
!442 = !DILocation(line: 94, column: 29, scope: !443, inlinedAt: !437)
!443 = distinct !DILexicalBlock(scope: !435, file: !28, line: 94, column: 22)
!444 = !DILocation(line: 95, column: 30, scope: !445, inlinedAt: !437)
!445 = distinct !DILexicalBlock(scope: !435, file: !28, line: 95, column: 23)
!446 = !DILocation(line: 96, column: 29, scope: !447, inlinedAt: !437)
!447 = distinct !DILexicalBlock(scope: !435, file: !28, line: 96, column: 22)
!448 = !DILocation(line: 97, column: 30, scope: !449, inlinedAt: !437)
!449 = distinct !DILexicalBlock(scope: !435, file: !28, line: 97, column: 23)
!450 = !DILocation(line: 98, column: 30, scope: !451, inlinedAt: !437)
!451 = distinct !DILexicalBlock(scope: !435, file: !28, line: 98, column: 23)
!452 = !DILocation(line: 99, column: 29, scope: !453, inlinedAt: !437)
!453 = distinct !DILexicalBlock(scope: !435, file: !28, line: 99, column: 22)
!454 = !DILocation(line: 100, column: 30, scope: !455, inlinedAt: !437)
!455 = distinct !DILexicalBlock(scope: !435, file: !28, line: 100, column: 23)
!456 = !DILocation(line: 101, column: 36, scope: !457, inlinedAt: !437)
!457 = distinct !DILexicalBlock(scope: !435, file: !28, line: 101, column: 29)
!458 = !DILocation(line: 102, column: 30, scope: !459, inlinedAt: !437)
!459 = distinct !DILexicalBlock(scope: !435, file: !28, line: 102, column: 23)
!460 = !DILocation(line: 103, column: 31, scope: !461, inlinedAt: !437)
!461 = distinct !DILexicalBlock(scope: !435, file: !28, line: 103, column: 24)
!462 = !DILocation(line: 104, column: 30, scope: !463, inlinedAt: !437)
!463 = distinct !DILexicalBlock(scope: !435, file: !28, line: 104, column: 23)
!464 = !DILocation(line: 105, column: 30, scope: !465, inlinedAt: !437)
!465 = distinct !DILexicalBlock(scope: !435, file: !28, line: 105, column: 23)
!466 = !DILocation(line: 106, column: 29, scope: !467, inlinedAt: !437)
!467 = distinct !DILexicalBlock(scope: !435, file: !28, line: 106, column: 22)
!468 = !DILocation(line: 107, column: 33, scope: !469, inlinedAt: !437)
!469 = distinct !DILexicalBlock(scope: !435, file: !28, line: 107, column: 26)
!470 = !DILocation(line: 108, column: 29, scope: !471, inlinedAt: !437)
!471 = distinct !DILexicalBlock(scope: !435, file: !28, line: 108, column: 22)
!472 = !DILocation(line: 109, column: 34, scope: !473, inlinedAt: !437)
!473 = distinct !DILexicalBlock(scope: !435, file: !28, line: 109, column: 27)
!474 = !DILocation(line: 110, column: 27, scope: !475, inlinedAt: !437)
!475 = distinct !DILexicalBlock(scope: !435, file: !28, line: 110, column: 20)
!476 = !DILocation(line: 111, column: 35, scope: !477, inlinedAt: !437)
!477 = distinct !DILexicalBlock(scope: !435, file: !28, line: 111, column: 28)
!478 = !DILocation(line: 112, column: 19, scope: !479, inlinedAt: !437)
!479 = distinct !DILexicalBlock(scope: !435, file: !28, line: 112, column: 12)
!480 = !DILocation(line: 545, column: 17, scope: !481, inlinedAt: !417)
!481 = distinct !DILexicalBlock(scope: !415, file: !163, line: 544, column: 2)
!482 = !DILocation(line: 545, column: 3, scope: !481, inlinedAt: !417)
!483 = !DILocation(line: 549, column: 2, scope: !481, inlinedAt: !417)
!484 = !DILocation(line: 545, column: 17, scope: !485, inlinedAt: !417)
!485 = distinct !DILexicalBlock(scope: !415, file: !163, line: 544, column: 2)
!486 = !DILocation(line: 545, column: 3, scope: !485, inlinedAt: !417)
!487 = !DILocation(line: 549, column: 2, scope: !485, inlinedAt: !417)
!488 = distinct !DISubprogram(name: "native_remove", linkageName: "std.io.os.native_remove", scope: !28, file: !28, line: 21, type: !489, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!489 = !DISubroutineType(types: !490)
!490 = !{!36, !43, !13}
!491 = !DILocalVariable(name: "filename", arg: 1, scope: !488, file: !28, line: 21, type: !13)
!492 = !DILocation(line: 21, column: 31, scope: !488)
!493 = !DILocalVariable(name: "current", scope: !494, file: !28, line: 536, type: !164, align: 8)
!494 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !163, file: !163, line: 534, scopeLine: 534, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !46)
!495 = !DILocation(line: 536, column: 17, scope: !494, inlinedAt: !496)
!496 = !DILocation(line: 23, column: 2, scope: !488)
!497 = !DILocation(line: 396, column: 7, scope: !498, inlinedAt: !499)
!498 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !188, file: !188, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!499 = !DILocation(line: 536, column: 38, scope: !494, inlinedAt: !496)
!500 = !DILocation(line: 398, column: 3, scope: !501, inlinedAt: !499)
!501 = distinct !DILexicalBlock(scope: !498, file: !188, line: 397, column: 2)
!502 = !DILocation(line: 400, column: 9, scope: !498, inlinedAt: !499)
!503 = !DILocalVariable(name: "mark", scope: !494, file: !28, line: 542, type: !20, align: 8)
!504 = !DILocation(line: 542, column: 6, scope: !494, inlinedAt: !496)
!505 = !DILocation(line: 542, column: 13, scope: !494, inlinedAt: !496)
!506 = !DILocalVariable(name: "result", scope: !507, file: !28, line: 28, type: !93, align: 4)
!507 = distinct !DILexicalBlock(scope: !488, file: !28, line: 24, column: 2)
!508 = !DILocation(line: 28, column: 9, scope: !507)
!509 = !DILocation(line: 28, column: 31, scope: !507)
!510 = !DILocation(line: 28, column: 24, scope: !507)
!511 = !DILocation(line: 30, column: 7, scope: !507)
!512 = !DILocation(line: 32, column: 18, scope: !513)
!513 = distinct !DILexicalBlock(scope: !514, file: !28, line: 32, column: 4)
!514 = distinct !DILexicalBlock(scope: !507, file: !28, line: 31, column: 3)
!515 = !DILocation(line: 545, column: 17, scope: !516, inlinedAt: !496)
!516 = distinct !DILexicalBlock(scope: !494, file: !163, line: 544, column: 2)
!517 = !DILocation(line: 545, column: 3, scope: !516, inlinedAt: !496)
!518 = !DILocation(line: 549, column: 2, scope: !516, inlinedAt: !496)
!519 = !DILocation(line: 545, column: 17, scope: !520, inlinedAt: !496)
!520 = distinct !DILexicalBlock(scope: !494, file: !163, line: 544, column: 2)
!521 = !DILocation(line: 545, column: 3, scope: !520, inlinedAt: !496)
!522 = !DILocation(line: 549, column: 2, scope: !520, inlinedAt: !496)
!523 = !DILocation(line: 545, column: 17, scope: !524, inlinedAt: !496)
!524 = distinct !DILexicalBlock(scope: !494, file: !163, line: 544, column: 2)
!525 = !DILocation(line: 545, column: 3, scope: !524, inlinedAt: !496)
!526 = !DILocation(line: 549, column: 2, scope: !524, inlinedAt: !496)
!527 = distinct !DISubprogram(name: "native_freopen", linkageName: "std.io.os.native_freopen", scope: !28, file: !28, line: 48, type: !528, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!528 = !DISubroutineType(types: !529)
!529 = !{!36, !406, !43, !13, !13}
!530 = !DILocalVariable(name: "file", arg: 1, scope: !527, file: !28, line: 48, type: !43)
!531 = !DILocation(line: 48, column: 32, scope: !527)
!532 = !DILocalVariable(name: "filename", arg: 2, scope: !527, file: !28, line: 48, type: !13)
!533 = !DILocation(line: 48, column: 45, scope: !527)
!534 = !DILocalVariable(name: "mode", arg: 3, scope: !527, file: !28, line: 48, type: !13)
!535 = !DILocation(line: 48, column: 62, scope: !527)
!536 = !DILocation(line: 45, column: 11, scope: !537)
!537 = distinct !DILexicalBlock(scope: !527, file: !28, line: 49, column: 1)
!538 = !DILocation(line: 46, column: 11, scope: !537)
!539 = !DILocalVariable(name: "current", scope: !540, file: !28, line: 536, type: !164, align: 8)
!540 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !163, file: !163, line: 534, scopeLine: 534, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !46)
!541 = !DILocation(line: 536, column: 17, scope: !540, inlinedAt: !542)
!542 = !DILocation(line: 50, column: 2, scope: !527)
!543 = !DILocation(line: 396, column: 7, scope: !544, inlinedAt: !545)
!544 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !188, file: !188, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!545 = !DILocation(line: 536, column: 38, scope: !540, inlinedAt: !542)
!546 = !DILocation(line: 398, column: 3, scope: !547, inlinedAt: !545)
!547 = distinct !DILexicalBlock(scope: !544, file: !188, line: 397, column: 2)
!548 = !DILocation(line: 400, column: 9, scope: !544, inlinedAt: !545)
!549 = !DILocalVariable(name: "mark", scope: !540, file: !28, line: 542, type: !20, align: 8)
!550 = !DILocation(line: 542, column: 6, scope: !540, inlinedAt: !542)
!551 = !DILocation(line: 542, column: 13, scope: !540, inlinedAt: !542)
!552 = !DILocation(line: 55, column: 25, scope: !553)
!553 = distinct !DILexicalBlock(scope: !527, file: !28, line: 51, column: 2)
!554 = !DILocation(line: 55, column: 48, scope: !553)
!555 = !DILocation(line: 55, column: 67, scope: !553)
!556 = !DILocation(line: 55, column: 17, scope: !553)
!557 = !DILocation(line: 57, column: 11, scope: !553)
!558 = !DILocation(line: 90, column: 16, scope: !559, inlinedAt: !561)
!559 = distinct !DILexicalBlock(scope: !560, file: !28, line: 90, column: 2)
!560 = distinct !DISubprogram(name: "file_open_errno", linkageName: "file_open_errno", scope: !28, file: !28, line: 88, scopeLine: 88, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!561 = !DILocation(line: 57, column: 19, scope: !553)
!562 = !DILocation(line: 92, column: 30, scope: !563, inlinedAt: !561)
!563 = distinct !DILexicalBlock(scope: !559, file: !28, line: 92, column: 23)
!564 = !DILocation(line: 93, column: 30, scope: !565, inlinedAt: !561)
!565 = distinct !DILexicalBlock(scope: !559, file: !28, line: 93, column: 23)
!566 = !DILocation(line: 94, column: 29, scope: !567, inlinedAt: !561)
!567 = distinct !DILexicalBlock(scope: !559, file: !28, line: 94, column: 22)
!568 = !DILocation(line: 95, column: 30, scope: !569, inlinedAt: !561)
!569 = distinct !DILexicalBlock(scope: !559, file: !28, line: 95, column: 23)
!570 = !DILocation(line: 96, column: 29, scope: !571, inlinedAt: !561)
!571 = distinct !DILexicalBlock(scope: !559, file: !28, line: 96, column: 22)
!572 = !DILocation(line: 97, column: 30, scope: !573, inlinedAt: !561)
!573 = distinct !DILexicalBlock(scope: !559, file: !28, line: 97, column: 23)
!574 = !DILocation(line: 98, column: 30, scope: !575, inlinedAt: !561)
!575 = distinct !DILexicalBlock(scope: !559, file: !28, line: 98, column: 23)
!576 = !DILocation(line: 99, column: 29, scope: !577, inlinedAt: !561)
!577 = distinct !DILexicalBlock(scope: !559, file: !28, line: 99, column: 22)
!578 = !DILocation(line: 100, column: 30, scope: !579, inlinedAt: !561)
!579 = distinct !DILexicalBlock(scope: !559, file: !28, line: 100, column: 23)
!580 = !DILocation(line: 101, column: 36, scope: !581, inlinedAt: !561)
!581 = distinct !DILexicalBlock(scope: !559, file: !28, line: 101, column: 29)
!582 = !DILocation(line: 102, column: 30, scope: !583, inlinedAt: !561)
!583 = distinct !DILexicalBlock(scope: !559, file: !28, line: 102, column: 23)
!584 = !DILocation(line: 103, column: 31, scope: !585, inlinedAt: !561)
!585 = distinct !DILexicalBlock(scope: !559, file: !28, line: 103, column: 24)
!586 = !DILocation(line: 104, column: 30, scope: !587, inlinedAt: !561)
!587 = distinct !DILexicalBlock(scope: !559, file: !28, line: 104, column: 23)
!588 = !DILocation(line: 105, column: 30, scope: !589, inlinedAt: !561)
!589 = distinct !DILexicalBlock(scope: !559, file: !28, line: 105, column: 23)
!590 = !DILocation(line: 106, column: 29, scope: !591, inlinedAt: !561)
!591 = distinct !DILexicalBlock(scope: !559, file: !28, line: 106, column: 22)
!592 = !DILocation(line: 107, column: 33, scope: !593, inlinedAt: !561)
!593 = distinct !DILexicalBlock(scope: !559, file: !28, line: 107, column: 26)
!594 = !DILocation(line: 108, column: 29, scope: !595, inlinedAt: !561)
!595 = distinct !DILexicalBlock(scope: !559, file: !28, line: 108, column: 22)
!596 = !DILocation(line: 109, column: 34, scope: !597, inlinedAt: !561)
!597 = distinct !DILexicalBlock(scope: !559, file: !28, line: 109, column: 27)
!598 = !DILocation(line: 110, column: 27, scope: !599, inlinedAt: !561)
!599 = distinct !DILexicalBlock(scope: !559, file: !28, line: 110, column: 20)
!600 = !DILocation(line: 111, column: 35, scope: !601, inlinedAt: !561)
!601 = distinct !DILexicalBlock(scope: !559, file: !28, line: 111, column: 28)
!602 = !DILocation(line: 112, column: 19, scope: !603, inlinedAt: !561)
!603 = distinct !DILexicalBlock(scope: !559, file: !28, line: 112, column: 12)
!604 = !DILocation(line: 545, column: 17, scope: !605, inlinedAt: !542)
!605 = distinct !DILexicalBlock(scope: !540, file: !163, line: 544, column: 2)
!606 = !DILocation(line: 545, column: 3, scope: !605, inlinedAt: !542)
!607 = !DILocation(line: 549, column: 2, scope: !605, inlinedAt: !542)
!608 = !DILocation(line: 545, column: 17, scope: !609, inlinedAt: !542)
!609 = distinct !DILexicalBlock(scope: !540, file: !163, line: 544, column: 2)
!610 = !DILocation(line: 545, column: 3, scope: !609, inlinedAt: !542)
!611 = !DILocation(line: 549, column: 2, scope: !609, inlinedAt: !542)
!612 = distinct !DISubprogram(name: "native_fseek", linkageName: "std.io.os.native_fseek", scope: !28, file: !28, line: 61, type: !613, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!613 = !DISubroutineType(types: !614)
!614 = !{!36, !43, !43, !37, !27}
!615 = !DILocalVariable(name: "file", arg: 1, scope: !612, file: !28, line: 61, type: !43)
!616 = !DILocation(line: 61, column: 29, scope: !612)
!617 = !DILocalVariable(name: "offset", arg: 2, scope: !612, file: !28, line: 61, type: !618)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !37)
!619 = !DILocation(line: 61, column: 39, scope: !612)
!620 = !DILocalVariable(name: "seek_mode", arg: 3, scope: !612, file: !28, line: 61, type: !27)
!621 = !DILocation(line: 61, column: 52, scope: !612)
!622 = !DILocation(line: 63, column: 44, scope: !612)
!623 = !DILocation(line: 63, column: 12, scope: !612)
!624 = !DILocation(line: 118, column: 16, scope: !625, inlinedAt: !627)
!625 = distinct !DILexicalBlock(scope: !626, file: !28, line: 118, column: 2)
!626 = distinct !DISubprogram(name: "file_seek_errno", linkageName: "file_seek_errno", scope: !28, file: !28, line: 116, scopeLine: 116, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!627 = !DILocation(line: 63, column: 68, scope: !612)
!628 = !DILocation(line: 120, column: 30, scope: !629, inlinedAt: !627)
!629 = distinct !DILexicalBlock(scope: !625, file: !28, line: 120, column: 23)
!630 = !DILocation(line: 121, column: 29, scope: !631, inlinedAt: !627)
!631 = distinct !DILexicalBlock(scope: !625, file: !28, line: 121, column: 22)
!632 = !DILocation(line: 122, column: 33, scope: !633, inlinedAt: !627)
!633 = distinct !DILexicalBlock(scope: !625, file: !28, line: 122, column: 26)
!634 = !DILocation(line: 123, column: 29, scope: !635, inlinedAt: !627)
!635 = distinct !DILexicalBlock(scope: !625, file: !28, line: 123, column: 22)
!636 = !DILocation(line: 124, column: 30, scope: !637, inlinedAt: !627)
!637 = distinct !DILexicalBlock(scope: !625, file: !28, line: 124, column: 23)
!638 = !DILocation(line: 125, column: 27, scope: !639, inlinedAt: !627)
!639 = distinct !DILexicalBlock(scope: !625, file: !28, line: 125, column: 20)
!640 = !DILocation(line: 126, column: 30, scope: !641, inlinedAt: !627)
!641 = distinct !DILexicalBlock(scope: !625, file: !28, line: 126, column: 23)
!642 = !DILocation(line: 127, column: 29, scope: !643, inlinedAt: !627)
!643 = distinct !DILexicalBlock(scope: !625, file: !28, line: 127, column: 22)
!644 = !DILocation(line: 128, column: 29, scope: !645, inlinedAt: !627)
!645 = distinct !DILexicalBlock(scope: !625, file: !28, line: 128, column: 22)
!646 = !DILocation(line: 129, column: 29, scope: !647, inlinedAt: !627)
!647 = distinct !DILexicalBlock(scope: !625, file: !28, line: 129, column: 22)
!648 = !DILocation(line: 130, column: 30, scope: !649, inlinedAt: !627)
!649 = distinct !DILexicalBlock(scope: !625, file: !28, line: 130, column: 23)
!650 = !DILocation(line: 131, column: 19, scope: !651, inlinedAt: !627)
!651 = distinct !DILexicalBlock(scope: !625, file: !28, line: 131, column: 12)
!652 = distinct !DISubprogram(name: "native_ftell", linkageName: "std.io.os.native_ftell", scope: !28, file: !28, line: 67, type: !653, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!653 = !DISubroutineType(types: !654)
!654 = !{!36, !255, !43}
!655 = !DILocalVariable(name: "file", arg: 1, scope: !652, file: !28, line: 67, type: !262)
!656 = !DILocation(line: 67, column: 28, scope: !652)
!657 = !DILocalVariable(name: "index", scope: !652, file: !28, line: 69, type: !37, align: 8)
!658 = !DILocation(line: 69, column: 7, scope: !652)
!659 = !DILocation(line: 69, column: 27, scope: !652)
!660 = !DILocation(line: 69, column: 21, scope: !652)
!661 = !DILocation(line: 70, column: 9, scope: !652)
!662 = !DILocation(line: 70, column: 23, scope: !652)
!663 = !DILocation(line: 118, column: 16, scope: !664, inlinedAt: !666)
!664 = distinct !DILexicalBlock(scope: !665, file: !28, line: 118, column: 2)
!665 = distinct !DISubprogram(name: "file_seek_errno", linkageName: "file_seek_errno", scope: !28, file: !28, line: 116, scopeLine: 116, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!666 = !DILocation(line: 70, column: 35, scope: !652)
!667 = !DILocation(line: 120, column: 30, scope: !668, inlinedAt: !666)
!668 = distinct !DILexicalBlock(scope: !664, file: !28, line: 120, column: 23)
!669 = !DILocation(line: 121, column: 29, scope: !670, inlinedAt: !666)
!670 = distinct !DILexicalBlock(scope: !664, file: !28, line: 121, column: 22)
!671 = !DILocation(line: 122, column: 33, scope: !672, inlinedAt: !666)
!672 = distinct !DILexicalBlock(scope: !664, file: !28, line: 122, column: 26)
!673 = !DILocation(line: 123, column: 29, scope: !674, inlinedAt: !666)
!674 = distinct !DILexicalBlock(scope: !664, file: !28, line: 123, column: 22)
!675 = !DILocation(line: 124, column: 30, scope: !676, inlinedAt: !666)
!676 = distinct !DILexicalBlock(scope: !664, file: !28, line: 124, column: 23)
!677 = !DILocation(line: 125, column: 27, scope: !678, inlinedAt: !666)
!678 = distinct !DILexicalBlock(scope: !664, file: !28, line: 125, column: 20)
!679 = !DILocation(line: 126, column: 30, scope: !680, inlinedAt: !666)
!680 = distinct !DILexicalBlock(scope: !664, file: !28, line: 126, column: 23)
!681 = !DILocation(line: 127, column: 29, scope: !682, inlinedAt: !666)
!682 = distinct !DILexicalBlock(scope: !664, file: !28, line: 127, column: 22)
!683 = !DILocation(line: 128, column: 29, scope: !684, inlinedAt: !666)
!684 = distinct !DILexicalBlock(scope: !664, file: !28, line: 128, column: 22)
!685 = !DILocation(line: 129, column: 29, scope: !686, inlinedAt: !666)
!686 = distinct !DILexicalBlock(scope: !664, file: !28, line: 129, column: 22)
!687 = !DILocation(line: 130, column: 30, scope: !688, inlinedAt: !666)
!688 = distinct !DILexicalBlock(scope: !664, file: !28, line: 130, column: 23)
!689 = !DILocation(line: 131, column: 19, scope: !690, inlinedAt: !666)
!690 = distinct !DILexicalBlock(scope: !664, file: !28, line: 131, column: 12)
!691 = distinct !DISubprogram(name: "native_fwrite", linkageName: "std.io.os.native_fwrite", scope: !28, file: !28, line: 73, type: !692, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!692 = !DISubroutineType(types: !693)
!693 = !{!36, !255, !43, !14}
!694 = !DILocalVariable(name: "file", arg: 1, scope: !691, file: !28, line: 73, type: !262)
!695 = !DILocation(line: 73, column: 29, scope: !691)
!696 = !DILocalVariable(name: "buffer", arg: 2, scope: !691, file: !28, line: 73, type: !14)
!697 = !DILocation(line: 73, column: 42, scope: !691)
!698 = !DILocation(line: 75, column: 22, scope: !691)
!699 = !DILocation(line: 75, column: 37, scope: !691)
!700 = !DILocation(line: 75, column: 49, scope: !691)
!701 = !DILocation(line: 75, column: 15, scope: !691)
!702 = distinct !DISubprogram(name: "native_fputc", linkageName: "std.io.os.native_fputc", scope: !28, file: !28, line: 78, type: !703, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!703 = !DISubroutineType(types: !704)
!704 = !{!36, !43, !23, !43}
!705 = !DILocalVariable(name: "c", arg: 1, scope: !702, file: !28, line: 78, type: !93)
!706 = !DILocation(line: 78, column: 28, scope: !702)
!707 = !DILocalVariable(name: "stream", arg: 2, scope: !702, file: !28, line: 78, type: !262)
!708 = !DILocation(line: 78, column: 37, scope: !702)
!709 = !DILocation(line: 80, column: 22, scope: !702)
!710 = !DILocation(line: 80, column: 13, scope: !702)
!711 = !DILocation(line: 80, column: 38, scope: !702)
!712 = distinct !DISubprogram(name: "native_fread", linkageName: "std.io.os.native_fread", scope: !28, file: !28, line: 83, type: !692, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!713 = !DILocalVariable(name: "file", arg: 1, scope: !712, file: !28, line: 83, type: !262)
!714 = !DILocation(line: 83, column: 28, scope: !712)
!715 = !DILocalVariable(name: "buffer", arg: 2, scope: !712, file: !28, line: 83, type: !14)
!716 = !DILocation(line: 83, column: 41, scope: !712)
!717 = !DILocation(line: 85, column: 21, scope: !712)
!718 = !DILocation(line: 85, column: 36, scope: !712)
!719 = !DILocation(line: 85, column: 48, scope: !712)
!720 = !DILocation(line: 85, column: 15, scope: !712)
!721 = distinct !DISubprogram(name: "native_ls", linkageName: "std.io.os.native_ls", scope: !722, file: !722, line: 4, type: !723, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !46)
!722 = !DIFile(filename: "ls.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/io/os")
!723 = !DISubroutineType(types: !724)
!724 = !{!36, !725, !10, !73, !73, !13, !40}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PathList*", baseType: !726, size: 64, align: 64, dwarfAddressSpace: 0)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathList", scope: !722, file: !722, line: 10, baseType: !727, align: 8)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !722, file: !722, line: 14, size: 320, align: 64, elements: !728, identifier: "std_collections_list$std.io.path.PathImp$.List")
!728 = !{!729, !730, !731, !732}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !727, file: !722, line: 16, baseType: !20, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !727, file: !722, line: 17, baseType: !20, size: 64, align: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !727, file: !722, line: 18, baseType: !40, size: 128, align: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !727, file: !722, line: 19, baseType: !733, size: 64, align: 64, offset: 256)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !734, size: 64, align: 64, dwarfAddressSpace: 0)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !722, file: !722, line: 10, baseType: !10, align: 8)
!735 = !DILocalVariable(name: "dir", arg: 1, scope: !721, file: !722, line: 4, type: !39)
!736 = !DILocation(line: 4, column: 29, scope: !721)
!737 = !DILocalVariable(name: "no_dirs", arg: 2, scope: !721, file: !722, line: 4, type: !73)
!738 = !DILocation(line: 4, column: 39, scope: !721)
!739 = !DILocalVariable(name: "no_symlinks", arg: 3, scope: !721, file: !722, line: 4, type: !73)
!740 = !DILocation(line: 4, column: 53, scope: !721)
!741 = !DILocalVariable(name: "mask", arg: 4, scope: !721, file: !722, line: 4, type: !13)
!742 = !DILocation(line: 4, column: 73, scope: !721)
!743 = !DILocalVariable(name: "allocator", arg: 5, scope: !721, file: !722, line: 4, type: !40)
!744 = !DILocation(line: 4, column: 89, scope: !721)
!745 = !DILocalVariable(name: "list", scope: !721, file: !722, line: 6, type: !726, align: 8)
!746 = !DILocation(line: 6, column: 11, scope: !721)
!747 = !DILocation(line: 7, column: 27, scope: !721)
!748 = !DILocation(line: 7, column: 2, scope: !721)
!749 = !DILocalVariable(name: "directory", scope: !721, file: !722, line: 8, type: !279, align: 8)
!750 = !DILocation(line: 8, column: 9, scope: !721)
!751 = !DILocation(line: 8, column: 36, scope: !721)
!752 = !DILocation(line: 8, column: 53, scope: !721)
!753 = !DILocation(line: 8, column: 70, scope: !721)
!754 = !DILocation(line: 8, column: 28, scope: !721)
!755 = !DILocation(line: 10, column: 7, scope: !721)
!756 = !DILocation(line: 10, column: 32, scope: !721)
!757 = !DILocation(line: 10, column: 72, scope: !721)
!758 = !DILocation(line: 9, column: 12, scope: !759)
!759 = distinct !DILexicalBlock(scope: !721, file: !722, line: 9, column: 8)
!760 = !DILocation(line: 9, column: 39, scope: !759)
!761 = !DILocation(line: 9, column: 30, scope: !759)
!762 = !DILocalVariable(name: "entry", scope: !721, file: !722, line: 11, type: !296, align: 8)
!763 = !DILocation(line: 11, column: 16, scope: !721)
!764 = !DILocation(line: 12, column: 2, scope: !721)
!765 = !DILocation(line: 12, column: 33, scope: !766)
!766 = distinct !DILexicalBlock(scope: !721, file: !722, line: 12, column: 2)
!767 = !DILocation(line: 12, column: 25, scope: !766)
!768 = !DILocalVariable(name: "name", scope: !769, file: !722, line: 14, type: !13, align: 8)
!769 = distinct !DILexicalBlock(scope: !766, file: !722, line: 13, column: 2)
!770 = !DILocation(line: 14, column: 10, scope: !769)
!771 = !DILocation(line: 14, column: 28, scope: !769)
!772 = !DILocation(line: 14, column: 19, scope: !769)
!773 = !DILocation(line: 15, column: 8, scope: !769)
!774 = !DILocation(line: 15, column: 16, scope: !769)
!775 = !DILocation(line: 15, column: 31, scope: !769)
!776 = !DILocation(line: 15, column: 45, scope: !769)
!777 = !DILocation(line: 16, column: 7, scope: !769)
!778 = !DILocation(line: 16, column: 40, scope: !769)
!779 = !DILocation(line: 16, column: 53, scope: !769)
!780 = !DILocation(line: 17, column: 7, scope: !769)
!781 = !DILocation(line: 17, column: 40, scope: !769)
!782 = !DILocation(line: 17, column: 49, scope: !769)
!783 = !DILocalVariable(name: "path", scope: !769, file: !722, line: 18, type: !39, align: 8)
!784 = !DILocation(line: 18, column: 8, scope: !769)
!785 = !DILocation(line: 18, column: 21, scope: !769)
!786 = !DILocation(line: 19, column: 3, scope: !769)
!787 = !DILocation(line: 9, column: 12, scope: !788)
!788 = distinct !DILexicalBlock(scope: !721, file: !722, line: 9, column: 8)
!789 = !DILocation(line: 9, column: 39, scope: !788)
!790 = !DILocation(line: 9, column: 30, scope: !788)
