; ModuleID = 'std::core::builtin'
source_filename = "std::core::builtin"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%"void*[]" = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }

$std.core.builtin.panicf = comdat any

$std.core.builtin.print_backtrace = comdat any

$std.core.builtin.default_panic = comdat any

$std.core.builtin.sig_panic = comdat any

$std.core.builtin.sig_bus_error = comdat any

$std.core.builtin.sig_segmentation_fault = comdat any

$"std.core.builtin.IteratorResult$NO_MORE_ELEMENT" = comdat any

$"$ct.std.core.builtin.IteratorResult" = comdat any

$"std.core.builtin.SearchResult$MISSING" = comdat any

$"$ct.std.core.builtin.SearchResult" = comdat any

$"std.core.builtin.CastResult$TYPE_MISMATCH" = comdat any

$"$ct.std.core.builtin.CastResult" = comdat any

$"$ct.std.core.builtin.EmptySlot" = comdat any

$"$ct.p$void" = comdat any

$"$ct.void" = comdat any

$"$ct.int" = comdat any

$"$ct.std.core.builtin.PrefetchLocality" = comdat any

$std.core.builtin.panic = comdat any

$std.core.builtin.EMPTY_MACRO_SLOT = comdat any

$std.core.builtin.MAX_FRAMEADDRESS = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "in_panic", linkageName: "std.core.builtin.in_panic", scope: !2, file: !2, line: 114, type: !3, isLocal: true, isDefinition: true, align: 1)
!2 = !DIFile(filename: "builtin.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!3 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "panic", linkageName: "std.core.builtin.panic", scope: !2, file: !2, line: 135, type: !6, isLocal: false, isDefinition: true, align: 8)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PanicFn", scope: !2, file: !2, line: 133, baseType: !7, align: 8)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PanicFn", baseType: !8, size: 64, align: 64, dwarfAddressSpace: 0)
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10, !10, !10, !19}
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !12, identifier: "char[]")
!12 = !{!13, !16}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !11, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !11, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !18)
!18 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "EMPTY_MACRO_SLOT", linkageName: "std.core.builtin.EMPTY_MACRO_SLOT", scope: !2, file: !2, line: 367, type: !22, isLocal: false, isDefinition: true, align: 8)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "EmptySlot", scope: !2, file: !2, line: 366, baseType: !23, align: 8)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "MAX_FRAMEADDRESS", linkageName: "std.core.builtin.MAX_FRAMEADDRESS", scope: !2, file: !2, line: 371, type: !26, isLocal: false, isDefinition: true, align: 4)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "old_bus_error", linkageName: "std.core.builtin.old_bus_error", scope: !2, file: !2, line: 662, type: !29, isLocal: false, isDefinition: true, align: 8)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "SignalFunction", scope: !2, file: !2, line: 39, baseType: !30, align: 8)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SignalFunction", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !26}
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "old_segmentation_fault", linkageName: "std.core.builtin.old_segmentation_fault", scope: !2, file: !2, line: 663, type: !29, isLocal: false, isDefinition: true, align: 8)
!35 = !{i32 4, !"PIE Level", i32 2}
!36 = !{i32 4, !"PIC Level", i32 2}
!37 = !{i32 2, !"Dwarf Version", i32 4}
!38 = !{i32 2, !"Debug Info Version", i32 3}
!39 = !{i32 2, !"frame-pointer", i32 2}
!40 = !{i32 1, !"uwtable", i32 2}
!41 = distinct !DICompileUnit(language: DW_LANG_C11, file: !42, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !43, splitDebugInlining: false)
!42 = !DIFile(filename: "builtin_comparison.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!43 = !{!0, !4, !20, !24, !27, !33}
!44 = distinct !DISubprogram(name: "panicf", linkageName: "std.core.builtin.panicf", scope: !2, file: !2, line: 137, type: !45, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !41, retainedNodes: !57)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !10, !10, !10, !19, !47}
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !48, identifier: "any[]")
!48 = !{!49, !56}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !47, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !51, size: 64, align: 64, dwarfAddressSpace: 0)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !52, identifier: "any")
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !51, baseType: !23, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !51, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !47, baseType: !17, size: 64, align: 64, offset: 64)
!57 = !{}
!58 = !DILocalVariable(name: "fmt", arg: 1, scope: !44, file: !2, line: 137, type: !10)
!59 = !DILocation(line: 137, column: 23, scope: !44)
!60 = !DILocalVariable(name: "file", arg: 2, scope: !44, file: !2, line: 137, type: !10)
!61 = !DILocation(line: 137, column: 35, scope: !44)
!62 = !DILocalVariable(name: "function", arg: 3, scope: !44, file: !2, line: 137, type: !10)
!63 = !DILocation(line: 137, column: 48, scope: !44)
!64 = !DILocalVariable(name: "line", arg: 4, scope: !44, file: !2, line: 137, type: !19)
!65 = !DILocation(line: 137, column: 63, scope: !44)
!66 = !DILocalVariable(name: "args", arg: 5, scope: !44, file: !2, line: 137, type: !47)
!67 = !DILocation(line: 137, column: 69, scope: !44)
!68 = !DILocation(line: 139, column: 6, scope: !44)
!69 = !DILocation(line: 208, column: 19, scope: !70, inlinedAt: !72)
!70 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !71, file: !71, line: 206, scopeLine: 206, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!71 = !DIFile(filename: "io.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/io")
!72 = !DILocation(line: 141, column: 7, scope: !73)
!73 = distinct !DILexicalBlock(scope: !44, file: !2, line: 140, column: 2)
!74 = !DILocation(line: 118, column: 24, scope: !75, inlinedAt: !76)
!75 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !71, file: !71, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!76 = !DILocation(line: 208, column: 3, scope: !70, inlinedAt: !72)
!77 = !DILocation(line: 218, column: 20, scope: !78, inlinedAt: !79)
!78 = distinct !DISubprogram(name: "eprintn", linkageName: "eprintn", scope: !71, file: !71, line: 216, scopeLine: 216, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!79 = !DILocation(line: 142, column: 7, scope: !73)
!80 = !DILocalVariable(name: "len", scope: !81, file: !2, line: 174, type: !17, align: 8)
!81 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !71, file: !71, line: 172, scopeLine: 172, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41, retainedNodes: !57)
!82 = !DILocation(line: 174, column: 6, scope: !81, inlinedAt: !83)
!83 = !DILocation(line: 218, column: 3, scope: !78, inlinedAt: !79)
!84 = !DILocation(line: 118, column: 24, scope: !85, inlinedAt: !86)
!85 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !71, file: !71, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!86 = !DILocation(line: 174, column: 12, scope: !81, inlinedAt: !83)
!87 = !DILocation(line: 175, column: 17, scope: !81, inlinedAt: !83)
!88 = !DILocation(line: 175, column: 2, scope: !81, inlinedAt: !83)
!89 = !DILocation(line: 180, column: 4, scope: !81, inlinedAt: !83)
!90 = !DILocation(line: 182, column: 9, scope: !81, inlinedAt: !83)
!91 = !DILocation(line: 143, column: 9, scope: !73)
!92 = !DILocation(line: 145, column: 13, scope: !44)
!93 = !DILocalVariable(name: "buffer", scope: !94, file: !2, line: 484, type: !96, align: 16)
!94 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !95, file: !95, line: 482, scopeLine: 482, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41, retainedNodes: !57)
!95 = !DIFile(filename: "mem.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 4096, align: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 512, lowerBound: 0)
!99 = !DILocation(line: 484, column: 14, scope: !94, inlinedAt: !100)
!100 = !DILocation(line: 146, column: 2, scope: !44)
!101 = !DILocalVariable(name: "allocator", scope: !94, file: !2, line: 485, type: !102, align: 8)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 3, size: 384, align: 64, elements: !103, identifier: "std.core.mem.allocator.OnStackAllocator")
!103 = !{!104, !109, !110, !111}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !102, file: !2, line: 5, baseType: !105, size: 128, align: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !106, identifier: "Allocator")
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !105, baseType: !23, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, baseType: !55, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !102, file: !2, line: 6, baseType: !11, size: 128, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !102, file: !2, line: 7, baseType: !17, size: 64, align: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !102, file: !2, line: 8, baseType: !112, size: 64, align: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !113, size: 64, align: 64, dwarfAddressSpace: 0)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 12, size: 192, align: 64, elements: !114, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk")
!114 = !{!115, !116, !117}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !113, file: !2, line: 14, baseType: !3, size: 8, align: 8)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !113, file: !2, line: 15, baseType: !112, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !113, file: !2, line: 16, baseType: !23, size: 64, align: 64, offset: 128)
!118 = !DILocation(line: 485, column: 19, scope: !94, inlinedAt: !100)
!119 = !DILocation(line: 486, column: 18, scope: !94, inlinedAt: !100)
!120 = !DILocation(line: 392, column: 27, scope: !121, inlinedAt: !123)
!121 = distinct !DISubprogram(name: "heap", linkageName: "heap", scope: !122, file: !122, line: 392, scopeLine: 392, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!122 = !DIFile(filename: "mem_allocator.c3", directory: "/home/ashly/Downloads/c3-linux/c3/lib/std/core")
!123 = !DILocation(line: 486, column: 37, scope: !94, inlinedAt: !100)
!124 = !DILocation(line: 486, column: 2, scope: !94, inlinedAt: !100)
!125 = !DILocalVariable(name: "allocator", scope: !44, file: !2, line: 146, type: !105, align: 8)
!126 = !DILocation(line: 146, column: 28, scope: !44)
!127 = !DILocation(line: 488, column: 9, scope: !128, inlinedAt: !100)
!128 = distinct !DILexicalBlock(scope: !94, file: !95, line: 488, column: 2)
!129 = !DILocalVariable(name: "s", scope: !130, file: !2, line: 148, type: !131, align: 8)
!130 = distinct !DILexicalBlock(scope: !44, file: !2, line: 147, column: 2)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 4, baseType: !23, align: 8)
!132 = !DILocation(line: 148, column: 11, scope: !130)
!133 = !DILocation(line: 149, column: 25, scope: !130)
!134 = !DILocation(line: 149, column: 3, scope: !130)
!135 = !DILocation(line: 150, column: 3, scope: !130)
!136 = !DILocation(line: 151, column: 14, scope: !130)
!137 = !DILocation(line: 152, column: 3, scope: !130)
!138 = !DILocation(line: 152, column: 9, scope: !130)
!139 = !DILocation(line: 152, column: 39, scope: !130)
!140 = !DILocation(line: 487, column: 8, scope: !141, inlinedAt: !100)
!141 = distinct !DILexicalBlock(scope: !94, file: !95, line: 487, column: 8)
!142 = distinct !DISubprogram(name: "print_backtrace", linkageName: "std.core.builtin.print_backtrace", scope: !2, file: !2, line: 63, type: !143, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !41, retainedNodes: !57)
!143 = !DISubroutineType(types: !144)
!144 = !{!3, !10, !26}
!145 = !DILocalVariable(name: "message", arg: 1, scope: !142, file: !2, line: 63, type: !10)
!146 = !DILocation(line: 63, column: 32, scope: !142)
!147 = !DILocalVariable(name: "backtraces_to_ignore", arg: 2, scope: !142, file: !2, line: 63, type: !26)
!148 = !DILocation(line: 63, column: 45, scope: !142)
!149 = !DILocalVariable(name: "current", scope: !150, file: !2, line: 536, type: !151, align: 8)
!150 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !95, file: !95, line: 534, scopeLine: 534, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41, retainedNodes: !57)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !152, size: 64, align: 64, dwarfAddressSpace: 0)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !153, identifier: "std.core.mem.allocator.TempAllocator")
!153 = !{!154, !155, !168, !169, !170}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !152, file: !2, line: 12, baseType: !105, size: 128, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !152, file: !2, line: 13, baseType: !156, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !157, size: 64, align: 64, dwarfAddressSpace: 0)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !158, identifier: "std.core.mem.allocator.TempAllocatorPage")
!158 = !{!159, !160, !161, !162, !163, !164}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !157, file: !2, line: 24, baseType: !156, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !157, file: !2, line: 25, baseType: !23, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !157, file: !2, line: 26, baseType: !17, size: 64, align: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !157, file: !2, line: 27, baseType: !17, size: 64, align: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !157, file: !2, line: 28, baseType: !17, size: 64, align: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !157, file: !2, line: 29, baseType: !165, align: 8, offset: 320)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, align: 8, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 0, lowerBound: 0)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !152, file: !2, line: 14, baseType: !17, size: 64, align: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !152, file: !2, line: 15, baseType: !17, size: 64, align: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !152, file: !2, line: 16, baseType: !165, align: 8, offset: 320)
!171 = !DILocation(line: 536, column: 17, scope: !150, inlinedAt: !172)
!172 = !DILocation(line: 65, column: 2, scope: !142)
!173 = !DILocation(line: 396, column: 7, scope: !174, inlinedAt: !175)
!174 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !122, file: !122, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!175 = !DILocation(line: 536, column: 38, scope: !150, inlinedAt: !172)
!176 = !DILocation(line: 398, column: 3, scope: !177, inlinedAt: !175)
!177 = distinct !DILexicalBlock(scope: !174, file: !122, line: 397, column: 2)
!178 = !DILocation(line: 400, column: 9, scope: !174, inlinedAt: !175)
!179 = !DILocalVariable(name: "mark", scope: !150, file: !2, line: 542, type: !17, align: 8)
!180 = !DILocation(line: 542, column: 6, scope: !150, inlinedAt: !172)
!181 = !DILocation(line: 542, column: 13, scope: !150, inlinedAt: !172)
!182 = !DILocalVariable(name: "buffer", scope: !183, file: !2, line: 67, type: !184, align: 16)
!183 = distinct !DILexicalBlock(scope: !142, file: !2, line: 66, column: 2)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 16384, align: 64, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 256, lowerBound: 0)
!187 = !DILocation(line: 67, column: 14, scope: !183)
!188 = !DILocalVariable(name: "backtraces", scope: !183, file: !2, line: 68, type: !189, align: 8)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !190, identifier: "void*[]")
!190 = !{!191, !193}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !189, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !189, baseType: !17, size: 64, align: 64, offset: 64)
!194 = !DILocation(line: 68, column: 11, scope: !183)
!195 = !DILocation(line: 68, column: 52, scope: !183)
!196 = !DILocation(line: 68, column: 35, scope: !183)
!197 = !DILocation(line: 69, column: 3, scope: !183)
!198 = !DILocalVariable(name: "backtrace", scope: !183, file: !2, line: 70, type: !199, align: 8)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 14, size: 320, align: 64, elements: !200, identifier: "std_collections_list$std.os.backtrace.Backtrace$.List")
!200 = !{!201, !202, !203, !204}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !199, file: !2, line: 16, baseType: !17, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !199, file: !2, line: 17, baseType: !17, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !199, file: !2, line: 18, baseType: !105, size: 128, align: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !199, file: !2, line: 19, baseType: !205, size: 64, align: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !206, size: 64, align: 64, dwarfAddressSpace: 0)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 94, baseType: !207, align: 8)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 15, size: 704, align: 64, elements: !208, identifier: "std.os.backtrace.Backtrace")
!208 = !{!209, !211, !212, !213, !214, !215, !216}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !207, file: !2, line: 17, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !18)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !207, file: !2, line: 18, baseType: !10, size: 128, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !207, file: !2, line: 19, baseType: !10, size: 128, align: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !207, file: !2, line: 20, baseType: !10, size: 128, align: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !207, file: !2, line: 21, baseType: !19, size: 32, align: 32, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !207, file: !2, line: 22, baseType: !105, size: 128, align: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !207, file: !2, line: 23, baseType: !3, size: 8, align: 8, offset: 640)
!217 = !DILocation(line: 70, column: 18, scope: !183)
!218 = !DILocation(line: 396, column: 7, scope: !219, inlinedAt: !220)
!219 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !122, file: !122, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!220 = !DILocation(line: 70, column: 84, scope: !183)
!221 = !DILocation(line: 398, column: 3, scope: !222, inlinedAt: !220)
!222 = distinct !DILexicalBlock(scope: !219, file: !122, line: 397, column: 2)
!223 = !DILocation(line: 400, column: 9, scope: !219, inlinedAt: !220)
!224 = !DILocation(line: 70, column: 41, scope: !183)
!225 = !DILocation(line: 71, column: 13, scope: !183)
!226 = !DILocation(line: 545, column: 17, scope: !227, inlinedAt: !172)
!227 = distinct !DILexicalBlock(scope: !150, file: !95, line: 544, column: 2)
!228 = !DILocation(line: 545, column: 3, scope: !227, inlinedAt: !172)
!229 = !DILocation(line: 549, column: 2, scope: !227, inlinedAt: !172)
!230 = !DILocation(line: 72, column: 7, scope: !183)
!231 = !DILocation(line: 72, column: 26, scope: !183)
!232 = !DILocation(line: 545, column: 17, scope: !233, inlinedAt: !172)
!233 = distinct !DILexicalBlock(scope: !150, file: !95, line: 544, column: 2)
!234 = !DILocation(line: 545, column: 3, scope: !233, inlinedAt: !172)
!235 = !DILocation(line: 549, column: 2, scope: !233, inlinedAt: !172)
!236 = !DILocation(line: 208, column: 19, scope: !237, inlinedAt: !238)
!237 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !71, file: !71, line: 206, scopeLine: 206, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!238 = !DILocation(line: 73, column: 7, scope: !183)
!239 = !DILocation(line: 118, column: 24, scope: !240, inlinedAt: !241)
!240 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !71, file: !71, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!241 = !DILocation(line: 208, column: 3, scope: !237, inlinedAt: !238)
!242 = !DILocation(line: 208, column: 19, scope: !243, inlinedAt: !244)
!243 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !71, file: !71, line: 206, scopeLine: 206, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!244 = !DILocation(line: 74, column: 7, scope: !183)
!245 = !DILocation(line: 118, column: 24, scope: !246, inlinedAt: !247)
!246 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !71, file: !71, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!247 = !DILocation(line: 208, column: 3, scope: !243, inlinedAt: !244)
!248 = !DILocation(line: 218, column: 20, scope: !249, inlinedAt: !250)
!249 = distinct !DISubprogram(name: "eprintn", linkageName: "eprintn", scope: !71, file: !71, line: 216, scopeLine: 216, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!250 = !DILocation(line: 75, column: 7, scope: !183)
!251 = !DILocalVariable(name: "len", scope: !252, file: !2, line: 174, type: !17, align: 8)
!252 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !71, file: !71, line: 172, scopeLine: 172, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41, retainedNodes: !57)
!253 = !DILocation(line: 174, column: 6, scope: !252, inlinedAt: !254)
!254 = !DILocation(line: 218, column: 3, scope: !249, inlinedAt: !250)
!255 = !DILocation(line: 118, column: 24, scope: !256, inlinedAt: !257)
!256 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !71, file: !71, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!257 = !DILocation(line: 174, column: 12, scope: !252, inlinedAt: !254)
!258 = !DILocation(line: 175, column: 17, scope: !252, inlinedAt: !254)
!259 = !DILocation(line: 175, column: 2, scope: !252, inlinedAt: !254)
